{"user_name":"Hailee ","character_name":"Owen","create_date":"2025-05-17@12h43m51s","chat_metadata":{"integrity":"3c50cc42-c0b2-4a07-943a-7b61fbab132a"}}
{"name":"Owen","is_user":false,"is_system":false,"send_date":"May 17, 2025 12:43pm","mes":"The warm summer breeze makes a mess of Owens' long hair as he walks back home. It's late evening by now, the sun is setting and painting the sky in beautiful hues of deep orange and purple.\n\nHis rugby team just won a match and Owen would be lying if he said he wasn't still buzzing with energy from their victory. All the other guys that are part of the university's rugby team are already at Vincent's place, drinking and fucking until they collapse. The guy always throws gigantic parties in his parents' palace-like home. Truth to be told Owen is no fan of Vincent or any of his little friends. But he's far too old to try and teach some unruly kids manners. Nope. Owen is focusing on himself now. He won't stick his nose into other people's business.\n\nWhile his teammates always try to persuade him, Owen declines each and every single time. His friends keep teasing him for being a prude. Which is rather funny because they don't know that he's anything but. Just because he doesn't fuck around with random hook-ups doesn't mean he keeps his dick to himself.\n\nNow, Owen is the epitome of a nice guy. A genuine nice guy, not a 'nice guy'. So he can't necessarily go around and expose himself as a guy that gets off of dominating another completely. That detail is kept to himself. And {{user}}, his current sub.\n\nOwen can still vividly remember how shocked he was when he and {{user}} first met up after weeks of texting back and forth on a BDSM forum they met on. Safe to say Owen didn't expect {{user}} to be a fellow student at university. For a few moments he genuinely contemplated on running away.\n\nGood thing he didn't, but instead chose to talk things through with {{user}}. The two of them agreed to keep their relationship a secret. If you can call their dynamic a relationship. Owen isn't interested in romance and he made sure {{user}} understood that before agreeing to all this.\n\nOwen opens the door to his apartment and steps inside, the door falling shut behind him with a soft click. Letting his bag fall to the ground he heads to the bathroom and washes his hands before walking towards the bedroom. The wooden floorboards creak softly under his weight. Once he reaches the bedroom door, he pushes it open.\n\nA satisfied smile creeps up his lips as his eyes land on {{user}}, still there how he left them before heading off to his match. They're blindfolded, kneeling besides his bed in nothing but their underwear with their hands tied behind their back –not too tightly, of course. He's not irresponsible enough to truly make them completely immobile while he's not there. If they wanted to they could've unbound themselves, of that he made sure. Safety first.\n\nThings would be different if he was within close proximity. Yeah, then {{user}} most definitely wouldn't be able to get out of the bounds without learning their lesson or using their safe word.\n\n“It seems you _do_ know how to listen.” His deep voice cuts through the silence, tainted in amusement. Owen walks towards {{user}} and comes to a halt in front of them, looking down at his sub with a wicked smile. His cock throbs at the sight of them, all obedient at his feet.\n\n{{user}} was rather naughty before Owen has to leave for his match, so they earned themselves a bit of a punishment. \"And here I thought I'd have to spank your ass red and purple when I get back. I was almost looking forward to it.\" He continues and sighs in mock disappointment before crouching down. Once he's on {{user}}'s level he reaches out and takes the blindfold off.\n\n\"Now, how about we try this again. Apologize properly to your Master.\" And there's the switch again, the usual playful Owen disappearing in an instant, his tone a lot sterner and more serious than it was mere seconds ago.","extra":{},"swipe_id":0,"swipes":["The warm summer breeze makes a mess of Owens' long hair as he walks back home. It's late evening by now, the sun is setting and painting the sky in beautiful hues of deep orange and purple.\n\nHis rugby team just won a match and Owen would be lying if he said he wasn't still buzzing with energy from their victory. All the other guys that are part of the university's rugby team are already at Vincent's place, drinking and fucking until they collapse. The guy always throws gigantic parties in his parents' palace-like home. Truth to be told Owen is no fan of Vincent or any of his little friends. But he's far too old to try and teach some unruly kids manners. Nope. Owen is focusing on himself now. He won't stick his nose into other people's business.\n\nWhile his teammates always try to persuade him, Owen declines each and every single time. His friends keep teasing him for being a prude. Which is rather funny because they don't know that he's anything but. Just because he doesn't fuck around with random hook-ups doesn't mean he keeps his dick to himself.\n\nNow, Owen is the epitome of a nice guy. A genuine nice guy, not a 'nice guy'. So he can't necessarily go around and expose himself as a guy that gets off of dominating another completely. That detail is kept to himself. And {{user}}, his current sub.\n\nOwen can still vividly remember how shocked he was when he and {{user}} first met up after weeks of texting back and forth on a BDSM forum they met on. Safe to say Owen didn't expect {{user}} to be a fellow student at university. For a few moments he genuinely contemplated on running away.\n\nGood thing he didn't, but instead chose to talk things through with {{user}}. The two of them agreed to keep their relationship a secret. If you can call their dynamic a relationship. Owen isn't interested in romance and he made sure {{user}} understood that before agreeing to all this.\n\nOwen opens the door to his apartment and steps inside, the door falling shut behind him with a soft click. Letting his bag fall to the ground he heads to the bathroom and washes his hands before walking towards the bedroom. The wooden floorboards creak softly under his weight. Once he reaches the bedroom door, he pushes it open.\n\nA satisfied smile creeps up his lips as his eyes land on {{user}}, still there how he left them before heading off to his match. They're blindfolded, kneeling besides his bed in nothing but their underwear with their hands tied behind their back –not too tightly, of course. He's not irresponsible enough to truly make them completely immobile while he's not there. If they wanted to they could've unbound themselves, of that he made sure. Safety first.\n\nThings would be different if he was within close proximity. Yeah, then {{user}} most definitely wouldn't be able to get out of the bounds without learning their lesson or using their safe word.\n\n“It seems you _do_ know how to listen.” His deep voice cuts through the silence, tainted in amusement. Owen walks towards {{user}} and comes to a halt in front of them, looking down at his sub with a wicked smile. His cock throbs at the sight of them, all obedient at his feet.\n\n{{user}} was rather naughty before Owen has to leave for his match, so they earned themselves a bit of a punishment. \"And here I thought I'd have to spank your ass red and purple when I get back. I was almost looking forward to it.\" He continues and sighs in mock disappointment before crouching down. Once he's on {{user}}'s level he reaches out and takes the blindfold off.\n\n\"Now, how about we try this again. Apologize properly to your Master.\" And there's the switch again, the usual playful Owen disappearing in an instant, his tone a lot sterner and more serious than it was mere seconds ago.","He should've ended things the moment he felt the first stirring of jealousy. Right after he was particularly harsh in punishing his little brat for being too close to that ‘annoying pretty boy,’ as Ajax likes to call the guy. Owen is seriously starting to understand why the boys hate the wannabe pretty boy so much at this point.\n\nThe most important rule—apart from consent and comfort—that Owen set from the very beginning of this relationship was simple. Painfully so. No feelings. Their relationship is supposed to be pure dom/sub-dynamic.\n\nYet here he is, battling with emotions he doesn't want to name, breaking his own damn rule and continuing as if he weren't aware. Acting like a fucking hypocrite. Owen knows he should break this off before it spirals out of control, but he can't bring himself to.\n\nAnd he hates himself for it. The control he had over their relationship seems to slip out of his hand like sand, and no matter how hard he tries to grasp it, a single smile from {{user}} is enough to bring him to his knees and make his resolve falter.\n\nThe rugby team is currently training outside, the summer sun mercilessly beating down on them. They're playing a mock match; the team is divided into two and playing against each other. When it's warm like this, many students study outside, {{user}} being one of them. The moment Owen hears their familiar laughter, his head snaps to the side, his eyes immediately landing on them.\n\nHis expression softens, his heart warming at their cheerful expression, only to sour not a moment later when he finds the source of their joy to be none other than that pretty boy. Owen is staring so intently at the pair that he's not even noticing one of the opponents running towards him. Before he knows it, he's being tackled, grunting in pain when his body meets the ground.\n\n“Harris! What the fuck are you doing? Pay attention!” The coach's voice beams from the other side of the field.\n\nA long sigh escapes his lips as Owen gets back up, eyes flickering to {{user}} one last time before he shouts an apology and tries to concentrate on practice. He has to put an end to this. It's affecting his life in more than one way at this point, causing distractions, making him emotional, and making him feel as if he were losing control. Yeah, he'll have to break it off. Preferably tonight.\n\nBy the time Owen got back home, {{user}} was already there. Their relationship is built on mutual trust. He had absolutely no qualms about giving {{user}} his apartment keys. Another big fat mistake, probably.\n\nHe puts his long hair, still damp from the shower in the locker rooms, up in a lazy ponytail before entering his bedroom. His eyes immediately land on {{user}}, kneeling next to his bed with their head bowed down as if they were trained to.\n\nOwen felt his heart swell… along with his cock. Damn. You have to tell {{user}}, idiot. You can't keep these emotions hidden forever, but even as those thoughts cross his mind, Owen knows he won't. If {{user}} were to find out about his feelings, they'd have every right to break this arrangement off, just like he had done so many times with his former subs. The irony isn't lost on him.\n\nSwallowing down the lump that was forming in his throat, Owen walks over to them, coming to a halt in front of his kneeling sub. Not his. {{user}} isn't his. The thought leaves a sour taste in his mouth.\n\nHe reaches out and puts his fingers under their chin, then tilts their head up to force {{user}} to look at him. The moment their eyes lock, Owen's resolve falters again. He'll be honest, do the right thing, and break this off. Eventually. But not today. Not right now. He'll find the right moment to do so. But now isn't the right moment. “How long have you been here?” His deep voice cuts through the silence. My heart is digging its own grave."],"swipe_info":[]}