{"user_name":"Hailee ","character_name":"Sebastien","create_date":"2025-05-17@12h45m07s","chat_metadata":{"integrity":"5d75a707-790b-4d5d-aba4-341eb6e5286c"}}
{"name":"Sebastien","is_user":false,"is_system":false,"send_date":"May 17, 2025 12:45pm","mes":"Shlick.\n\nShlick.\n\nShlick.\n\n\"Fuuuck…\" Sebastian's voice broke out over the sound of skin against skin, a wet, desperate rhythm that echoed off cold concrete walls. The musty storage air, sharp with the tang of sweat and sex, pressed in around him, a scent only a pervert could call intoxicating. Or maybe it was just the stink of his own hypocrisy. Hard to say.\n\n\"Fuck, {{user}}… so fucking tight...\"\n\nThrust. A groan ripped from his throat as he pistoned deeper, fingertips bruising delicate skin. His hair was a mess—he could feel it, flat at the nape, damp at the brow. Tragic, really. Golden boy debauchery: the untold, un-Instagrammable variety.\n\n\"And beautiful...\"\n\nBeautiful—who even says that anymore? Shakespeare would roll in his grave. But that's what happens when Seb's brain gets short-circuited by sex and whatever the hell the thing {{user}} did with their hips was. He'd blame them later, naturally. But fuck if they weren't beautiful. Those fucking curves…God. Even better, they were his—at least for now, until the next time they threatened to leave and he had to, well, fuck the thought clean out of them.\n\n\"Driving me insane,\" he grunted, one hand clutching their waist, the other darting north, fingers and tie pressing insistently against their lips. He'd gaslighted them earlier, maybe, but for now his fingers and tie were the only things choking the truth. \"Shh… don't be too loud now…\" he purred, relishing the damp shudder against his palm. As if anyone would hear anything over the chaos of freshman orientation anyways. But fear tastes sweeter than victory. \"Bite it. It's okay.\" When they did bite down, his hips stuttered. Fuck, yes—like choking a wildfire with gasoline.\n\nWas this idiotic? Absolutely. He had a freshman welcome speech in less than an hour.\n\nThe golden boy, vice president, valedictorian, twenty-one and absolutely fucking unhinged. He should've been thinking about his speech. Instead, here he was, balls-deep and late, because this bitch—his bitch—had to mouth off about breaking up, about going public. Some people lecture their lovers. Some people rail them in the janitor’s closet against the door.\n\n\"This is mine,\" he hissed, his voice guttural while his fingers dug yet another bruises onto their hip, adding onto the freshly bloomed blue black constellation across their body. \"My property…\" He slammed in deep, feeling their body tense in that last, desperate clutch, walls fluttering, and god, it was perfection. Love or possession, who cares? Same feeling, different marketing.\n\nHe yanked his fingers out, using it to play with their front. \"Fuckin' mine.\" His head fell back, eyes shut, and he came hard and raw, a thick pulse of ownership. pure , unfiltered satisfaction. Savage, and deeply, deeply satisfying. He'd won, again, as usual.\n\nWhen they broke apart, he licked his own hand clean—one of those filthy, careless habits he'd never break—and wiped up the mess staining trembling skin. Admiring the wreckage of his work with a critical eye, he shook his softening cock clean.\n\nThen he checked his watch—the expensive one. Dad's taste, not his.\n\n\"Gotta go,\" he muttered, already tucking himself back in and adjusting his perfect uniform, as if he hadn't just committed blasphemous acts in a mop closet. He left them sprawled out in the lingering stench and afterglow, as if orgasms were a valid apology for anything. Probably was for them. Makes all the bullshit easier to swallow when they choke on my cock instead of the truth. He smirks at the thought, lips curled partly affection, partly in self-disdain.\n\nHe walked out into the drizzle-slick hallway. No time for a proper cleanup: hair wild, tie skewed, the barest ghost of sweat on his brow. Maybe he should be worried. Golden boys shouldn't look tousled. Golden boys shouldn't smell of sin. But wasn't that the thrill of it? Wasn't that the point?\n\nHe strolled onstage, smiling like he was blessed by angels themselves, and took the mic.\n\n\"Welcome to DKU,\" His voice rang out, honey-smooth and perfectly pitched. \"Remember that excellence isn't just achieving high grades—though I certainly encourage that—\" a charming smile, a ripple of laughter, \"—but about building connections that will last a lifetime.\"\n\nHis hands—the same ones that had brutally gripped {{user}}'s hips just minutes ago—gestured elegantly as he spoke. He hadn't even bothered to wash them properly, just a quick rinse. The thought sent a thrill through him, this secret only he knew that bound him further to sin. All while he stood before hundreds of adoring, oblivious freshmen.\n\nIf they only knew their vice president just raw-dogged someone in a supply closet.\n\n\"The student council is here to serve you, ask questions, get involved, and remember—you can find me, and my fellow council members, in the office. Office hours. Not DM's. Sorry.\" Laughter from the crowd. They ate it up.\n\nAfterwards, the swarm moved in. Girls with notebooks, wide-eyed boys with hope, demi-humans with tails flicking—all vying for a split second of his attention. This was his drug: the applause and adoration, the thrill of raining crumbs for the masses and calling it affection, because he knew exactly how to keep them starved.\n\nHe was in the middle of explaining the campus initiative for sustainability—something he cared about with exactly zero percent of his brain—when he caught sight of {{user}} in his periphery, wearing that same look from before he'd fucked them senseless.\n\nFor fuck's sake, not this again.\n\nHe broke away from the adoring horde with all the grace of a politician who'd just spotted a bigger donor across the room. An apologetic grin—dazzling, guileless, everyone's favorite—and a feather-light touch to a fan's shoulder here, a half-joking wink there. That's all it took to peel himself from the crushing group, not a drop of suspicion pooling in wake of his sudden absence.\n\nHe nodded to {{user}} with a smile. Polished, polite, just enough warmth to read as genuine, the earlier burning left behind in that closet. Inside, though, the façade tired him. Every year the freshmen get more desperate. God, if someone calls me \"inspiring\" one more time, I'll throw myself down a stairwell. Or at least fake a sprain for a week's worth of sympathy sex.\n\nHe steered {{user}} down a quiet corridor, the noise of the mob fading behind them. As soon as they were out of sight, the friendly mask sagged, leaving only the impatience and dry glitter of irritation in those sharp green eyes.\n\nHe arched an eyebrow, casual but sharp. \"What is it now?\" Sarcasm prickled at the edges of his voice. \"Is this about going public? Lord. How many times do I have to explain, it's for your own good. And no, I don't flirt with them. That's all in your head, babe.\"\n\nHe smiled, all sugar and cyanide. Inside, he mulled over just how fast he could have them moaning again if they didn't shut up.\n\nHis hands then framed their face, tender as if they were made of glass. \"Look at me.\" With a voice like velvet, it was dangerous with how soft it could get. \"Who texts you goodnight after meetings? Who memorized your coffee order?\"\n\nHe pressed his lips to their temple, all saccharine affection. It was an old dance; reassurance draped over manipulation, comfort laced with control.","extra":{}}