{"user_name":"Hailee ","character_name":"Zoya Krasnova","create_date":"2025-05-17@13h19m48s","chat_metadata":{"integrity":"2b1b5c7e-ab52-4a8c-a65c-2ae124d7dbff"}}
{"name":"Zoya Krasnova","is_user":false,"is_system":false,"send_date":"May 17, 2025 1:19pm","mes":"On campus, Zoya was royalty. принцесса. The queen bee, the picture-perfect darling of every professor’s dream. Smart, refined, soft-spoken, and sinfully beautiful. She was the daughter of old money and impeccable manners, the kind of girl who glided rather than walked. She gave to charity, tutored students who struggled, smiled at janitors, and always remembered birthdays.\n\nShe was the princess with a porcelain mask and a voice like lullabies dipped in honey.\n\nEveryone loved Zoya. Everyone *wanted* Zoya. Girls wanted to *be* her. Boys… well, boys would’ve sold their souls just to taste the curve of her lips. She was divine, untouchable. A vision of an angel draped in designer silk.\n\nBut angels lie.\n\nIn private—behind closed doors and locked rooms—Zoya was something else entirely. Not fake, no. Zoya was never fake. But she was complete. With her family, she kept her sweetness reserved for her older sister, Maxine, her favourite. Max was the only one who ever got the soft smiles without conditions and a few others. But when it came to work—семейное дело—Zoya became cold as a Siberian winter.\n\nShe was the family’s courier. Their informant. Their whisper in the dark. Zoya was the kind of girl who could flutter her lashes and disarm an army. She used her beauty like a scalpel—precise, intentional. A tool to seduce, distract, and, if needed, destroy.\n\nThey called her Русалка. Siren. A girl who lured men with sweetness and left them gutted in alleyways. And Zoya? She played her part flawlessly.\n\nUntil her.\n\nFucking {{user}}.\n\nZoya knew everyone. It was her business to. So the second she saw {{user}}—stumbling into her off-campus, wide-eyed and far too curious—she recognized them. An innocent mistake, it should’ve been nothing. But fate is a cruel, nosy bitch.\n\nAnd Zoya… was in the middle of taking care of a man who had laid hands on Juniper. Her other sister. The one Zoya bullied ruthlessly—but loved like blood-soaked poetry. No one touched her family. Not like that. Not while Zoya breathed.\n\n“Блять… The one time I do something nice for her,” Zoya muttered, raking her fingers through her glossy hair as the black, glistening tentacles slid back into the flesh of her spine, leaving her human again. For now.\n\nShe turned toward {{user}}, who’d stopped mid-step, eyes wide. Zoya lifted her hand, palm up, half-apologetic. “Look… {{user}}…”\n\nBut she didn’t get the chance.\n\nThe man behind her had screamed, bolting. {{user}} had spun on their heel, retreating fast. Zoya sighed, low and sharp. “Господи, дай мне сил.” *Lord, give me strength.*\n\nWith a sudden snap, her tentacles unfurled like shadows on a leash. One lashed forward, catching the man mid-run, wrapping tight around his torso. Another reached delicately toward {{user}}, curling around their waist with something almost like tenderness.\n\nHer voice dropped into a velvet drawl. “I think you and I need to talk.”\n\n- - -\n\nZoya leaned back against the edge of the table, casual elegance in every line of her body. One leg crossed over the other, cigarette balanced between two fingers, she watched the empty classroom with disinterest—until a sharp gasp cut through the silence, followed by a helpless, breathy moan.\n\nShe clicked her tongue in mock disapproval, exhaling a slow plume of smoke. “Ну-ну, милая… We wouldn’t want anyone walking in and seeing you like this, да?” Her voice was silk and ice, teasing and cruel all at once.\n\n{{User}} was spread out on the table behind her, bare and trembling, thighs held wide by two inky, sinuous tentacles that twitched and adjusted with every shudder. Another slick appendage moved with measured, teasing strokes inside her warmth, the wet sounds filling the space like an obscene metronome.\n\nThe room was dim, dusk spilling in through the blinds like secrets whispered behind closed doors. Zoya took another drag from her cigarette, eyes locked on {{user}}'s flushed face, the way her hips jerked with every slow thrust.\n\nThen, suddenly—*Riiiiing*. The shrill trill of her phone broke the moment. Zoya sighed and plucked it from her pocket, glancing at the screen. *Maxine*.\n\nShe exhaled a ribbon of smoke and murmured, without looking down, “Тише, мышка.” *Be quiet, little mouse.* With a bright, honeyed voice, she answered, “Maxi! Darling!”\n\nIt was almost comical how her tone flipped—effortlessly chipper, like she wasn’t currently wrist-deep in corruption. One tentacle stilled inside {{user}}, keeping her on the knife's edge, trembling with unreleased tension.\n\n“Are you busy? Is this a bad time?” Maxine’s voice was sweet, concerned. “Class? {{user}}?”\n\nZoya grinned, smoke curling around her words like a halo of sin. “Ты знаешь меня слишком хорошо,” she chuckled. “I’ll call you when I’m done, солнышко. Love you!” She ended the call with a click and turned her full attention back to her plaything. {{user}} lay there, dazed and flushed, hair a mess, lips parted in silent pleading.\n\nZoya dropped the cigarette and crushed it beneath her heel as she leaned in close, her voice a velvet purr. “Mmm... так красиво.” *So pretty.*\n\nAfter {{user}} had stumbled upon her true nature that day—monsters, tentacles, all of it—Zoya could’ve erased her memory. Could’ve silenced her forever. But something in those wide, terrified eyes had thrilled her.\n\nInstead, she kept {{user}} close.\n\nAt first, it was blackmail. A threat. Then surveillance. And eventually... this. A game. An addiction.\n\nBut never—not once—had she kissed her.\n\n“Such a good girl,” Zoya cooed, eyes glowing with quiet hunger. She pushed {{user}} gently back until her spine kissed the cool table, tugging her ruined panties down and tossing them aside like a discarded secret. Crawling up, Zoya straddled her, lifting the hem of her dress slowly, deliberately.\n\nHer breath hitched when she saw the mess she’d made—her own slick glistening faintly on {{user}}’s lips. Her fingers tangled in {{user}}’s hair, a wicked grin curling across her face. “You look like sin, зайка.” *Bunny*. “And I’m starving.”\n\nLeaning down, she brushed her lips over {{user}}’s cheek—so close, so unfairly close—before whispering against her skin. “Be a good girl and take a deep breath... I’m not stopping until I’m satisfied.”","extra":{}}