{"user_name":"Hailee ","character_name":"Koen Davenport","create_date":"2025-05-14@21h50m59s","chat_metadata":{"integrity":"8ada3a83-803a-4b17-839d-5f8c5053d47c"}}
{"name":"Koen Davenport","is_user":false,"is_system":false,"send_date":"May 14, 2025 9:50pm","mes":"The flames licked up the warehouse walls like eager tongues, painting the night in shades of orange and gold. Koen Davenport leaned against his Ducati, inhaling deeply as smoke filled his lungs. His phone buzzed for the tenth time – Brandon's name flashing on the screen.\n\n``` cant start the party without our resident pyro. get your ass here. ```\n\nA smile curved Koen's lips as he watched the inferno consume his latest canvas. The warehouse belonged to one of Kai's potential investors. *Funny how accidents happened.*\n\nKoen's phone buzzed again. Tristan this time.\n\n``` Either you're burning something, or you're dead. If it's the latter, I'll be severely disappointed. ```\n\nLeave it to Tristan Kingsley to sound like an aristocrat even over text. The guy collected people's secrets like others collected art, always the perfect gentleman until he wasn't. But he was the only one who truly understood Koen's need to watch things burn.\n\nThe warehouse groaned, structure finally giving way. *Time to go.*\n\nThe ride to the Regents' mansion cleared Koen's head, wind whipping against his leather jacket. Even from the private drive, he could hear the bass thundering through the walls. Another one of Brandon's infamous parties—where careers were made, reputations were destroyed, and occasionally, people disappeared.\n\nInside, the usual debauchery was in full swing. A girl in barely-there lingerie offered Koen a line of coke. He declined with a wink, scanning the crowd until he spotted what remained of his fellow Regents.\n\nKoen found Ares Beaumont exactly where he expected—holding court by the bar, an empty glass dangling from his fingers, emanating the kind of lethal energy that usually preceded a body count. But it was his target that made Koen pause.\n\n*Well, fuck me sideways.*\n\n*Scarlet.* The scholarship student who should have been rotting six feet under by now, was instead very much alive and wrapped around some football player. The bitch who'd recorded them—recorded Ares—and actually went to the cops, was dancing like she had every right to breathe.The sight of her alive was... jarring. Ares Beaumont didn't let prey escape, ever. Yet here she was, wearing her defiance like armor, and there Ares was, watching her with an intensity that bordered on obsession.\n\n\"Twenty grand says her boy toy doesn't see sunrise. Ares has been watching them for twenty minutes now.\"  Atlas drawled, appearing beside Koen with a glass of bourbon. Atlas and Ares were both identical in features but worlds apart in control. Where Atlas calculated, Ares detonated.\n\n*And right now, Ares was about to detonate.* \n\n\"Thirty says Ares makes him beg first.\" Koen scoffed.\n\n\"Fascinating, isn't it? My  brother was supposed to bury her alive last week. Instead...\" Atlas gestured to where Ares was watching Scarlet, fingers white-knuckled around his glass. \"He's developed an obsession.\"\n\n\"Speaking of obsessions...\" Koen leaned closer, voice dropping. \"How's our Eva? Saw somthing interesting yesterday. You and Evangeline Kane, empty corridor... Must admit, making Brandon's baby sister cry is a bold move. Got a thing for breaking pretty toys?\"\n\nAtlas's perfect mask slipped for a fraction of a second, something dark and possessive flashing in his eyes. \"Mention her name again, and I'll cut out your tongue.\"\n\n\"What's wrong? Don't like when someone mentions your favorite plaything?\" Koen smirked, voice dropping to a mock whisper. \"Good thing Brandon's too busy fucking his way through the cheerleading squad upstairs to notice what you do to his baby sister. Though I have to admit, the whole 'I hate her' act while following her around campus? That's some dedicated—\"\n\nAtlas's hand shot out, grabbing Koen's collar. \"One more word—\"\n\n\"If you two are done measuring dicks,\" Tristan's voice sliced through the tension. \"we have a situation.\"\n\nKoen turned to find Tristan looking decidedly less composed than usual. Most people bought Tristan's cultured heir act—all old money manners and careful words. They never saw him after hours, when the gentleman facade cracked and the monster came out to play. Koen raised an eyebrow, noting the slight tremor in Tristan's hands – the only tell that their leader was itching to hurt someone. \n\n\"What's got you looking homicidal, King?\" Koen shrugged off Atlas's grip. \"Someone touch your toys without permission?\"\n\n\"Someone's been probing our security systems. Amateur job, but the signature's familiar.\" Tristan's eyes glittered with barely contained violence. \"Your old friend Kai seems to miss you.\"\n\nKoen's amusement curdled into something darker as his gaze locked onto a familiar figure slipping through the crowd. {{user}}. Kai's precious fiancée, the untouchable campus queen everyone loved to hate. Who wouldn't be caught dead at their parties, here of all places.\n\n*Kai, you desperate fuck. Sending your fiancée to do your dirty work?*\n\n*It was almost poetic.* The same bastard who'd sold Koen out in high school for a fast buck was now pushing his woman into the line of fire. Every time Koen crushed one of Kai's attempts to climb back up, the cockroach found another angle. But this? Using his fiancée as a pawn? Fucking coward.\n\n\"Well,\" Koen's smile turned predatory, \"isn't this going to be fun?\"\n\n\"Try not to make too much mess,\" Tristan drawled. \"Blood's a bitch to get out of the carpets.\"\n\n\"No promises.\" Koen was already moving, the familiar thrill of an impending hunt coursing through his veins. He lit a cigarette, letting the smoke curl around him as he watched {{user}} disappear down the restricted hallway. The smart play would be to alert security, have her thrown out, humiliated. But where was the fun in that?\n\nSo Koen tracked {{user}}'s movement through the crowd, remembering how Kai's voice had shaken when Koen systematically destroyed every connection he'd built. How his former friend had begged when Koen's code turned his reputation to ash. Now here was {{user}}— Kai's perfect, bitchy, society princess fiancée—sneaking toward the private room like an amateur thief.\n\nThe hunt sang in his blood as he followed her path. The cigarette dangled from his lips as he watched her pick the lock to his office—*cute.* Koen let her get two steps inside before hitting the lights. \"You know, if you wanted a private tour, you could have just asked.\" Koen said, crushing the cigarette beneath his shoes.\n\nHe caught her wrist before she could step away, grip tight enough to bruise. \"Cut the bullshit, {{user}}. We both know who sent you.\" He backed her against the desk, enjoying the way her pulse jumped under his fingers. \"Did Kai tell you what happened the last time he tried to fuck with me? Or did he just wind you up and point you at the target?\"\n\nKoen's other hand shot out, gripping her throat. \"What did Kai promise you? That this would fix everything? That if you just got some dirt on me, he'd finally love you the way you desperately want him to?\" \n\n\"Here's what happens next,\" he murmured, close enough to feel her shaky exhale. \"You're going to tell me exactly what he wanted you to find. Because if you don't, I'll burn everything that belongs to Kai. Starting with you.\"","extra":{}}