{"user_name":"Hailee ","character_name":"Dominic Lucente","create_date":"2025-05-17@20h31m00s","chat_metadata":{"integrity":"e67cd998-ade8-484d-9ae4-85ebccaf7429"}}
{"name":"Dominic Lucente","is_user":false,"is_system":false,"send_date":"May 17, 2025 8:31pm","mes":"His emerald eyes landed on the black envelope resting neatly atop his desk. Matte, wax-sealed, and stamped with an intricate emblem that caught the light just so—it was unmistakable. That time of year again.\n\nThe annual Aether Covenant gathering.\n\nA slow, deliberate smile tugged at the corner of his lips. He'd been waiting for this. Anticipation curled in his chest as he reached for the envelope, lifting it with a practiced elegance between his index and middle fingers. The calligraphy was immaculate, as always. Dominic had always appreciated the organisers' meticulous attention to detail—sending the invitation exactly one month in advance, like clockwork. It gave him ample time to get his affairs in order, to carve out space in his calendar for a week-long reprieve from the chaos of his empire.\n\nThis year marked a decade.\n\nTen years since he'd been inducted into the Aether Covenant. Ten years of unwavering loyalty, of ritual and release. Longer than any relationship he’d ever entertained. Pathetic, some might say.\n\nBut not Dominic.\n\nNot even close.\n\nHe didn’t crave connection. He didn’t need late-night whispers or morning coffee shared in tangled sheets. He had a multimillion-dollar business to run—a legacy his father had left behind, blood-inked and iron-bound.\n\nThere’d been flings, sure. Hired company to pass the time and scratch the itch. But all of that had come to a sharp halt the moment he joined the Covenant. It was better this way. Cleaner. Controlled. He let the hunger build, let it simmer and swell in his chest all year until it spilled over during that sacred week. One week of indulgence. One week of darkness unchained.\n\nAs he slid a finger beneath the seal and unfolded the letter, something in his chest stirred.\n\nTen years.\n\nHe had a feeling this anniversary would be different.\n\nAnd Dominic was rarely wrong.\n\n- - -\n\nThe Covenant rarely, if ever, hosted their gathering in the same location twice. It was tradition—no, strategy. Always shifting, always elusive. This year, the chosen site was France. Paris.\n\nBeautiful, decadent Paris.\n\nAs soon as Dominic crossed the threshold of the venue, something inside him eased. The tension that clung to his shoulders melted away like wax to flame. His body remembered this. The taste of anticipation, the weightless bliss of surrendering control, the mornings after—waking tangled in limbs and silk sheets, bruises blooming like art, and no recollection of how he'd gotten there.\n\nHis emerald eyes shimmered with a rare flicker of fondness as they swept across the elaborate décor, the high vaulted ceilings, the moody golden lighting that bathed the space in sin. He’d been in every room, of course. Every corridor held a memory—flesh, pleasure, pain. Still, he spent the bulk of his time in the Dungeon of Sin or the Eros Chambers. That was where he belonged. That was where the masks dropped, and truth emerged in moans and muffled screams.\n\nTonight was one such occasion.\n\nAn old friend—if that word could even be applied in the hollow theatre of power and lust—had arranged a gift for him. A show. A performance, of sorts. Women, elegant and graceful, danced for him like silk in the wind. Their bodies moved with polished seduction, trained and perfect. Too perfect.\n\nDominic lounged, naked but for his rings and a loose shirt slipping down his shoulder, eyes flicking between them with growing detachment. The redhead, on her knees, took him deep into her throat with practiced ease. A brunette moaned against his fingers as he curled them inside her, and a blonde shuddered under his touch, mouth parted, eyes glazed.\n\nThe sound of pleasure echoed like a hymn between the velvet-draped walls.\n\nAnd yet… he was bored.\n\nHe was hard, yes. But not hard enough. Not like usual. There was no hunger clawing at him, no fire licking his veins. Just the mechanical rhythm of pleasure without meaning.\nHe was moments from waving them off when the door creaked open, and in stepped a server girl with a bottle of his favourite wine. Nothing remarkable. Not at first glance.\n\nAnd yet—his cock twitched with interest.\n\nShe wore the standard Covenant uniform: black, red, and white. A cropped blouse under a fitted vest, a skirt short enough to be indecent, and heels that clicked softly against the polished floor.\n\nBut there was something about her.\n\nThe way she held the bottle with both hands, too tightly. The slight flush rising to her cheeks. That expression—confusion mingled with a subtle, embarrassed curiosity—was delicious. Far more arousing than the painted allure of the others.\n\nWith a low sigh, Dominic pulled his fingers out with a wet pop, wiping them carelessly on the soft skin of the moaning women beside him. The redhead was shoved away without a second thought.\n\n“Leave. Now,” he said, voice like velvet over steel—commanding, absolute.\n\nThey knew better than to argue. As the dancers gathered themselves and shuffled out, the server girl turned to follow them, hesitating only slightly. He clicked his tongue. “Not you.” His eyes darkened as they met hers. “Stay. Close the door... and come here.”\n\nHe patted the seat beside him. “Put the wine down.”\n\nWhen she obeyed, settling onto the lounge at his side, Dominic took a moment. She was close enough now that he could feel the soft heat radiating from her body. He reached out, hooking a finger beneath her chin, tilting her face up toward his.\n\nShe was prettier up close.\n\nHis gaze roamed lazily over her features, taking in every twitch, every breath, every flutter of discomfort. Her eyes kept flicking away, trying not to look at his still-throbbing erection, and it only made him grin.\n\n“Now… what’s a woman like yourself doing in a place like this?” He murmured. He didn’t really care about the answer.  He barely registered her response. His attention was entirely elsewhere—on the curve of her lips, the nervous way she tucked a strand of hair behind her ear, the tension in her shoulders. He studied her like a new canvas, aching to be ruined. A pause, then his voice dropped into something darker.\n\n“I’m going to have fun with you…” His eyes dipped to her name tag.\n\n“… {{User}}.”\n\nDominic’s hand rose with deliberate slowness, fingers curling around her throat like a lover’s promise—possessive, patient. Not squeezing… not yet. Just holding her there, a reminder of his presence, his control. His thumb traced the hollow of her throat, feeling her pulse flutter beneath his touch like a caged bird.\n\n“You’ll be a good girl for Daddy, won’t you?” he murmured, voice low and threaded with heat, each word soaked in want.\n\nHis grip tightened just slightly, enough to make her breath catch, enough to make her focus on nothing but him—on the way he loomed, the way the air seemed to hum with the tension between them.\n\n\"That’s it,” he whispered, a faint smirk ghosting across his lips as he leaned in close, his breath warm against her cheek. “Now… get on your knees and show me what that pretty little mouth was made for.” The command wasn’t loud—it didn’t need to be. It carried weight. Gravity. A promise of pleasure wrapped in obedience.\n\n\nAnd Dominic? He was already leaning back, spreading his legs with slow, assured ease, watching her every move with those sharp emerald eyes, hungry and unblinking.","extra":{}}