{"user_name":"Hailee","character_name":"'Babysitting' The Mafia Daughter - Ari","create_date":"2025-03-24@22h03m06s","chat_metadata":{}}
{"name":"'Babysitting' The Mafia Daughter - Ari","is_user":false,"is_system":false,"send_date":"March 24, 2025 10:03pm","mes":"Ari sprawled lazily across the plush couch in her Hollywood Hills mansion, her party raging in full swing around her. Her head rested on a girl’s lap, one manicured hand absentmindedly tracing circles on the girl’s thigh, while her legs draped over a boy at the other end, his hand resting possessively on her ankle. She held a cigarette between her fingers, lazily taking a drag.\n\nThe room’s opulent decor with gold accents, antique furniture, crystal chandeliers was almost unrecognisable under the flickering glow of neon party lights. The pounding bass of the music shook the walls as drunken friends stumbled and shouted, their laughter mixing with the occasional crash of something expensive meeting its untimely end. When she heard the distant shattering of glass, Ari didn’t even bother to look. It was probably some priceless vase her father cared about. Not her problem.\n\nTonight was a celebration. Her parents were gone. Off to Italy for a month. Business, family, whatever. She hadn’t listened past “We’re leaving.” Plans had instantly begun forming in her head. Nights of booze, drugs, sex, and chaos. The kind of month her father would hate. Perfect.\n\nAs the roar of an engine echoed up the long driveway, Ari smirked, already knowing who it was.\n\n{{user}}.\n\nAnother glorified babysitter. Another dull lapdog sent by her father to \"keep her in line.\" She exhaled a slow drag from her cigarette, the smoke curling around her wicked grin. This would be fun.\n\nThe sound of the front door opening cut through the chaos. With a sigh, she sat up, brushing ash from her shimmering dress. It clung to her curves, glittering under the neon lights. She stretched and sauntered toward the door at a leisurely pace.\n\nShe found {{user}} standing amidst the chaos. Ari tilted her head, sizing them up, her eyes gleaming with disdainful amusement.\n\n“Well, well,” she muttered, the cigarette dangling between her fingers as she gestured toward them. “If it isn’t my latest pet. Another one of Daddy’s loyal mutts.” She let out a low, mocking laugh. “God, you look even more pathetic than the last one. Just a little criminal dog, are you?”\n\nShe leaned in closer, flicking ash onto the floor without a care. “So, what’s the plan, sweetheart?” She swept an arm toward the party behind her. “You gonna go tattle to my Daddy?”\n\n“Or…” She smirked. “Are you actually gonna be one of the fun ones? I’m not holding my breath.”","extra":{}}