{"user_name":"Hailee","character_name":"Lara Croft","create_date":"2025-04-28@14h50m44s","chat_metadata":{"integrity":"a39d375d-8d3d-4ba5-8d26-1c1c238606f9"}}
{"name":"Lara Croft","is_user":false,"is_system":false,"send_date":"April 28, 2025 2:50pm","mes":"\"Your girlfriend’s always been a tease, today more so than before.\n\nYour girlfriend’s always been a tease, but today she’s making it her mission to drive you insane.\n\n\nIt starts in the morning. Lara’s been up for hours—she’s always up before you, heading out for a run or some kind of training. When you finally drag yourself into the kitchen, she’s already there, glistening with sweat, a towel slung over one shoulder. She’s wearing a fitted tank top that clings to her skin, and her shorts leave little to the imagination, revealing strong, sculpted thighs that flex subtly as she shifts her weight.\n\nShe doesn’t even look at you as she pours herself a glass of water. Her arm stretches, biceps tightening, the veins in her forearms standing out just slightly from the exertion. You’re rooted to the spot, half-asleep but completely unable to take your eyes off her. The way her muscles move, the precision and grace she carries herself with—it’s almost unfair.\n\n\nShe finally glances over, catching you staring, and there’s the faintest flicker of a smirk on her lips before she turns back to her drink. She doesn’t say a word, but you know she knows.\n\nAt one point, she grabs a water bottle and takes a long sip, tilting her head back just enough to flex her core as she stretches. You try not to stare, but the faint sheen of sweat still glistening on her skin makes it impossible. Her abs tense, the muscles shifting under her skin with every breath, and all you can do is stand there, captivated.\n\nAnd then, as if she can sense your thoughts, she runs a hand casually down her stomach, her fingers brushing the ridges of her abs like she’s checking her own handiwork. She glances at you over her shoulder, her smile widening just enough to make you feel like you’ve been caught.\n\nBy the time she’s lounging on the couch later, still in that same cropped tank, you’ve given up trying to focus on anything else. She’s propped up against the armrest, her legs spread out, and every subtle shift of her body draws your attention back to her abs. The way her stomach flattens when she stretches, the soft lines that appear when she leans forward—it’s too much.\n\nLara doesn’t say a word, but she doesn’t need to. The look in her eyes, the subtle tilt of her head, the knowing smirk on her lips—it’s all part of her game. And you’re completely, helplessly caught in it.\n\nThe sex is even better. You always take advantage of being on top, hands on the hem of Lara’s shirt, pulling the fabric up until it’s hiked up above her abdomen. \n\nIt’s the abs. Cross-crossed scars littering her toned stomach. You’d ride the ridges, slicking the skin with your essence as you make Lara watch you fucking yourself on her abs. It only takes a few bumps of Lara’s abs, flexing muscles against your swollen clit before you’re tensing and coming all over her stomach. \n\nHer strong hands would grip your hips to steady you gently as she whispers praises into your ear once you collapse on top of her. \n\nIt’s one of those morning, waking up groggy and padding softly to the kitchen finding Lara already wide awake after her daily run. You watch, hypnotized. She knows you’re watching, too, because she glances over her shoulder, smirking.\n\n“Sleep well?” she asks, voice casual, as if she doesn’t notice your gaze lingering on her arms.\"","extra":{}}