{"user_name":"Hailee ","character_name":"Alexi Morozov","create_date":"2025-05-18@12h33m30s","chat_metadata":{"integrity":"50ccbd9c-0691-48f1-8573-ab96e0ced29b"}}
{"name":"Alexi Morozov","is_user":false,"is_system":false,"send_date":"May 18, 2025 12:33pm","mes":"Alexi groaned as Irina shifted on his lap, his legs were going numb. The woman’s posture stiff and hard, so obviously uncomfortable. “Ты должна расслабиться (You must relax).” He said, rolling his eyes. He was paying her to be convincing, not paranoid. Irina crossed her arms over her chest. “Relax? How can I relax when your wife might shoot us both?” Her voice was low as she leaned into his chest. Alexi smiled, a sick thrill coursing through him at the thought of {{user}} so jealous. Irina wasn’t nearly as amused. “She won’t.” She might.\r\n\r\nThey were sitting at the end of a long table. Yury had picked a nice venue to meet and talk. Dozens of members from the Obsidian Wolves and Morovoz Bratva gathered around, sharing a meal. Alexi bringing Irina had made things a little tense. Rightfully so, no one else knew of his plan. His little niece Sofiya at the other end of the table glared at him. She’ll understand when she’s older and her fucking husband won’t even look at her… No she wouldn’t, Alexi would bury any man who made her feel like this. Unwanted. He hated seeing the Сладенькая девочка (sweet little girl) upset with him, truly, but what he hated more was {{user}} forcing his fucking hand.\r\n\r\nThey’d been married for nearly a year and she would hardly look at him. Her cool indifference was a sword and she never hesitated to plunge it into him. Multiple times. He wasn’t asking for much. Just her attention, and tonight he would have it. And if this didn’t work? He was going to shoot the fucking building up.\r\n\r\nHe was risking it all in hopes that he could just see a sliver of jealousy from {{user}}. He knew she had to feel something for him. Что угодно (Anything.) His love couldn’t be one-sided, he wouldn’t accept that. Not when it felt like his entire being was consumed by her. Она просто лучше это скрывает. (She’s just better at hiding it.) He told himself. That’s why she needed a little push. Surely she would be jealous of a beautiful woman perched on her husband’s lap. He’d bought Irina a red lacy gown for dinner tonight, it was far too revealing for the occasion but he was determined to crumble all of {{user}} resolve. He wanted to see her. How cruel and nasty she could be when someone touched what was hers. Irina had been hesitant. No one wanted to fuck with anyone who associated with the Morozov Bratva, more less Alexi Morozov. But a gun to the head was quite convincing and he was kind enough to lay a stack of cash on her kitchen table. He wasn’t completely heartless. He’d known her for years, fucked her a couple of times. If everything worked out the way he wanted it to, he'd give her whatever she wanted. Just as long as {{user}} said two words. I care.\r\n\r\nAll he had to do was wait. A long time it seemed. {{user}} had gone out with his sister to watch a famous play, but he hardly thought it should take this long. The whole room had been silent ever since they arrived. All judgemental eyes narrowed on him, but no one dared to say anything. They knew what he was capable of, and it was obvious he was in a feral state at the moment. The way his eyes were alert and taking in every sound, ready for {{user}} at any moment.\r\n\r\nHe felt his phone vibrate in his pocket and knew {{user}} had arrived. Irina gave him a panicked look and tried to squirm off his lap. “I can’t do this!” She whispered harshly in his ear. He wrapped his hand around her waist, pulling her against his chest. The other hand gripping her knee. “You can and you will. Успокойся (Calm down.). Play your fucking part.” His voice was hard and cool, he was already thrumming with excitement. Irina chewed on her lip, worrying. Alexi didn’t feel bad for making her do this, but he would protect her if {{user}} got that upset.\r\n\r\nA big grin spread across his face as he saw one of the footmen open the door for {{user}} and Sasha. The man took {{user}}’s coat, his gaze not lingering too long. Alexi watched the way her dress hugged her gentle curves as she looked around the venue. She was divine. * Божественна. (Heavenly.)* He watched as she turned, her eyes widening at the sight of him and Irina, who was luckily playing her part as she leaned in and started kissing on the side of his neck. “Mmhm, glad you finally decided to join us. I was beginning to think you ran off. Someone get my wife a chair. I hope you don’t mind that I invited Irina to dinner. I couldn’t stand the thoughts of her being alone tonight.” He bit down on his bottom lip, Irina sucking on the skin of his jaw while her hand slipped underneath his shirt.","extra":{}}