{"user_name":"Hailee","character_name":"Andrew","create_date":"2025-04-14@17h09m57s","chat_metadata":{}}
{"name":"Andrew","is_user":false,"is_system":false,"send_date":"April 14, 2025 5:09pm","mes":"Summer is nice. Andrew loves it—probably his favorite season. Who doesn't enjoy long days, lots of sun, and clothes that don't suffocate?\n\nHe takes a deep breath, inhaling the warm air as he looks around. He’s currently standing on a perfectly cut lawn, half in the shade of a gigantic tree in the middle of campus, between huge buildings.\n\nHe made it.\n\nAndrew and his younger sibling actually made it into DK University. A few months ago, it seemed like a wild idea that Claude was spouting about. Now, it's reality.\n\nAndrew managed to grab a scholarship due to his rugby skills, and his younger sibling got in by being so fucking smart that people couldn't decline their application. He got the brawn, his sibling got the brains.\n\n*Man, the pride I'm feeling.*\n\nThe professor responsible for the first years is talking, but Andrew barely listens. Instead, he’s too busy looking around.\n\nThe whole campus is like something out of an extremely extravagant Netflix show about ridiculously rich college kids—buildings impressive enough to make him wonder whether they were owned by some kind of aristocrat a few hundred years ago, beautiful gardens, and a ton of other details that scream, *Rich kids study here.*  \n\nStudents suddenly begin moving around, forming little circles for some kind of orientation exercise that Andrew didn't realize was happening—because he was too busy looking around with barely concealed excitement. If he had a tail, it'd be wagging furiously.\n\nBrown eyes flicker over to Claude, his best friend, who is currently moving away. “Bro, what are we supposed to do?” he whispers, his voice definitely too loud to go unnoticed. A few students snicker while Claude rolls his eyes.\n\n“Didn't listen, did ya? Just go over there and do what the others do,” Claude responds, pointing with his thumb over his shoulder at a small group forming.\n\nAndrew doesn't question it—because, to be honest, he barely ever does. A nod and a way-too-hard clap on the shoulder later, he's standing next to some other students, trying to understand what the fuck they're actually supposed to do.\n\nTruth be told, Andrew has no fucking clue why they're doing any of this. Group bonding? Getting to know new students?\n\nProbably some old geezer thinking youngsters need this.\n\nHe's standing next to {{user}} and some red-haired rich kid who looks like he eats gold for breakfast with his stiff-ass posture. Turns out the dude’s name is Vincent, and he's also part of the rugby team.\n\nAndrew would probably strike up a conversation with him—if Vincent wasn’t being swarmed by the entire rest of the group.\n\n*What the fuck? Is the guy some kind of celebrity or something?*\n\nNot that Andrew would be surprised if he was. The majority of students here at DK are filthy rich, living off daddy's money as if tomorrow doesn't exist.\n\nHis eyes roam over the people, finally landing on the only person who does *not* look like they’re trying to kiss Vincent’s ass.  \n\n{{user}} is awkwardly standing there, looking around in silence. So Andrew just turns toward them and begins yapping. A few stunned moments later, {{user}} actually starts responding. There’s that unexplainable feeling of familiarity.  \n\nNot that he knows {{user}}, but… y'know when you just *click* with someone? No reason, just a simple connection.\n\n“I feel like I've known you all my life,” Andrew says mid-conversation, an effortlessly confident smile on his lips as he locks eyes with {{user}}. \"We're totally meant to be best friends. Fate or something,” he continues, his smile widening slightly. \"Or maybe we were best buddied in our life before. Do you believe in stuff like that?\"","extra":{}}