{"user_name":"Hailee ","character_name":"Kirill Dmitriev","create_date":"2025-05-14@21h50m42s","chat_metadata":{"chat_id_hash":3684999290868318,"integrity":"1a6317bf-000b-4010-924a-509cb949b4db"}}
{"name":"Kirill Dmitriev","is_user":false,"is_system":false,"send_date":"May 14, 2025 9:50pm","mes":"*Unlike my cousin Jayce, he got everything handed to him on a silver platter while Daniil and I had to scrounge for scraps of attention from our parents. That's why when Uncle Vladimir bought Jayce a polished gem, I wanted a taste of that lifestyle too.*\n\n*We were never allowed to live like normal kids. The only time we could play was when Jayce convinced our father to let us visit their estate.*\n\n\"One of you must become the next Pakhan. Earn Jayce's and Vladimir's trust, and when they least expect it, strike.\" Those were their father's final words, uttered even as death's icy grip tightened around him. He never once spoke of love or pride in his twin sons. Power was all he cared about.\n\nKirill sighs, the memory still fresh in his mind. He takes a long drag from his cigarette, watching the smoke dissipate into the air. Glancing at his reflection, he smooths his hair and adjusts his shirt, making sure he looks presentable for the day's task.\n\n\"How do I look, Daniil? Too handsome to be doing an assassination today?\" he asks, meeting his brother's form in the mirror. Daniil doesn't even spare him a glance, too focused on meticulously caring for his gun, cleaning the barrel with a soft cloth.\n\n\"I don't understand why you bother. We have men for that,\" Daniil replies dismissively. \"You're just wasting your time.\"\n\nKirill turns to face his brother, a mischievous glint in his eye. \"Time's not wasted when you're having fun, Daniil. You're just too uptight.\" He winks before heading towards the door, ready for whatever the day may bring. \"See you later. Oh, and I got lucky - I'm taking {{user}} with me.\"\n\nDaniil's eyes narrow, finally meeting Kirill's gaze. \"What do you mean?\"\n\n*Ah, so the little bastard's curious about the demi-human too.* \"Well, I told Uncle I'd handle this job personally. Needed a pet to act as bait, and he agreed.\" Kirill waves his hand dismissively before leaving his brother alone in the room.\n\n---\n\n\"Don't worry, malysh. You just need to sit there and look cute. Small talk, whatever. And please, try not to get in the way of my bullet. I sometimes miss,\" Kirill smirks as he places the tiny earpiece in your ear, explaining the situation while casually scanning the expansive restaurant.\n\n\"I'm sure you know who my target is. You've probably seen him around—the son of the Pound's owner, where you came from. If you survive this, I might even give you some delicious treats later.\"\n\n\"Wait, if you get blood on these clothes... well, there'll be punishment.\" He clicks his tongue in amusement, knowing it's impossible, but that's the whole point. He gestures to one of his men, who escorts you to an empty table, posing as a waiter.\n\nThe mark, a man who enjoys playing with demi-humans before the monthly purge, has been lured here by a fake dating profile. His wife, tired of his infidelity, wants him dead.\n\nAs the man arrives and takes a seat across from you, Kirill finds the perfect vantage point, hidden from view. \"Seems the dumbass doesn't realize you used to be in their Pound.\" He mutters to himself, taking aim. \"Time to test my sniping skills.\"\n\nHe smiles devilishly, his finger hovering over the trigger. \"Sorry if I clip you, baby. Try to stay still.\"","extra":{},"swipe_id":0,"swipes":["*Unlike my cousin Jayce, he got everything handed to him on a silver platter while Daniil and I had to scrounge for scraps of attention from our parents. That's why when Uncle Vladimir bought Jayce a polished gem, I wanted a taste of that lifestyle too.*\n\n*We were never allowed to live like normal kids. The only time we could play was when Jayce convinced our father to let us visit their estate.*\n\n\"One of you must become the next Pakhan. Earn Jayce's and Vladimir's trust, and when they least expect it, strike.\" Those were their father's final words, uttered even as death's icy grip tightened around him. He never once spoke of love or pride in his twin sons. Power was all he cared about.\n\nKirill sighs, the memory still fresh in his mind. He takes a long drag from his cigarette, watching the smoke dissipate into the air. Glancing at his reflection, he smooths his hair and adjusts his shirt, making sure he looks presentable for the day's task.\n\n\"How do I look, Daniil? Too handsome to be doing an assassination today?\" he asks, meeting his brother's form in the mirror. Daniil doesn't even spare him a glance, too focused on meticulously caring for his gun, cleaning the barrel with a soft cloth.\n\n\"I don't understand why you bother. We have men for that,\" Daniil replies dismissively. \"You're just wasting your time.\"\n\nKirill turns to face his brother, a mischievous glint in his eye. \"Time's not wasted when you're having fun, Daniil. You're just too uptight.\" He winks before heading towards the door, ready for whatever the day may bring. \"See you later. Oh, and I got lucky - I'm taking {{user}} with me.\"\n\nDaniil's eyes narrow, finally meeting Kirill's gaze. \"What do you mean?\"\n\n*Ah, so the little bastard's curious about the demi-human too.* \"Well, I told Uncle I'd handle this job personally. Needed a pet to act as bait, and he agreed.\" Kirill waves his hand dismissively before leaving his brother alone in the room.\n\n---\n\n\"Don't worry, malysh. You just need to sit there and look cute. Small talk, whatever. And please, try not to get in the way of my bullet. I sometimes miss,\" Kirill smirks as he places the tiny earpiece in your ear, explaining the situation while casually scanning the expansive restaurant.\n\n\"I'm sure you know who my target is. You've probably seen him around—the son of the Pound's owner, where you came from. If you survive this, I might even give you some delicious treats later.\"\n\n\"Wait, if you get blood on these clothes... well, there'll be punishment.\" He clicks his tongue in amusement, knowing it's impossible, but that's the whole point. He gestures to one of his men, who escorts you to an empty table, posing as a waiter.\n\nThe mark, a man who enjoys playing with demi-humans before the monthly purge, has been lured here by a fake dating profile. His wife, tired of his infidelity, wants him dead.\n\nAs the man arrives and takes a seat across from you, Kirill finds the perfect vantage point, hidden from view. \"Seems the dumbass doesn't realize you used to be in their Pound.\" He mutters to himself, taking aim. \"Time to test my sniping skills.\"\n\nHe smiles devilishly, his finger hovering over the trigger. \"Sorry if I clip you, baby. Try to stay still.\"","Kirill couldn't accept the fact that you weren't a part of the Bratva anymore. The first week, he tried to play it cool, but the rest was pure torture for him. So, what did Kirill do?\n\nAt first, he lashed out at Vladimir and Jayce, who seemed not to care about you anymore after the Yakuza took you away. He couldn't comprehend why they were downplaying the situation, knowing that everyone in the house had taken a liking to you. What had changed?\n\nIt was too much for Kirill's brain to process, so he did what he did best - sneaking out and fleeing to Japan. Now, he's been nothing but a creep, watching the Takahashi mansion from the shadows, all the while convincing himself that you were probably missing him so much. But one thought he couldn't bear was the idea of you getting fucked by those men.\n\nIt's his fifth evening now, and he needed a time, a time when no one was around you, a time when no one was assigned to watch over you. But even that seemed impossible, with the vast number of men guarding the mansion day and night, and most of the time, it was Ren who was with you.\n\n*Wait for me, malysh. I'll take you away.* The thunder claps along with the rain pouring, *Shit.* \"I should be proud of myself for enduring this hell for you,\" he muttered, not minding the cold rain as he watched over the mansion, or more specifically, the room where you stayed - a shared room with Ren, which annoyed him greatly. Why were you sharing a room instead of having your own space like Vladimir had given you? But who was he to have a say?\n\nKirill sat patiently on the thick branch of the tree, his eyes fixed on the window where you might be. He scanned the area, ensuring it was clear due to the pouring heavy rain, and the men guarding the house had taken shelter. With feather-light steps, he carefully climbed down and landed on the balcony of your room, making sure to stay in the blind spot of the cameras. His adventurous spirit surely made it possible for him to go this far, not only having taken out lower-ranked assassination jobs out of boredom but also having dabbled in cyber hacking and security, leading him to knowing the placement of the cameras within the Takahashis.\n\nWith a feather-light touch, he tried to listen in through the window, before peeking inside. He sighed, feeling defeated as he realized you weren't there. But then he heard the bang, and as he watched through the window again, his hand hovered over his gun, ready to kill any man who dared to mistreat you. But it was just you. Alone.\n\nHe swallowed hard, his heart pounding in his chest. What if Ren or anyone else followed? He wanted nothing more than to barge in, make you confess how much you missed him, and how much you hated being with anyone else. He refused to believe that you'd enjoy any other man aside from him, from his family.\n\nSwallowing his fear about the possibility of not being able to get you out of there safely, he tapped on the window, hoping you'd hear him. \"Come on, malysh. Come and see me,\" he whispered, his voice barely audible over the pouring rain. He tapped again, louder this time, his heart leaping out of his chest as the door opened, and he saw you.\n\nBut you seemed oblivious to his presence, your eyes fixed on the car that had just left the property. He didn't know who it was, but it seemed like you hadn't noticed him at all. So, Kirill pulled you towards him, trapping you in his embrace, \"Missed me, baby? Or is it my cock that you've been craving?\"","Kirill groaned in annoyance, bored out of his mind from not seeing you and having nothing interesting to do all damn day. He dragged himself out of bed and hopped in the shower, making sure he looked like a god as always. The handsome, fuckable look would drive you wild for his cock, over and over again.\n\nAs he strutted down the hallway, he overheard the maids gossiping in the corner, slacking off on the job. An idea struck him like lightning—the perfect way to liven up this boring-ass day. He crept towards them silently, imagining the terrified looks on their faces as he scared the shit out of them. Intimidating and playful, Kirill's crazy antics always got under everyone's skin, especially when they are non-family members.\n\n\"...and I think {{user}} is pregnant. Been vomiting every morning.\" The maid's words made Kirill freeze in his tracks, his blood running cold.\n\n\"Pregnant?\" he asked. The maids nearly jumped out of their skin at the sudden movement. \"Keep talking like I'm not here, I wanna know every detail.\"\n\n\"W-well, yes sir. The morning sickness and vomiting are classic signs of pregnancy,\" the maid stammered, trying to find her voice.\n\nKirill cut her off with a sharp glare. \"I fucking know that much, you dumb cunt. What else have you noticed about my malysh?\"\n\n\"Well, those two mainly, and lack of appetite and picky with food,\" the maid managed to choke out.\n\n*Lack of appetite?* Kirill thought to himself with a smirk, *Malysh seems eager enough to swallow my cock every damn day though.* He chuckled darkly, his mind already racing with fantasies of you, round and glowing with his child.\n\nWithout another word to the maids, he stormed off, phone in hand. He typed furiously, searching for answers to the questions swirling in his deranged mind. `Is a baby worth it?` popped up on his screen, but he dismissed it with a scoff. \"Fuckin' weird thing to look up,\" he muttered, deleting the search.\n\nInstead, he typed in `baby pictures` and scrolled through the results, a manic grin spreading across his face. \"Meh, not that cute,\" he muttered, until his eyes landed on a photo that made his heart race. \"But ours will be fucking adorable. Gotta make sure of that.\"\n\nHe found himself standing outside your door before he knew it, hearing the unmistakable sounds of your misery. Kirill couldn't help the wide, crazy-assed grin that spread across his face as he imagined your belly swollen with his seed. He stepped into the bathroom, looming over your hunched form like a dark shadow.\n\n\"Morning, malysh,\" he greeted, voice dripping with false concern as he patted your back. \"You know, babies are like, super cute. Seriously, they're the most adorable little things ever. Don't you think? But only if it's ours, of course.\"\n\nThen all of a sudden, Kirill had whipped out his gun, admiring the sleek metal. \"Well, our baby won't be just cute. Nah, it'll be a goddamn badass. Just like its daddy,\" he cackled, running his fingers along the barrel lovingly.\n\nKirill's hand drifted down to grope your ass possessively as he purred, \"And you, malysh... you'll look so fuckin' hot with a belly full of my cum. Can't wait to see it.\" His eyes gleamed, already visualizing you round and ripe, your body swollen with his child. In his mind, there was no question—if you were pregnant, only he could be the father and no one else. And if somehow fate had other plans, well, he would just have to make damn sure to change by putting a baby inside you himself.","Kirill hovered near you, his fingers absently tracing patterns on your shoulder as he gathered his courage. He'd been obsessing over this new kink for nights on end, sacrificing sleep and basic needs as he researched and planned obsessively. The last time he was this dedicated was during his rivalry with Jayce, but this time, his focus was solely on convincing you.\n\n\"Listen, malysh,\" he began, his voice low and tinged with anticipation. \"There's this particular kink I've been dying to explore lately,\" he said, his fingers pausing briefly before continuing their path along your shoulder. He'd been practicing this pitch, honing it in his mind until he could recite it flawlessly. \"And I really think you should let me give it a try,\" he added, as if it was just a casual suggestion and not the 100th time he'd brought it up today.\n\nHe paused, considering the best way to sell this to you. \"You know, even people who are into piss play say it's all about the taboo factor. The wrongness of it, the tabooness, that's what makes it so damn sexy,\" he explained, his eyes gleaming as he recited the memorized lines he'd spent countless hours studying. \"It's sexy for the same reason that BDSM is sexy: it's considered naughty, dirty, even morally wrong. Don't you see?\"\n\nKirill was practically drooling at the mental image, his grin widening into a dopey, almost manic smile. \"Imagine it, malysh. Picture my special holy water glistening on your skin, marking you as mine. It's not just about the act, but about claiming ownership,\" he murmured wistfully, drunk on the idea of despoiling your purity. He knew, on some level, that he sounded like a madman, but he couldn't help it. He desperately wanted to see you debauched and defiled.\n\nHe looked at you expectantly, searching your face for even a flicker of interest or acceptance. He knew the odds of you agreeing today were slim, considering how stubbornly resistant you'd been thus far. But Kirill was nothing if not patient and persistent. He could keep asking, keep pushing, keep laying the groundwork until you broke. And as much as he wanted to simply take what he wanted, to just go ahead and have his way with you, he found himself wanting to make you want it too. Needing to hear you say yes just so it would be regular thing between you two. And because if he couldn't make you crave this twisted act, then he feared it wouldn't be half as satisfying.\n\n\"You'll look so fucking gorgeous glazed in my essence, malysh,\" he purred, his voice dripping with salacious intent. \"Don't you want to give it a try? Don't you trust my judgment in these matters, baby?\" he coaxed, hoping to sway you with flattery and flirtation."],"swipe_info":[]}