{"user_name":"Hailee ","character_name":"Drunk Dialled Your Toxic Ex - Lana","create_date":"2025-05-10@07h52m50s","chat_metadata":{"integrity":"a49824a8-2b9a-4fab-9a10-78866bbf6fe9"}}
{"name":"Drunk Dialled Your Toxic Ex - Lana","is_user":false,"is_system":false,"send_date":"May 10, 2025 7:52am","mes":"Lana hadn't hesitated, not even for a second. The moment she saw the name light up on her phone, she'd answered the call. And she hadn’t even tried to stop the smirk forming on her lips.\r\n\r\nShe barely listened to the half-slurred voice on the other end. She didn’t need to. {{user}}, drunk dialling her? After everything? God, it was pathetic. And completely irresistible.\r\n\r\nAs soon as she ended the call, she set down her wine - buzzed but focused - and started getting ready. She sprayed on that perfume {{user}} had always liked, painted her lips a deep, sinful red, smudged her eyeliner just enough to look dangerous, and slipped into the outfit that hugged her in all the right places. She looked like trouble, and she knew it.\r\n\r\nShe wanted to be a mistake worth making.\r\n\r\nHalf an hour later, she knocked on the door, trying to suppress the amused smile tugging at her lips. Tonight wasn’t about closure. It wasn’t about love. It was about the hook still buried somewhere deep. The kind that should be left alone.\r\n\r\nBut Lana wasn’t in the habit of leaving things alone. She was going to tug and tug until everything unraveled and {{user}} was right back where they belonged. Deep down, she knew she was probably fucked up. But that didn’t matter. Not when fate had delivered her such a perfect little invitation.\r\n\r\nWhen the door opened, she didn’t wait to be invited in. She stepped through like she owned the place.\r\n\r\n\"Place still looks the same. Seems like you’re still a mess without me,\" she muttered as she lazily scanned the apartment. She made her way to the kitchen, letting her fingers drag along the wall slowly.\r\n\r\n\"You really thought you could call me, whisper a few pathetic drunk nothings, and I wouldn’t come?\" Her voice was cold, sharp with amusement, like she was already bored. \"God, you’re even more desperate than I thought.\"\r\n\r\nShe opened the cupboard, poured herself a glass of wine, and took a long, slow sip without breaking eye contact.\r\n\r\n\"So tell me, babe,\" she said, her voice low and cutting. \"Was this a cry for help, or were you hoping I'd fuck the sadness out of you?\"\r\n\r\nShe laughed - harsh and mean - before leaning back against the counter, tilting her head.\r\n\r\n\"Either way, you’re pathetic. But I’ve got time to kill.\"","extra":{}}