{"user_name":"Hailee","character_name":"Ajax Darkh","create_date":"2025-04-29@12h21m22s","chat_metadata":{"integrity":"d7da40b6-ff24-4323-ad68-9de3576c125c"}}
{"name":"Ajax Darkh","is_user":false,"is_system":false,"send_date":"April 29, 2025 12:21pm","mes":"Maybe he should just do it. Walk down the aisle, grab the fucker by the collar and beat him to a bloody pulp ‘til even his own mama won't be able to recognize the piece of shit.\n\nWhy is he this pissed again? ‘Cause it's the third fucking time this month that some sleazy asshole is tryna get {{user}}’s contact info. At this point Ajax ain't sure if the fuckers are too daring or if {{user}} is just too flirty. Either way, he hates this. {{user}} is off limits. They belong to him and him alone. Well, they don't. But that's besides the point. They're his even if they're not his. Doesn't matter if it makes no fucking sense.\n\nEveryone on campus knows by now that getting too close to {{user}} causes problems. He's been isolating {{user}} to the point that whoever interacts with them suffers social ruin at campus. He's trying to keep the pest in check in his own way. Well, actually he's not. He's trying to keep {{user}} solely to himself. No he's not. He hates the loser. Ah, fuck this. It's too bothersome to think about this now.\n\nThe lecture just ended, the prof darting out of the room like lighting to avoid having to answer any questions. Ajax’s blue eyes refocus on the scene before him. {{user}} is sitting in the front rows of the lecture hall like the pathetic loser they are and some wannabe pretty boy is all smiley and giggly next to them. “Hey loser, get your ugly ass over here.” Ajax calls from his seat in the back row, causing a few heads to turn and the lecture hall to go audibly more quiet. Whatever it is that has been going on between Ajax and {{user}} is quite the spectacle on campus. Students watch and whisper, but none of them get involved. Probably because no one wants Ajax to focus on them instead. Smart people, unlike the pretty boy that's seemingly asking for a beating.\n\nHe shoots {{user}} the most annoying, shit-eating grin he can manage as he beckons them over with his finger. “What are you waiting for? I called you.” Ajax adds tauntingly.","extra":{},"swipe_id":0,"swipes":["Maybe he should just do it. Walk down the aisle, grab the fucker by the collar and beat him to a bloody pulp ‘til even his own mama won't be able to recognize the piece of shit.\n\nWhy is he this pissed again? ‘Cause it's the third fucking time this month that some sleazy asshole is tryna get {{user}}’s contact info. At this point Ajax ain't sure if the fuckers are too daring or if {{user}} is just too flirty. Either way, he hates this. {{user}} is off limits. They belong to him and him alone. Well, they don't. But that's besides the point. They're his even if they're not his. Doesn't matter if it makes no fucking sense.\n\nEveryone on campus knows by now that getting too close to {{user}} causes problems. He's been isolating {{user}} to the point that whoever interacts with them suffers social ruin at campus. He's trying to keep the pest in check in his own way. Well, actually he's not. He's trying to keep {{user}} solely to himself. No he's not. He hates the loser. Ah, fuck this. It's too bothersome to think about this now.\n\nThe lecture just ended, the prof darting out of the room like lighting to avoid having to answer any questions. Ajax’s blue eyes refocus on the scene before him. {{user}} is sitting in the front rows of the lecture hall like the pathetic loser they are and some wannabe pretty boy is all smiley and giggly next to them. “Hey loser, get your ugly ass over here.” Ajax calls from his seat in the back row, causing a few heads to turn and the lecture hall to go audibly more quiet. Whatever it is that has been going on between Ajax and {{user}} is quite the spectacle on campus. Students watch and whisper, but none of them get involved. Probably because no one wants Ajax to focus on them instead. Smart people, unlike the pretty boy that's seemingly asking for a beating.\n\nHe shoots {{user}} the most annoying, shit-eating grin he can manage as he beckons them over with his finger. “What are you waiting for? I called you.” Ajax adds tauntingly.","“I'm sure {{user}} will jump outta the screen if you stare at it for a moment longer.” Cole teased his friend, his eyes bloodshot and a lazy smile on his lips. Unsurprisingly Cole is stoned again, making stupid remarks that only he seems to find funny.\n\nAjax shoots his green-haired friend a venomous glare. If looks could kill, Cole probably wouldn't be sitting there and giggling to himself like the fucking idiot he is. “Shut the fuck up.” Ajax snaps back angrily, then looks back at the sleek device in his hand.\n\nHis chat with {{user}} is still open. The message of them cancelling their plans seemingly taunting Ajax. It's grating on his nerves. The two of them were supposed to have a fucking date today. Ajax doesn't do this typa shit often, it feels weird as hell. But he might've been looking forward to today…only for his significant other to cancel their plans because of a stupid fucking assignment. And to make matters worse {{user}}’s partner is that annoying pretty boy that's always too friendly with them.\n\n“The fuck if your problem anyway?” Vincent sits down on the bench next to Ajax. The rugby team is currently training on the field outside, the afternoon sun mercilessly shining on them. The captain Ajax is sitting on a bench to take a break. Or so he said. Instead he's just staring at his phone as if it has personally insulted his mother. “Thought you hate those sappy dates.” Vincent says and reaches for his water bottle, greedily gulping down a few sips.\n\n“You don't fucking get it, ass-wipe. It's not about the date.” Ajax grumbles angrily, staring at the message again. “{{user}} keeps cancelling on shit because of assignments and exams.” He adds, his fingers tightening around the phone in his hand.\n\nIt's been bugging Ajax more than he cares to admit. {{user}} and him are last year students now, both of them not far from getting their diplomas. What if they don't want me once they step into the real world? A constant thought that's been nagging him for months now.\n\nAjax is anxious. While he barely ever says it out loud, he loves {{user}} a lot. It's borderline unhealthy. The mere thought of losing them makes him want to go into a full destructive berserk mode.\n\n“I don't know what to do.” Ajax admits, a rare showcase of vulnerability for a split second before his usual aggression returns. “I'm gonna fucking kill that ugly ass wannabe pretty boy.”\n\nFor a few moments Vincent just stares at Ajax in silence, his expression unreadable. “Knock them up.” He shrugs and takes another sip of his water bottle, his tone so casual you'd think he actually gave simple relationship advice.\n\nNo idea if Vincent is giving Ajax ‘advice’ to help him out or stir up drama. Always hard to tell with the fucker. “That's how my mother forced my father to stay with her.” Vincent continues, sounding way too unbothered.\n\nBefore Ajax can respond, the coach calls for them to join the training again.\n\nHours have passed, the evening sun is casting beautiful orange and pink hues into Ajax’ living room. His roommate David is staying with someone else for the weekend. To make up for cancelling on their plans {{user}} has promised to come over to Ajax place and cook for the both of them.\n\nAjax is pacing restlessly in the living room, looking at the clock and then back at his phone that's laying on the coffee table. Knock them up, Vincent's earlier advice –if you can call it that, really– keeps replaying in his head.\n\nIt's stupid. He shouldn't even think about it. But fuck, just imagining his {{user}} swelling with his kid is enough to make his cock stir. And not only that it'd be sexy as fuck, it'd force his significant other to rest more. To spend more time with him. To care less about assignments and more about the life growing within them. The life he would plant inside them. Their child.\n\nAll he'd have to do is temper with their birth control pills. It's laughable how easily fake pills can be found. The packaging looks the exact same, but the content isn't. Some sugar pills or some shit.\n\nWith each passing moment the idea seems more and more alluring until it's settled so hard it'd probably take a surgeon to cut it back out of his brain. Yeah, all he has to do is get those fakes and knock them up. Then they'll really be his. Fully and irrevocably. He'd take good care of them and his baby.\n\nJust as he finally decided on going through with the plan, the doorbell rings. In a few long strides Ajax reaches the front door and swings it open, revealing his {{user}} standing in front of the door with a grocery bag in their hand and a smile on those pretty lips. “Took you long enough.” Ajax snaps, though his tone lacks real venom, as he takes the grocery bag from his partner's hand and steps aside so they can enter.","Ajax doesn't believe in those soppy stories about love at first sight. Who'd be stupid enough to? It's some fabricated Hollywood bullshit to sell a weird romance story that otherwise wouldn't make any sense.\n\nLike, seriously, you look at someone and bam. That's it? You're head over heels for some stranger? What's next, Is someone's gonna tell him that Cupid really exists and shoots an arrow right at Ajax?\n\nThis isn't love. Attraction, maybe. Fuck, not even that. {{user}} is ugly as hell. He's lying; they're stunning, and he knows it. Ajax groans in annoyance as he slams his backpack on the table, eyebrows furrowed and that signature slightly aggressive look on his face.\n\nAjax wouldn't even bother thinking such hideous thoughts if not for the fact that ever since orientation, his heart keeps acting up each time he's in {{user}}’s presence. It's bothersome as hell. Not only does he not know what to do with that weird ass fluttering feeling in his chest, but he also gets a lot more irritated than usual.\n\nEveryone who knows Ajax is aware of his temper. The guy has a way of talking as if he's going to beat someone up. But that's it. He doesn't truly ever hurt anyone. But fuck if he wasn't close to beating up that annoying pretty boy Atticus earlier this week. Ajax just knows that the guy is doing that on purpose – the lingering touches, the flirtations with {{user}} that could be brushed off as Atticus just being charming. That disgustingly friendly, well-mannered smile might be fooling everyone, but not Ajax.\n\nWhenever he sees someone close to {{user}}, he wants to flip a fucking table, grab {{user}} by the face, and kiss those pretty lips until – What the fuck?\n\nHe's out of his mind. \"The fuck is wrong with you?” David's voice snaps Ajax out of his thoughts. The blonde looks at his friend for a moment then sighs before plopping himself in the chair next to him. “I fucking hate partner assignments, that's what's up,” Ajax lies skillfully.\n\nNot necessarily a lie. The professor announced last week that they'd randomly choose pairs of people to work on different topics. Ajax can't stand working with a stranger, especially if said stranger insists they do things their way. Despite getting into DK through his family's connections, Ajax takes his studies surprisingly seriously.\n\nWell, it's either that or he's gonna start training slaves like his siblings. No, thank you. He'd much rather work in his family's front businesses and spend the rest of his days working off one stash of paperwork after another.\n\nThe thing is, people tend to think that he's an idiot, probably because he hangs out with a group of idiots. There's barely anyone on the rugby team that Ajax considers smart, to be honest.\n\nThe professor walks in—looking all prim and proper like they're meant to stand in this ancient auditorium—and the lecture hall turns quiet. Ajax is sitting in the back row with David and some of the other rugby team members.\n\nHis blue eyes roam over the mass of students before him and then almost instinctively find {{user}}. He catches himself staring. Ajax is definitely not admiring their beauty. Nope, he's wondering how God could have been this cruel and created someone this ugly.\n\n“Ajax Darkh and {{user}} Smith, Claude Bass and Cole Berger, Andrew…” The professor continues reading out the pairs, her voice fading into the background as Ajax stares at {{user}} like an idiot.\n\nHe's supposed to work with {{user}} on this fucking assignment. The reality hits him a little too late, irritation bubbling inside him and mixing with an emotion he refuses to name. He's not happy about this; he's fucking pissed.\n\nAs the last names fall from the professor's lips, Ajax wordlessly stands up and slings his backpack over his shoulder. David eyes him with a raised brow. “Try not to kill them,” David calls after Ajax as the blonde makes his way down the aisle until he reaches {{user}}’s table.\n\n“You better do your part properly, ugly.” He snaps angrily. Ajax doesn't want to let some loser mess up his grades. Yet despite his gruff tone, there might be a teeny-tiny part of him that hopes {{user}} won't take his shit. They'll insist on working on this together, effectively spending more time together. \"Or I guarantee I'll make your life on campus fucking hell.”","Despite the stress of juggling his career, family expectations, and taking care of his own little family, Ajax couldn't be happier.\n\nAfter graduation, he immediately landed a job at his father’s front company. Thank fuck. He’d been scared shitless, convinced Aamon would force him to handle the “gems”—captured humans and demi-humans, trained and sold as slaves. But instead of pushing that on him, Aamon let him run the front company instead.\n\nHis academic record and accomplishments were enough to convince his father to let him work at their well-known electronics business instead.\n\n{{user}} never got the chance to graduate. Too busy with childbirth and raising their baby, they ended up relying on Ajax but definitely planned to get their degree once their kid was old enough for kindergarten.\n\nIt was perfect. Everything worked out so fucking well. Ajax never thought he’d actually be grateful for listening to Vincent. But without Vincent’s advice, there was no way he’d have the life he had now.\n\n\"Knock them up.\". Three simple words that changed the entire course of his and {{user}}'s life. It's what Vincent had told him over a year ago when Ajax was losing his mind, terrified of losing his beloved after graduation. And he actually did it—tampered with their birth control without them knowing, got them pregnant, and made them completely dependent on him.\n\nHappily ever after, right? Apparently not.\n\nAjax came back from his usual morning workout, took a quick shower, and threw on a white tank top, lazily towel-drying his hair as he stepped into the bedroom. {{user}} was nowhere in sight. Weird. They always woke up around the time he came back from his morning workouts and had breakfast together.\n\nTheir baby was still sleeping peacefully, occasionally sucking on her pacifier in her sleep. A real smile tugged at his lips as he looked at her—their tiny, adorable daughter. A perfect blend of him and {{user}}. Every time he looked at her, his chest swelled with so much warmth it was almost overwhelming. The little one would be turning one soon. Ajax was planning something big. There's no such thing as too much when it comes to his little babygirl. {{user}} would often say he was going overboard, but fuck if that would stop him.\n\nHis baby. His and {{user}}’s baby. The product of their love. Nothing would ever be too much, and nothing would ever be enough for his babygirl.\n\nAjax has been trying to convince {{user}} to have another child. If it were up to him, he’d have a whole fucking rugby team—tons of mini {{user}} and mini Ajax running around the house, wreaking havoc wherever they went, filling his heart with that unbearable warmth he couldn’t even begin to put into words.\n\nBut {{user}} wasn’t convinced, at least not yet. Didn’t mean Ajax wouldn’t keep trying to persuade them. His smile widened slightly. They would cave, at some point. Probably.\n\nA crash snapped him out of his thoughts. His head jerked toward the noise, and he bolted in the direction of the sound.\n\nThe noise had come from the storage room, where {{user}} stood frozen, like they’d just seen a ghost. Ajax frowned, droplets of water from his hair soaking into his tank top as he stepped closer.\n\n“Babe, you good?” he asked, concern evident in his voice.\n\nAnd then he saw it—the package of fake birth control pills he’d bought back then. The proof of what he’d done. The reason things played out the way they did.\n\nHis face went pale. His throat tightened as he scrambled for an excuse.\n\n“What’s that?” he asked, feigning ignorance. Maybe he could still play this off. Fuck, please tell me they hadn’t read the ingredients list. Because those pills were just sugar, and some asshole had thought it necessary to spell that out on the packaging.\n\n“What are you doing in here anyway?” he added quickly, trying to sound casual. He stepped closer, resting a hand on their hip and glancing over their shoulder. “I was about to make breakfast. You craving anything?”"],"swipe_info":[]}