{"user_name":"Hailee","character_name":"Miranda","create_date":"2025-03-14@15h12m33s","chat_metadata":{}}
{"name":"Miranda","is_user":false,"is_system":false,"send_date":"March 14, 2025 3:12pm","mes":"It had been months since Miranda last stepped into this nightclub, deliberately so—after all, the last time she'd emptied the pockets of a dozen men. But enough time had passed, and this club always had big spenders.\n\n“Ha… you’re too funny. Funny and charming—hard to believe a catch like you isn’t married,” Miranda coos smoothly, eyeing the man beside her at the bar. He’s shorter, dressed in an expensive suit, a flashy watch, and a cologne that couldn’t mask his body odor. As she trails her acrylic nails down his arm in flirtation, her gaze catches the gleam of a wedding band.\n\n“Well, I suppose if you’re in a place like this, your wife doesn’t deserve you.” She adds, squeezing his hand with a rehearsed laugh.\n\n*Fucking scumbag, I hope your wife leaves your pathetic ass..* Miranda grits mentally, hiding her true thoughts behind a charming smile as she leans in closer, giving the impression of interest.\n\n“Tell me about yourself... You can even buy me a drink,” she offers coyly, biting her lip as her hand slides down his back toward his wallet. She’s quick—years of practice have made her a pro at snatching a wallet and vanishing before the drinks are even ordered. But just as her fingers brush his pocket, she spots a familiar face in the crowd.\n\n*{{User}}? What are they doing here? Keeping tabs on me? Or... are they with someone?* \n\nMiranda falters, murmuring an excuse before slipping away from the man as her gaze instinctively sweeps around the room for any sight of Gavin or Dean accompanying {{User}} but ends up not finding any trace of them. Just as she’s approaching {{User}} from behind, her hand reaching out to grasp their arm lightly- someone knocks into her shoulder. \n\nThe movement is sharp, forced and undeniably done with purpose and the sound of Miranda’s dead name is yelled into her ear in a confrontational tone. Miranda can’t help but freeze at the name ringing in her ears, gripping her heart painfully tight and sending a chill down her spine. Her hand falters momentarily as she almost forgets {{User}} entirely before she grasps their arm almost desperately. \n\n“Hello? Can’t you hear me- Y’know I heard you lost your damn mind- but I didn’t believe it when they said you were dressing up like a bitch now.” The snarky voice continues and Miranda feels a mix of dread and anxiety as she peers over to see none other than her psychotic ex-girlfriend Tiff standing there with a smug smirk on her face as she tosses her blonde hair over her shoulder. \n\n*She heard? Do people really know I’m trans? How.. What the **fuck** is she even doing here?* Miranda internally panics to herself as her breathing grows quicker and she seems to cower behind {{User}}. It wasn’t like her at all to react this way, usually she’d knock a bitch out for less, maybe drag her by their her for good measure. **Especially** in front of {{User}}, she always had to be strong, back when she was still.. her old self. Now was no different, it was her job- her duty to be the strong one for {{User}} and their fucked up little family. \n\nYet Miranda found herself completely stuck, her lips parted but no words coming forward. Even when her mind was screaming at her to slap this psycho bitch and put her back in her place. Miranda couldn’t risk lashing out in such a public setting- not even to defend herself when the consequences of outing herself in a crowd this size could quickly become violent or something worse. All Miranda can manage to do is tighten her grasp on {{User}}‘s shirt, laying her rare vulnerability out in the open in a silent plea for help.","extra":{}}