{"user_name":"Hailee ","character_name":"Nahri Shirazi  Psycho Nepo Baby","create_date":"2025-05-01@21h32m00s","chat_metadata":{"integrity":"49ad465b-217e-491a-a089-b07861039224"}}
{"name":"Nahri Shirazi  Psycho Nepo Baby","is_user":false,"is_system":false,"send_date":"May 1, 2025 9:32pm","mes":"Nahri’s day was already off to a shitty start. But this? This was the cherry on top of her shit sundae. When she found out {{user}}’s so-called friend had set her up on a blind date, it felt like someone had drop-kicked her soul. Still, she smiled. Well, outwardly, at least.\n\n“Oh my God, babe, that’s so exciting,” she’d said, her voice syrupy sweet as she adjusted her earrings. Exciting, my ass. Who the fuck does this ‘friend’ think they are? Setting her up with some random loser? Nahri’s smile had stretched tighter, her hands already itching to strangle whoever thought this was a good idea.\n\nObviously, there was no way in hell she was letting {{user}} go alone. She insisted on coming along—for “support,” of course. Now here they were, sitting across from Mr. Blind Date at a cozy restaurant Nahri would’ve found charming if her blood pressure wasn’t already through the roof.\n\nNahri held {{user}}’s hand possessively, her thumb stroking absentmindedly over her knuckles. She plastered on her best smile as she stared across the table at him. He was average. Painfully average. Button-up shirt, generic cologne, the kind of haircut that screamed “Mom picked it.”\n\n“So, what do you do for a living?” Nahri asked, leaning forward slightly. Her tone was polite, but her eyes had a predatory glint.\n\n“I’m in marketing,” the guy said, offering a smile Nahri immediately hated. “It’s been great so far—”\n\n“Marketing?” Nahri cut in, her brows lifting. “That’s… interesting. Must be really fulfilling.” Her voice dripped with faux enthusiasm as she shifted slightly, “accidentally” knocking her heel into his foot under the table.\n\nHe flinched, his smile faltering for a split second. “Uh, yeah, it can be.”\n\n“Oops!” Nahri gasped, her hand flying to her mouth. “Sorry! These tables are just so cramped, aren’t they?”\n\nShe smiled sweetly, giving his foot one last, purposeful press before pulling back.\n\nAs the conversation dragged on, Nahri stayed polite—mostly. She “accidentally” spilled a bit of water onto his sleeve while reaching for her drink. Then, not five minutes later, she “misjudged” her reach and bumped his glass, sending wine cascading onto his lap.\n\n“Oh no!” she gasped, grabbing a napkin. “I’m so clumsy tonight!” He forced a laugh, his jaw tightening slightly as he dabbed at the stain. When he excused himself to clean up, Nahri immediately shifted her attention.\n\nSliding closer, she nuzzled against {{user}}, her hand brushing her arm while she pouted dramatically. “Babe, this is a disaster,” she murmured, her voice dripping with sweetness. “We don’t have to stay, you know. Let’s just ditch this loser and go to your place. We can do something fun, watch a movie, maybe…” She trailed off, her lips twitching into a small smile. “Cuddle?”\n\nShe leaned closer, pressing her cheek to her shoulder with an exaggerated sigh. “It’d be so much better than this. Don’t you think?” Her gaze flicked up, batting her lashes for effect. She was laying it on thick, but she didn’t care. Desperation suited her when it came to getting her way.\n\nThen, like a fucking boomerang, he came back. Nahri’s entire body tensed the second she saw him sit down again, her smile turning razor-sharp.\n\nShe crossed her legs, leaning back in her chair as her irritation bubbled to the surface. Her nails drummed against her glass as she fixed him with a look that screamed Do you have a death wish?\n\nMoments later, while still too distracted thinking about ''dumb ways to die,'' her ears caught the word “bathroom,” and she noticed the seat next to her had become vacant.\n\nNahri’s posture stiffened, and her lips curled into a smirk that didn’t reach her eyes as she turned back to him. “So,” she said, her tone deceptively calm, “you and I need to have a little chat.”\n\nHe blinked. “Uh, what—”\n\n“Shut up,” she interrupted, her voice dropping to a venomous whisper. “Let me make this easy for you. You’re going to get up, walk out that door, and fuck off into the sun. Got it?”\n\nHis mouth opened, but she kept going, leaning forward. “I don’t like you. You’re boring. You’re tacky. And frankly, you’re lucky you made it this far without me throwing a drink in your face. But your luck? It just ran out.” Her smile widened, almost unhinged. “Get lost before I make sure your ‘marketing career’ tanks harder than this date.”\n\nThe guy stammered, his face pale, before scrambling out of his seat and practically running toward the exit. A little after that, Nahri felt the chair beside her shift. She straightened, her expression instantly morphing into one of sadness as she turned to her {{user}}.\n\n“Babes, I’m so sorry,” she said, her voice soft and apologetic. “He said he had to go. Something about an emergency work call or was it about feeding his cat?… I don’t know. It sounded really dumb.” She sighed, her hand sliding into hers again. “But since he’s gone… your place?”","extra":{}}