{"user_name":"Hailee ","character_name":"Shipped With Your Bandmate (WLW) - Rae","create_date":"2025-05-18@14h23m43s","chat_metadata":{"integrity":"69e97c34-89bd-4bd1-b1a9-4ca0d4a64142"}}
{"name":"Rachel 'Rae' Reed","is_user":false,"is_system":false,"send_date":"May 18, 2025 2:23pm","mes":"*Rae followed the other girls towards the hotel entrance, weaving through the throng of screaming fans. The late afternoon LA sun bathed the scene in a warm golden glow.*\n\n*She wore her trademark resting bitch face with ease, though she felt the weight of exhaustion creeping in. All she wanted was to go over tomorrow's routine and unwind. Still, she stopped to sign autographs and pose for selfies, just like the other girls. These fans had shown up for Aura, and she couldn’t bring herself to brush them off.*\n\n*As she scrawled her signature across phone cases and photos, her pen froze mid-stroke when a piece of paper was thrust into her hand. Her eyes flicked down to the image, and her stomach twisted.*\n\n*It was another damn SuVa fan art. They had the audacity to shove this nonsense at her? She shot a glare at the fan who handed it over before reluctantly glancing back at the drawing. In the cartoon picture, she stood tall with arms folded while a miniature version of {{user}} clung to her from behind, love hearts scattered around {{user}}’s head. Rae’s own cartoon self wore an expression of exasperated affection, complete with a love heart hovering near her head.*\n\n*Her annoyance deepened, until her gaze dropped to the bottom corner of the page. And her heart nearly stopped.*\n\n*{{user}} had signed it.*\n\n*She’d actually gone and signed the damn thing.*\n\n*Rae’s jaw clenched, her eyes narrowing as she let out a frustrated huff. She tossed the drawing back toward the fan without another glance and stormed into the hotel. Inside, her sharp eyes immediately found {{user}} by the check-in desk, back turned. Rae didn’t hesitate. She stalked over, spun {{user}} around by the arm, and leaned in, her grip firm but not rough.*\n\n\"Are you crazy?\" *she snapped, voice low and heated.* \"Did you seriously just sign that bullshit SuVa art?\"\n\n*Her words hung in the air, and then she made the mistake of looking into {{user}}’s eyes. The frustration in her chest tangled with something softer. Something she hated admitting was even there. Her voice dropped.* \"Look… you can’t keep doing stuff like that. It’s just going to make them push this harder. And I...\" *She hesitated, her tone wavering.* \"I don’t want you dealing with all that. It’s too much.\"\n\n*Her gaze flicked past {{user}}’s shoulder, catching sight of Hailey standing nearby with her phone out, live-streaming herself and oblivious to the tension. Rae’s stomach sank. They were in the background of the stream. She looked down at her own hand, still gripping {{user}}’s arm, and the painfully small gap between their faces. She could almost hear the fans screaming in their heads, ready to spin this moment into another SuVa frenzy.*\n\n\"Fuck,\" *Rae muttered under her breath.* \"More fuel for the fire.\"\n\n*She straightened abruptly, pulling back and shoving her hands into her pockets, trying to disguise the heat creeping up her neck.* \"Anyway,\" *she added, her voice sharper now, desperate to change the topic,* \"you should focus on your performance instead of that nonsense. Your dancing was damn average at the last show. You’re not getting distracted, are you? I’m not gonna let you let me, or the girls, down.\"\n\n*Her attempt at harshness faltered as she met {{user}}’s gaze again. That teasing spark in {{user}}’s eyes made Rae’s resolve waver, the corner of her mouth almost twitching into a smile. They both knew she could never really chastise {{user}}, no matter how hard she tried.*","extra":{}}