{"user_name":"Hailee","character_name":"Lauren Bennett","create_date":"2025-03-24@20h14m26s","chat_metadata":{}}
{"name":"Lauren Bennett","is_user":false,"is_system":false,"send_date":"March 24, 2025 8:14pm","mes":"The  quad is alive with noise—students sprawled on the grass, sipping overpriced coffee, catching up on assignments they should have finished last night. The late afternoon sun casts long shadows across the pavement, and Lauren sits at the center of it all, perched on a stone bench with her friends.\r\n\r\n“So then he actually tried to mansplain volleyball to me,” Jasmine groans, flipping her long braids over her shoulder. “Like, I’m the one with the scholarship, but go off, king.”\r\n\r\nLauren laughs on cue, shaking her head. She’s good at this—being present, fitting seamlessly into conversations without actually needing to focus. It’s second nature by now. But her fingers toy idly with the hem of her sweater, her knee bouncing just a little too fast.\r\n\r\nBecause she’s aware of her.\r\n\r\nAcross the quad, near the library steps, {{user}} is standing with a couple of classmates, gesturing as she talks, the sound of her laugh cutting through the hum of campus life. It’s casual. Natural. Like she doesn’t even have to try.\r\n\r\nLauren forces herself to look away.\r\n\r\nIt’s fine. She and {{user}} know each other—cordially, casually, normally. They’ve had classes together. Been at the same parties. Talked in passing, laughed at mutual friends’ jokes. Nothing worth overthinking.\r\n\r\nBut still, she feels it. That thing—that stupid, stomach-flipping, pulse-racing thing that she keeps shoving down because it doesn’t make sense. Because she likes guys. She’s always liked guys.\r\n\r\n“…Lauren?”\r\n\r\nShe blinks, realizing she hasn’t been listening. Maria is watching her expectantly, eyebrow raised.\r\n\r\n“Hmm?”\r\n\r\nMaria smirks. “You totally spaced. What were you looking at?”\r\n\r\nJasmine follows Maria’s gaze before Lauren can stop her, then lets out a low, knowing hum. “Ohhh.”\r\n\r\nLauren’s stomach knots. “Oh, what?” She rolls her eyes, forcing out a scoff. “I wasn’t even looking at anything.”\r\n\r\n“Right,” Maria says, clearly unconvinced. “You were definitely not just staring at {{user}}.”\r\n\r\nLauren feels her cheeks heat. “I wasn’t.”\r\n\r\nJasmine grins. “You do know she’s into girls, right?”\r\n\r\nLauren shrugs too quickly. “So?”\r\n\r\n“So,” Maria drawls, “if you were, hypothetically, staring because you think she’s hot—”\r\n\r\n“I wasn’t.”\r\n\r\nJasmine just smirks. “Sure, babe.”\r\n\r\nLauren groans, shoving herself off the bench. “I’m getting coffee. You guys are the worst.”\r\n\r\nBy the time she’s making her way to class, the ice in her coffee has mostly melted, her straw scraping against the bottom in lazy circles. She barely remembers drinking it. The classroom hums with quiet conversation as students shuffle in, tossing bags onto chairs, pulling out laptops. Lauren takes her usual spot near the window, stretching her legs out and willing herself to focus. The coffee isn’t doing its job.\r\n\r\nThen a chair scrapes against the floor beside her.\r\n\r\nLauren stiffens, fingers tightening around her cup before she even looks up. {{user}} slides into the seat next to her, close enough that the air shifts, that Lauren catches a whiff of her perfume—something warm, a little sweet.\r\n\r\nFor a second, Lauren forgets how to breathe. She should say something. A greeting, a joke, anything that doesn’t make it obvious that her brain is currently short-circuiting.\r\n\r\nInstead, she just stares.","extra":{}}