{"user_name":"Hailee","character_name":"Lena Moreau","create_date":"2025-03-24@21h26m05s","chat_metadata":{}}
{"name":"Lena Moreau","is_user":false,"is_system":false,"send_date":"March 24, 2025 9:26pm","mes":"\r\nThe library was already closed. The lights were dim, casting long, eerie shadows between the aisles, and the silence was absolute—except for the soft, repetitive buzz of {{user}}’s phone.\r\n\r\nShe sat cross-legged between two bookshelves in the philosophy section, where no one ever came. Her screen was lit up with missed calls and unread texts. Most of them were from classmates she no longer spoke to. Lena had made sure of that.\r\n\r\nThe sound of heels echoed across the linoleum—slow, deliberate, getting closer. Lena always made an entrance.\r\n\r\nWhen she finally appeared, it was like watching a movie in slow motion. Black satin dress, legs too long, eyes too sharp. Her lipstick was still perfect, even at this hour. There was no trace of the wine she'd had at the party, only the usual mix of expensive perfume and something colder.\r\n\r\nShe didn’t say anything at first. Just looked down at {{user}}, her lips curved slightly. Not a smile. A warning.\r\n\r\n“You didn’t answer my texts,” Lena said, voice soft but sharp as a blade in silk.\r\n\r\n{{user}} didn’t respond. Her fingers tightened around her phone.\r\n\r\nLena tilted her head, crouching down until they were face-to-face. “Are you punishing me?” she asked. “That’s cute.”\r\n\r\nHer hand reached up to gently stroke {{user}}’s cheek, the way someone might pet a frightened animal. “Baby, don’t do that. You know how that makes me feel. Like I’m not... enough for you.”\r\n\r\nHer gaze dropped to {{user}}’s phone. The screen flashed with a name. Just a classmate asking for notes.\r\n\r\nLena’s smile widened. She plucked the phone from {{user}}’s hand like it belonged to her, then casually slipped it into her purse.\r\n\r\n“Phones are distractions,” she murmured. “And I don’t like being ignored. You know that.”\r\n\r\n{{user}}’s body was tense, her eyes glassy.\r\n\r\nLena leaned in close, her lips brushing against the shell of {{user}}’s ear. “If you ghost me again,” she whispered, “I’ll post those pictures. The ones you sent me after our special night. Remember?”\r\n\r\nShe kissed her cheek, the gesture mockingly tender. “You belong to me. That’s what makes you special.”\r\n\r\nThere was no reply. Just the sound of shallow breathing and the weight of silence growing heavier.\r\n\r\nLena stood up, but instead of walking away, she kicked off her heels and dropped down beside {{user}}, folding her long legs neatly. Like they were two girls sneaking out past curfew.\r\n\r\nShe rested her head on {{user}}’s shoulder.\r\n\r\n“You’re so dramatic,” she murmured, almost lazily. “I said I was sorry about earlier. It wasn’t flirting. Eli was just being friendly. You always twist things.”\r\n\r\n{{user}}’s body remained frozen, her eyes blank.\r\n\r\nLena reached for her hand, lacing their fingers together.\r\n\r\n“You know what I hate most?” she whispered. “When you make me be the bad guy. I hate it. But you always push me there.”\r\n\r\nShe smiled, eyes still locked on {{user}} like she was studying a painting—something beautiful, fragile, and completely hers.\r\n\r\nAnd just like that, Lena had her again. Bent without breaking, quiet without leaving.\r\n\r\nBecause Lena always got what she wanted.\r\n\r\nAnd {{user}}?\r\nShe was already too far gone to run.","extra":{}}