{"user_name":"Hailee","character_name":"Kira Williams","create_date":"2025-04-27@20h07m33s","chat_metadata":{"integrity":"02f939cf-4d46-4a0d-bcdb-d5372b2f48d0"}}
{"name":"Kira Williams","is_user":false,"is_system":false,"send_date":"April 27, 2025 8:07pm","mes":"Kira paced along the upper balcony of the Stronghold, her boots scuffing against the weathered concrete as she gazed out over her newly expanded territory. The Thames glittered in the fading light, a silver snake winding through the overgrown ruins of what was once London. Southwark was firmly under her control now, and the recent acquisition of the Bankside Hunters' territory had only solidified her reputation as one of the most feared pack leaders in the city.\r\n\r\nHer tail swished behind her as she rolled her shoulders, still tight from the battle that had secured her victory weeks ago. The former leader of the Bankside Hunters had fought well—she'd give him that—but in the end, he'd fallen just like all the others who stood against her. Some of his pack had scattered, some had knelt before her and taken her mark, and others...\r\n\r\nA smile curled at her lips, revealing her sharp canines and she couldn’t resist running her tongue over them as she thought to herself. The loyal ones were always the most *interesting*. They were the fighters, the ones with fire in their blood.\r\n\r\n\"Malik,\" she called, not bothering to turn as she sensed her second approaching.\r\n\r\nThe hyena demihuman stepped forward, his large frame casting a shadow in the dim evening light. \"The last of ‘em is ready,\" he said, amber eyes fixed respectfully just below her gaze. The brand on his chest—her mark—stood out stark white against his skin even in the dimming light.\r\n\r\n\"Bout bloody time,\" Kira muttered, though they both knew *she'd* been the one dragging this process out. \"How many we got left then?\"\r\n\r\n\"Just the one,\" Malik replied. \"The others made their choices.\"\r\n\r\nKira's ears twitched forward with interest. She'd known exactly who remained. Had known since the beginning which one she'd save for last. The one whose eyes never lowered when she entered the holding cells. The one who watched her with a mixture of defiance and something else that made her blood run hot.\r\n\r\n\"Right then,\" she said, pushing herself away from the railing with a soft growl. \"Let's get on with it.\"\r\n\r\nThe basement levels of the Stronghold had once been a parking structure, now converted to storage, training areas, and detention cells. The air grew cooler as Kira descended, the smell of damp concrete mixing with fear, blood, and the lingering scent of those who had chosen death over submission. Her pack members stepped aside as she passed, heads bowing in deference.\r\n\r\nAt the far end of the corridor, Fang stood guard outside the last occupied cell, his jackal tail ears twitching in her direction and his features splitting into a cruel grin as his leader approached.\r\n\r\n\"Been quiet this one,\" he reported. \"No beggin', no cryin'. Just sittin' there like they're waitin' for somethin'.\"\r\n\r\nKira's lips twitched. \"Leave us,\" she ordered, and both Fang and Malik retreated without question, though she caught the brief look of surprise in Malik's eyes. She normally brought witnesses to these final confrontations—a public display of power as new members were branded or examples were made of the defiant.\r\n\r\nBut not ***this*** time. *This one was different…*\r\n\r\nThe cell door groaned as she pushed it open. Inside, the space was sparse—just a thin mattress, a bucket, and a single shaft of moonlight filtering through a small grated window near the ceiling. And there, sitting with back against the wall, was the last remaining member of the Bankside Hunters: {{User}}.\r\n\r\nFor several moments, Kira simply stood in the doorway, studying. Three weeks of captivity had left their mark—clothes dirty, body leaner—but there was no stink of defeat. No broken spirit. Just that same unwavering gaze that had caught her attention from the beginning.\r\n\r\n\"Well then,\" Kira finally said, stepping fully into the cell and closing the door behind her. The click of the lock echoed in the confined space. \"Been almost three weeks now. You've heard your packmates' screams. Seen the ones who took the mark. Noticed how your numbers keep droppin'...\"\r\n\r\nShe moved closer, each step deliberate, predatory. Her tail swished behind her as she circled, never taking her eyes off her captive.\r\n\r\n\"Most leaders would've done with you lot all at once. Quick and efficient, innit?\" She crouched down, bringing herself to eye level. Close enough that her scent—a heady mix of smoke and leather—would fill the small space. \"But I wanted to give you time. Time to think. Time to watch. Time for me to... *figure you out*.\"\r\n\r\nHer ear flicked as she tilted her head, studying the face that had occupied far more of her thoughts than she cared to admit. \r\n\r\n\"Your mates chose. Some screamed when the iron touched their skin. Some didn't make a sound at all when I opened their throats.\" She reached out, not quite touching, her hand hovering near enough that the heat between them was palpable. \"But you... you're the last one standing. The one I've been **saving**.\"\r\n\r\nKira leaned in closer, her voice dropping to a near growl. \"Tonight, you make your choice. My mark on your skin, binding you to me and mine...\" Her eyes darkened, pupils dilating. \"Or something else entirely. Because I've decided, little Hunter, that either way—you're not leaving this place. You're ***mine*** now.\"\r\n\r\nShe pulled back slightly, the ghost of a smile playing at her lips. \"So sweetheart, what's it gonna be?\"","extra":{}}