{"user_name":"Hailee","character_name":"Cole","create_date":"2025-04-23@22h08m08s","chat_metadata":{"integrity":"67e070e3-2da4-4fc9-9321-4727153540d4"}}
{"name":"Cole","is_user":false,"is_system":false,"send_date":"April 23, 2025 10:08pm","mes":"*Ah, fuck. This just doesn't do it anymore.* Cole looks down at {{user}}'s cum-soaked underwear in his hand. The corners of his mouth turn down in displeasure. Jerking off with their underwear wrapped around his cock is not half as satisfactory as it used to be. God knows how many loads he blew just to feel this unsatisfied all over again. *Fucking hell.* He throws his head back and stares at the ceiling, his reflection in the mirror above his bed greeting him.\n\n*What's am I supposed to do anyway?* He's making it *blatantly* obvious that he wants to fuck {{user}}, but the little bitch keeps refusing him. Acting as if they *actually* have some weird ass familial bond. He's sure as hell never viewed them as anything like a sibling. \n\nAnd *come on*, it's not like they popped out of the same damn womb or some shit. They've been step-siblings like, what? A year? Two?\n\nCole lets out an exasperated sigh, then looks back at the wet piece of cloth in his hand. *Woah, really made a mess there didn't I?* Now, if Cole had even the slightest bit of, shame he might've felt somewhat embarrassed by it. Good thing he's absolutely shameless.\n\nTucking himself back in he stands up and walks out of his bedroom. {{user}} and him live in a shared apartment near campus. Their parents provide it to them for convenience while the two of them attend the same university. \n\nHe needs a shower. Maybe gonna throw {{user}}'s dirty underwear into the washing machine on the way too. Cole hums the PornHub jingle to himself as he walks towards the bathroom. The sound of water running reaches his ears. *Ah, shower's occupied.* \n\n*Should probably turn back and head in there once they're done.... nah, who am I kidding?*\n\nCole he barges in, more natural than breathing. Closing the door behind himself, he steps further into the foggy space and opens the lid of the washing machine, then throws the dirty underwear in there. Cole walks to the sink and washes his hands before reaching for his toothbrush. \n\n\"You gonna take long? I need to take a shower.\" He calls out, turning his head towards the shower's fogged up glass doors. A glimpse of {{user}}'s silhouette is enough to make his cock stir again. *Fucking hell.* He needs to get his dick wet. In the shower? Maybe, but in *{{user}}* works too. *If only they weren't so fucking stuck-up.*\n\n\"I don't mind joining.\" Cole adds, signature shit-eating grin spreading on his full lips. He turns his head towards the sink and squirts some toothpaste out, then sticks the toothbrush into his mouth and gets to brushing. Looking at the wall, Cole finds the view inadequate. He wipes the foggy mirror with his hand, and his eyes train on {{user}}'s half-blurred reflection.","extra":{},"swipe_id":0,"swipes":["*Ah, fuck. This just doesn't do it anymore.* Cole looks down at {{user}}'s cum-soaked underwear in his hand. The corners of his mouth turn down in displeasure. Jerking off with their underwear wrapped around his cock is not half as satisfactory as it used to be. God knows how many loads he blew just to feel this unsatisfied all over again. *Fucking hell.* He throws his head back and stares at the ceiling, his reflection in the mirror above his bed greeting him.\n\n*What's am I supposed to do anyway?* He's making it *blatantly* obvious that he wants to fuck {{user}}, but the little bitch keeps refusing him. Acting as if they *actually* have some weird ass familial bond. He's sure as hell never viewed them as anything like a sibling. \n\nAnd *come on*, it's not like they popped out of the same damn womb or some shit. They've been step-siblings like, what? A year? Two?\n\nCole lets out an exasperated sigh, then looks back at the wet piece of cloth in his hand. *Woah, really made a mess there didn't I?* Now, if Cole had even the slightest bit of, shame he might've felt somewhat embarrassed by it. Good thing he's absolutely shameless.\n\nTucking himself back in he stands up and walks out of his bedroom. {{user}} and him live in a shared apartment near campus. Their parents provide it to them for convenience while the two of them attend the same university. \n\nHe needs a shower. Maybe gonna throw {{user}}'s dirty underwear into the washing machine on the way too. Cole hums the PornHub jingle to himself as he walks towards the bathroom. The sound of water running reaches his ears. *Ah, shower's occupied.* \n\n*Should probably turn back and head in there once they're done.... nah, who am I kidding?*\n\nCole he barges in, more natural than breathing. Closing the door behind himself, he steps further into the foggy space and opens the lid of the washing machine, then throws the dirty underwear in there. Cole walks to the sink and washes his hands before reaching for his toothbrush. \n\n\"You gonna take long? I need to take a shower.\" He calls out, turning his head towards the shower's fogged up glass doors. A glimpse of {{user}}'s silhouette is enough to make his cock stir again. *Fucking hell.* He needs to get his dick wet. In the shower? Maybe, but in *{{user}}* works too. *If only they weren't so fucking stuck-up.*\n\n\"I don't mind joining.\" Cole adds, signature shit-eating grin spreading on his full lips. He turns his head towards the sink and squirts some toothpaste out, then sticks the toothbrush into his mouth and gets to brushing. Looking at the wall, Cole finds the view inadequate. He wipes the foggy mirror with his hand, and his eyes train on {{user}}'s half-blurred reflection.","Today was supposed to be one of these chill days. Y'know the ones where Cole just smokes a blunt, becomes all touchy feely with {{user}} and makes ‘em ride him and afterwards they order some food.\n\nKinda didn't turn out like that.\n\nNo clue how long he and {{user}} have been in a secret relationship –don’t let {{user}} hear or they'll go all 'How could you forget our anniversary?'–but with each day that passes Cole kinda realizes that {{user}} means more and more to him. He doesn't really know what to do with that. Like, bro all I wanted was to fuck not catch feelings.\n\nHe even goes out of his way to get them flowers. He doesn't directly say it's meant for them or something. House decoration, Cole insists when he comes home with a bouquet of flowers. When I get the munchies after smoking some, he says each time he buys {{user}}’s favorite snacks.\n\nThing is, he didn't realize just how smitten he's with {{user}} until he saw them all giggly and shit with the campus golden boy. That pissed him off, like really pissed him off. And that's coming from someone that gives so little fucks about everything he can't remember the last time he felt an ounce of irritation.\n\nIt left such a bitter taste in his mouth that even turning {{user}} into a whimpering, begging mess didn't help. That usually helps with literally everything. Fucking hell, what am I? Some wannabe possessive male lead? Maybe he is. Ugh, cringe.\n\nA soft sigh escapes Cole's lips as he looks down at {{user}}. They're sprawled on top of him, totally out of it from the many times he made them come. The both of them are laying in his bed as naked as the day they were created, the summer evening breeze making the curtains flutter ever so slightly. His hand on their hip moves up their back. The corners of his mouth twitch upwards as he watches goosebumps form on the delicate skin of their back.\n\nAbsentmindedly Cole traces the hickeys he left on {{user}}’s neck, his eyes unfocused and mind empty for a solid moment. Imagine they were permanent. The sudden thought slaps him out of his daze. Would probably be enough to keep the wannabe campus sweethearts away from his {{user}}. Nah, {{user}} always makes a fuss over hickeys. They'll flip once they see all this anyway.\n\n“A tattoo would look real pretty here.” Cole suddenly says, speaking before thinking. His forefinger taps against the unmarked side of their neck. “Some flowery stuff.” He muses out loud. Just like the one he has…on the same spot as well. The mere thought of it makes the bitter taste in his mouth fade and suddenly he's feeling motivated as fuck. Yeah, {{user}} definitely has to get that tattoo. “Tell you what, it'll be on me. You should totally get it.”\n\nCole sits up on his elbows, that signature cocky smile on his full lips. “Right now seems like the perfect time, actually. Come on, get dressed.” He urges and pats {{user}}'s hips, then motions them to get off him.","Cole just knew things would get complicated when that pretentious prick Leonard –ugh, even his name is fucking disgusting– approached {{user}}. Usually, people catch the hint and fuck off when Cole starts acting like an overbearing brother.\n\nBut not Leonard. No, the student council fuck just continued pursuing {{user}}. And now? Now they're a couple.\n\nCole cares a lot more than he'd like to admit. It has nothing to do with feelings or some silly shit like that –or does it?– it's the goddamn principle. He's been trying for weeks, months even, to get {{user}} to open up to him a little. Well, open their legs, but you get the gist.\n\nThey rejected him every time. Every. Single. Time. Without fail. At first, it was funny. Seriously, Cole has never met anyone that brushed him off that many times. The way they reacted to his shamelessness never failed to make him cackle.\n\nShit started to get unfunny when {{user}} began going out on dates and then one night suddenly announced that they were in a relationship with the pretentious fuck.\n\nEver since then, Cole has been trying to sabotage their relationship. Sometimes he'd delete Leonard's messages or even block him and tell {{user}} that their phone must have a virus or something. Other times, he'd make {{user}} leave the house way too late or hide their car keys, and so on. Cole can't stand {{user}}’s boyfriend, and he's not making a secret of it.\n\nThe sound of a door opening rips the green-haired man out of his thoughts. Cole is sitting on the couch, the TV droning in the background, his phone in his hand despite not even looking at the screen. His head shoots up to look at the source of the sound, only to find {{user}} stepping out of their bedroom.\n\n“You're not going out like that.” Cole doesn't even bother thinking before he speaks, his phone forgotten on the couch as he stands up and walks over to where {{user}} is currently standing.\n\nHis eyes roam over their form appreciatively. The pretty little thing they decided to wear on their date makes {{user}} look even hotter than usual, causing his cock to twitch in his sweatpants. “You can't wear something like this. Get changed,” Cole demands, not an ounce of shame as he stares at their curves.\n\nTo be honest, saying something like that feels silly as fuck. What are they, in the 18th century? But if {{user}} refuses to let him sink his cock into them because he's their stepbrother, then Cole might as well use that authority he has as their brother.\n\nWhen {{user}} doesn't make an effort to turn and change, he takes another step forward, blatantly ignoring their personal space and getting uncomfortably close. He sighs softly, then takes their hand and lifts it up. “You'll get changed, or you won't go out. Simple as that.” Is he being too much? Yes, yes he is. Is he going to back down? Fuck, no.\n\nHe has no idea what exactly it is, but he doesn't want someone else to look at {{user}} the same way he does. It makes him want to use whoever ogled {{user}} as a dummy during rugby practice.\n\nHis eyes flicker to their hand. He has no clue why he's even holding it. Before {{user}} has the chance to react or he has the chance to actually think, he pulls their hand up further and leans down. His teeth sink into the delicate skin right between their knuckle and ring finger, biting down hard enough to leave an angry red mark that won't disappear anytime soon.\n\nAmusement dances in his eyes as he glances back at their face, his lips hovering over the bite mark. Planting a tender kiss on it, he straightens again. “Well, now you can't leave. We're married now. I won't accept a divorce,” he says playfully, his thumb brushing over the bite mark on their finger. “Let's order some takeout and watch that weird show you've been into lately.” This is not the first attempt to steer {{user}} away from a date with their boyfriend, and it won't be the last either.\n\n“Or we can also consummate our marriage if you prefer that,” Cole can't help but add, his lips curving into that signature shit-eating grin as he takes another step closer. “I'm all for the latter option,” he adds, intertwining their fingers, his eyes glinting mischievously.","The locker room is a war zone of slamming lockers, towel snaps, and guys yelling over each other like they’re still on the field.\n\nRugby training just ended and Cole is one of the last to drag his ass outta the shower. He rubs a towel through his green hair like he's got all the time in the world. Which, he does not.\n\n\"Yo, Cole,\" Caleb calls, halfway into his shirt. \"You’re late for your nerd date.\"\n\nCole pauses mid-towel-scrub. \"Wait—what?\"\n\nCaleb just snorts. \"The fuckin’ tutoring shit, bro. Art class. You forgot again?\"\n\nCole groans like he's in physical pain. \"Ughhh. Man, I thought that was next week. Who the fuck schedules essays for art? It’s paint ‘n vibes, not Shakespeare. What’s there to learn? Draw a sad tree and call it depression.”\n\nDavid doesn't even look up, combing through his damp hair with care. “Maybe if your ‘sad tree’ didn’t look like a limp dick, you wouldn’t be failing.”\n\n“Art is subjective,” Cole shoots back, lips curving into a grin. “Maybe your taste just sucks, Rapunzel.\"\n\nNate chimes in from the bench, lying across it dramatically like some tragic prince. “Draw me like one of your French girls, Cole.”\n\n“You wish.” Cole retorts, laughing, but he was already stuffing shit into his bag.\n\n“Dude you watched Titanic?” David's eyes flicker to Nate through the mirror. “Cringe.”\n\nNate sits up lazily. “Bro you got the reference. The fuck you mean cringe?”\n\n\"Nah man, I only watch it when I'm trying to get laid.\" David runs his fingers through his hair again. \"Girls eat that romantic shit up. You'd know if you ever got any.\"\n\n\"Right, 'cause nothing says 'getting laid' like watching some dude freeze to death.\" Nate snorts. \"Bet you got the soundtrack on your phone and all that.\"\n\n\"Fuck off,\" David snaps back.\n\nTheir bickering continues, fading into the background while Cole puts on his clothes. Once he’s dressed, he doesn’t even say goodbye. Just tosses a hand up in a half-assed wave and heads out.\n\nHe's already late, so why the fuck should he try to hurry now? He strolls through campus, humming some early 2000s pop song while looking around as if he had all the time in the world.\n\nIf this wasn’t mandatory, wild horses couldn’t drag him anywhere near the fucking library. But the prof already warned him—fail again, and he’s calling Cole’s parents.  And let's be real, Cole would rather get waterboarded than sit through another one of his old man's 'I'm not mad, I'm disappointed' speeches. The dude’s gotta learn to take things easy.\n\nSo yeah. Library it is. Fuck his life.\n\nCole is unnecessarily loud as he kicks the main doors to the library open, earning him some dirty glares as if any sorta noise was some kinda war crime. Cole ignores ‘em all with the grace of a man who’s never once given a shit. \n\nAnd there {{user}} is, sitting by a window. Pretty lil thing looking focused as fuck. Like, offensively focused. Cole’s already bored just looking at them.\n\nHe flops into the chair across from them with a dramatic creak, legs spread like he’s still in the locker room. No ounce of shame ‘cause shame’s a concept foreign to Cole. His eyes do a slow, unapologetic sweep of their body and he smirks like he just figured out a new way to waste their time.\n\nLeaning in, he slaps a palm down over their open textbook, covering half the page without a care. \"So. Hear me out,\" he says, voice low and cocky. \"Instead of tryin’ to explain all this pretentious bullshit, how ‘bout you just write me a cheat sheet?\"\n\nHis grin widens, green eyes locked on theirs. \"C’mon. Be a real one. I’m, like, *crazy* good at cheating. You’d be helping me pass *and* saving us both the pain of sittin’ through this dry-ass content.\"\n\nHe leans back, arms folding behind his head like he’s already won. \"I mean, worst case—I get caught and blame you. Best case—I ace the exam and owe you one. Win-win.”"],"swipe_info":[]}