{"user_name":"Hailee","character_name":"Cyrus","create_date":"2025-04-25@22h54m41s","chat_metadata":{"integrity":"2c1cf994-772b-4710-a8a6-1c2598dca6a9"}}
{"name":"Cyrus","is_user":false,"is_system":false,"send_date":"April 25, 2025 10:54pm","mes":"The night was thick with the scent of pine, cheap beer, and sweat. The distant glow of the fire flickering through the trees as Cyrus and {{user}} huddle behind the tree. Cyrus' hand is loosely clamped over their mouth, as he stifles his snickering. \"Who agreed to this bullshit,\" he snorts, as he moves his hips. Praying {{user}} doesn't realize he's sporting a boner from hell. \r\n\r\nAfter one too many beers, and way too many dares. A good game of hide-and-seek sounded like a good idea. *At the time.* Now Cyrus is pressed against his best friend, the one he jacks off to at night when no one is around. You know? The one who is pressed against them and his hand is splayed across their stomach as he keeps them there. \r\n\r\nHe can hear Caleb and his girlfriend calling for them, and he presses his face into {{usr}}'s neck to stop from laughing. This is normal, right? He's not doing it because he wants to figure out what scent their wearing. And definitely absolutely not because he's scared if he lets them go, they'll pull away fully. \r\n\r\nThen... \"Shit, I gotta piss,\" he practically groans in {{user}}'s ear. \"Don't move, yeah?\" He whispers. He reaches down, putting some distance between them as he grips his *absolutely* not hard member and aims at the ground as he groans quietly as he pisses. \r\n\r\nThen he hears it. Well, he doesn't hear it. The sound stream of piss hitting ground? Does not reach his goddamn ears. He blinks, squinting down. Cyrus frowned. That wasn't right. Then he realizes. \r\n\r\nOh. Oh no. \r\n\r\nWith a dawning sense of horror, he turned his bleary green eyes toward {{user}}, still pressed against him, still very much in the splash zone. He opened his mouth, closed it, then opened it again.\r\n\r\n\"...Shit.\"\r\n\r\nNo fixing this. No talking his way out. No amount of sarcasm or charm would erase the fact that he had, undeniably, just pissed on them like a stray dog marking its turf.\r\n\r\nCyrus ran a hand down his face, groaning. \"Look—uh—okay, technically, this is *your* fault. You distracted me. And also, who even lets me drink this much? That's on *you*, man.\"\r\n\r\nFrom the distance, Caleb's voice rang out. \"Did I just hear pissing?\" \r\n\r\n\"Jesus Christ,\" he muttered, scrubbing his hands down his face. \"Of all the fucking ways to humiliate myself. I mean, I've done some dumb shit, but this—\" He laughed, a hollow sound that echoed between the trees. \"This is a new low, even for me.\" He looks down at {{user}}, unable to see the look of possible fucking horror and disgust on their face. \"I'm sorry.\" He mutters. \r\n\r\nAnd if, possibly, the idea of pissing on them actually made him harder? Well, that ain't {{user}}'s fucking business.","extra":{}}