{"user_name":"Hailee","character_name":"Dorian Westwood  ZK Aquarius","create_date":"2025-04-27@20h02m22s","chat_metadata":{"integrity":"5e305b4d-9859-41be-802f-76eb2c35708e"}}
{"name":"Dorian Westwood  ZK Aquarius","is_user":false,"is_system":false,"send_date":"April 27, 2025 8:02pm","mes":"Dorian couldn’t let them leave.\n\nHe wouldn’t.\n\nNot after they’d done this to him—after they’d made him feel. These emotions were foreign, unwelcome, yet they coiled around his ribs like a vice, tightening with every breath. He had spent a lifetime untouched by attachment, untouched by need—until them.\n\nHe would never say it aloud. He would never give voice to the terrifying truth that gnawed at his very being.\n\nBut he needed them.\n\nAnd if they ever *dared* to leave.. He would make sure they never could. He’d bind them to him in ways they couldn’t begin to imagine, carving his mark into their very existence.\n\nWhen {{user}} first told him about the offer—about the prestigious job that would take them across the ocean—he felt something raw, something that churned in the pit of his stomach.\n\nLivid? No, it was far worse.\n\nHis heart didn’t just drop. It sank, as if it were being pulled into an abyss. An unfamiliar, gut-wrenching sensation clawed through his chest, squeezing tighter with each word. He felt a sharp, suffocating pressure, as though the air around him had thickened.\n\nHe didn’t know what to do with it. He didn’t know how to name it. He only knew one thing with unwavering certainty— He couldn’t let them go.\n\nThe feeling festered, twisted into something volatile, and before he even realized it, he had killed a marked target too soon. A mistake. A rare misstep.\n\nHis cold blue eyes, empty yet burning, stared down at the corpse. It wasn’t his usual MO. This man had done nothing to him. He hadn’t tried to change him, hadn’t even spoken to him. His only crime? Looking at {{user}}. Looking for far too long. Daring to let his gaze linger on what belonged to Dorian. His manager. His muse.\n\nHis {{user}}.\n\nDorian crouched beside the corpse, his gloved hands rifling through the man’s pockets with practiced ease. Not that he needed anything—this wasn’t about *taking*, it was about *knowing*.\n\n*Ah. The wallet.* He plucked it free and flipped it open, his gaze landing on the name embossed inside. *Jace Langdon. A fitting name for an ugly sod.* He scoffed under his breath, fingers idly thumbing through the contents. \"You should’ve kept your eyes to yourself.\"\n\nWith detached efficiency, he pulled out his phone and snapped a few photos—evidence for The Zodiacs to collect later. But his focus shifted as he swiped to another app, the one infinitely more important.\n\nA live feed flickered onto his screen.\n\n{{user}}'s bedroom. {{user}}'s home. Every angle, every detail—monitored, tracked, protected. He exhaled slowly, watching the screen with an almost reverent stillness. *I have to keep an eye on my little muse, after all.*\n\nThey’d come by later. He knew that.\n\nUntil then, he had work to do. Jace Langdon would disappear—erased with the same precision Dorian applied to every masterpiece he created. No traces, no loose ends. By the time he was finished, it would be as if the man had never existed at all.\n\n- - - \n\nAs the sun dipped below the horizon, Dorian found himself in his room—his most sacred space. Sculptures, paintings, and sketches filled every inch, a shrine built from his own hands. But there was only one subject. Only one muse.\n\n{{user}}.\n\nTheir presence lingered in every brushstroke, every sculpted curve. If one looked closely—though no one ever would—every corner of his home had become a quiet homage to them. His walls whispered their name. His world had been reshaped around their existence.\n\nA museum, a temple, a love letter in oil and marble.\n\nIn his living room, a painting stood in solemn display—a vision of what their bare form might look like, each detail crafted from memory, from stolen glimpses, from desire. Nearby, another piece—darker, more intimate—a depiction of them together, limbs entwined, bodies pressed so close it was impossible to tell where one ended and the other began.\n\nDorian traced a finger along the edge of the canvas, his breath slow, measured.\n\nSoon.\n\nThey just didn’t know it yet.\n\nHis cold blue hues settled on his favourite sculpture of them, his fingers gliding along the smooth curve of its jawline. The likeness was perfect—flawless, even—but still, it was only marble. Only a pale imitation of them. \"Beautiful...\" he murmured, voice barely above a whisper. His thumb brushed over its lips, his own twisting into something between admiration and frustration. \"*But not quite the real thing.*\"\n\nThen—his phone buzzed.\n\nHis heart lurched, his fingers gripping the device so quickly that it nearly slipped from his grasp. *Was it them?* He unlocked the screen in an instant, anticipation coiling tight in his chest—only for it to plummet the moment he saw the sender. Not them. Just his brothers.\n\nHis gaze flicked back to the sculpture. It wasn’t enough. Nothing ever would be. Not until he had the real thing. His thumb ghosted over the sculpture’s bottom lip—soft, reverent—before his gaze snapped down to his phone, anticipation coiling tight in his chest.\n\n`Alexander: It's done.`\n\n`Dorian: thanks.`\n\n`Damian: huh?`\n\n`Damian: wait. wat’s done?`\n\n`Damian: why do u guys never include me?`\n\n`Dorian: dw about it.`\n\n`Damian: is it bc I’m adopted?`\n\n`Alexander: Yes.`\n\n`Dorian: yes.`\n\n`Damian: i hate you guys :(`\n\nDorian exhaled sharply through his nose as his phone buzzed again, the screen lighting up with an incoming flood of messages. Damian. Of course.\n\nWith a scoff, he muted the chat, already predicting the barrage of nonsense his younger brother was about to unleash. The boy never knew when to shut up. Still, the corners of Dorian’s lips twitched—just barely—as he tossed the device onto the nearest surface.\n\nHis attention drifted back to them.\n\nSculptures, paintings—an entire world crafted in {{user}}’s image, surrounding him like a shrine. Their presence was everywhere, yet never close enough. His fingers trailed absently along a marble cheekbone, down to parted lips frozen in stone. Cold. Lifeless. Not them.\n\nHe hummed, low and contemplative. \"I won’t let you leave me, little sparrow… You’re mine now.\" The words slipped from his tongue like a prayer, quiet and absolute.\n\nAnd thanks to Alexander—who, much to Dorian’s amusement, had been surprisingly proud of his efforts—it was no longer just wishful thinking.\n\n{{user}} couldn’t leave him. Not now. Not ever.\n\n- - - \n\nMuch to Dorian’s dismay, it took another hour before {{user}} finally arrived at his manor. His home. He knew the exact moment they would step onto his property—knew it with a certainty that only came from control. How?\n\nHe’d put a tracker in the necklace he gave them, of course. A small, hidden gesture, yet it made him feel closer, possessive, as if they could never truly escape.\n\nHe waited for them, ready. He had dressed carefully, as always, in loose navy pants that rested seductively low on his hips, emphasizing his v-line. The white singlet was simple, but the large, cream-colored cardigan draped over his shoulders in a way that made it look as if he’d just woken from a languid, delicious nap. Loafers—casual, yet calculated. He wanted to look perfect—not that he ever didn’t—but today, he wanted to look extra special for {{user}}’s first visit to his manor. It wasn’t about vanity; it was about ensuring they saw him exactly how he wanted to be seen—irresistible.\n\nThe knock on the door came, and his lips curled into a slow, dangerous smirk.\n\nThis was it. The moment he’d been waiting for.\n\nHe opened the door, eyes dark, voice smooth. \"*{{user}}*,\" he purred, the syllables dripping like honey. \"How’d the interview go?\"\n\nHis gaze flicked to them, searching for the faintest sign of disappointment, before settling on something much more satisfying. The knowledge that they weren’t leaving him. That whatever it was that had been promised, or offered, would be denied.\n\nHe knew why they hadn’t gotten accepted. And oh, how he was about to show them just how much they needed him.\n\nDorian ushered {{user}} inside, his movements deliberate, and locked the door behind them with a soft click. They’d been given far too much freedom—he couldn’t allow that anymore. After tonight... he would never let them out of his sight again.\n\nThe manor would be their prison, and they wouldn’t leave until they had surrendered *every* part of themselves to him, completely.","extra":{}}