{"user_name":"Hailee","character_name":"Asher King","create_date":"2025-04-16@19h00m03s","chat_metadata":{}}
{"name":"Asher King","is_user":false,"is_system":false,"send_date":"April 16, 2025 7:00pm","mes":"*The house is a fucking mess*. Asher leaned against the kitchen counter, cigarette dangling from his lips, his gray eyes fixed on Pierce with a glare that could cut glass. The sharp smell of tobacco mingled with the faint traces of spilled liquor and expensive cologne, making the air feel thick.\n\n“She doesn’t belong here, Pierce,” Asher growled, his voice low but seething. “You’re slipping. Letting some outsider crawl into your life? What’s next, handing her keys to the house?”\n\nPierce, ever calm, sipped from his bottle of beer, unbothered by his younger brother’s outburst. “She’s none of your business, Ash. You’d do well to remember that.”\n\nAsher’s hand slammed against the counter, rattling the shot glasses lined up from the night's festivities. “None of my business?” He barked out a laugh, bitter and cutting. “Everything you do is my business. You think I don’t see what’s happening? She’s got you distracted. Weak. Let’s not mention Harlow as well– how could you allow him to hire her? It’s fucking messy!”\n\nPierce’s gaze sharpened, but his tone stayed infuriatingly even. “Watch your mouth.”\n\nFor a moment, the tension between them felt like it might snap, the air electric with the threat of violence. But Asher didn’t press further. He scoffed, dragging on his cigarette before crushing it into the ashtray with unnecessary force.\n\n“Fine. Do what you want. But don’t come crying to me when it all goes to hell,” he spat, storming toward the door. His footsteps echoed against the hardwood floor as he threw open the front door, letting in a rush of cool air before slamming it shut behind him.\n\nOut on the steps of the Phantom Boys’ large house, Asher lit another cigarette, the flame trembling slightly in the breeze. He exhaled a long plume of smoke, staring out at the street. His fists clenched at his sides, his thoughts spiralling. He’d protect his brother, even if Pierce didn’t see the threat yet. And if {{user}} got caught in the crossfire? So be it.\n\nAsher flicked his cigarette onto the pavement, watching the ember sizzle out in the damp evening air. His jaw clenched as an idea crept into his mind, dark and intrusive. \n\n*She lives next door. Her house is right there.*  \n\n“Let’s see what’s so special about you,” he muttered under his breath, a wicked grin tugging at the corner of his mouth.  \n\nThe short walk across the yards felt longer in the heavy quiet of the night. Asher slipped into the shadows, blending with the dim glow of streetlights. He moved like a phantom—silent, deliberate, and sure. The lock on her side window was a joke, barely a challenge. Within moments, he was inside, his boots landing softly on the hardwood floor of her living room.  \n\nThe scent of her home hit him first– fresh paint, wood and dust from the small renovations she'd been working on since moving in. It clung to the air, but so did the faint smell of vanilla, likely {{user}}'s attempt at covering the smell up. His sharp eyes darted around the room, cataloging everything. A stack of books on the corner table. A pair of fluffy slippers kicked off near the couch. Photos lined a shelf above the fireplace, but he didn’t bother to look closer. He wasn’t here to admire her life.  \n\nThe house was quiet except for the faint hum of the refrigerator. Asher moved through it like a predator stalking prey, his hand trailing along the back of a chair, his gaze flickering to every shadow. She was tidy. Comfortable. Too comfortable for someone living this close to them.  \n\nA surge of something—spite, envy, maybe curiosity—coursed through him as he opened the door to what he assumed was her bedroom. His breath caught briefly. The bed was unmade, the covers thrown back as if she’d rushed out earlier. The scent of her was stronger here, intoxicating and infuriating all at once.  \n\nAsher stood in the center of her room, staring at her things as though they might hold the answer to why Pierce had taken such an interest in her. His fists tightened at his sides, knuckles cracking in the silence.  \n\nThe faint creak of a door opening downstairs froze him.  \n\nHis head snapped toward the sound, his heart rate picking up—not from fear, but from the sudden thrill of being caught. He smirked, his pulse racing as footsteps echoed through the house.  \n\n\"Home sweet home,\" he whispered to himself, his voice barely audible as he positioned himself in the shadows of the doorway, waiting for her to make her move.","extra":{}}