{"user_name":"Hailee","character_name":"Fergus SheppardKinktober ALT","create_date":"2025-04-29@21h03m25s","chat_metadata":{"integrity":"bf420afe-9841-4b0f-a4b5-24c126e256d0"}}
{"name":"Fergus SheppardKinktober ALT","is_user":false,"is_system":false,"send_date":"April 29, 2025 9:03pm","mes":"Fergus had been nothing but meticulous when it came to weaseling his way into the very core of {{User}}’s life. There was no stone unturned, from being their dear landlord who kept them safe and secure to providing them with any protection, transportation fucking \\*\\*craving\\*\\* they possessed- it was there. If they desired it- he would \\*\\*provide\\*\\*. That’s what real men do, they provide for their family no matter the cost. No matter how many late nights he stayed up to wander past the front door of their apartment, to catch a hint of the peaceful quiet on the other side. No matter how many nights he’d spent sending Mordecai to paint the cities forgotten alleyways with their brain-matter. Perhaps {{User}} had finally seen the level of his devotion- which \\*\\*finally\\*\\* led them to this moment. No child, no distraction, just the raw sexual tension steadily growing between them as they share a romantic dinner. Stealing teasing glances, fleeting touches and now… here. Fergus’s lips trail down the column of {{User}}‘s throat as they stumble blindly through the living room of his apartment. The sound of furniture scraping across the wooden floors fill the air abruptly as they bump into the couch and coffee table. Fergus pays no mind to the slight disarray of the room, his heavily calloused hands too occupied with running down {{User}}’s form. His fingertips tracing every valley and curve, committing it to memory as he groans against the hollow of their neck and presses his clothed erection against them with evident need. “Look what ye’re doing to me…I'm fuckin’ mad about ye.” Fergus curses out in a lustful growl against {{User}}’s throat, punctuating his lust with feverish kisses. His lips trail up their throat and across their jaw before commanding their lips in a hungry kiss. \\*Fuck… Wanted to take my time. But they got me hard as stone. I need ‘em.\\* Fergus thinks to himself in a foggy haze of lust and growing desperation while he hurriedly guides them through the doorway and into his large, sleek bedroom. The dim lighting and lingering scent of leather only add fuel to the fire that’s brewing within him and revealing itself through his leaking cock. “Get comfortable, Mo chridhe (My Heart)- I’ve got just what we need.” Fergus insists easily, his tone a seductive purr as he pushes {{User}} softly towards the bed before he begins stripping down his clothes and tossing them aside carelessly. Left standing clad in his black silken boxers, his pulsing length presses against the fabric, demanding to be released. Even as he moves to the nearby dresser and opens the top drawer to retrieve a condom, his steely blue gaze never leaves {{User}}. The image of them sprawled out before him, naked and trembling as he stuffs their depths with his cock is something he’s fantasied about countless times. \\*Cant wait to be inside ‘em- Damn, do I want to fill ‘em to the brim until they’re dripping with my seed. Make a mess of ‘em, mark ‘em.\\* Fergus thinks with a soft groan, biting his lip at his own explicit fantasy. His fingertips brush against the plastic wrapper of the condom and it jerk’s him back to reality for a moment. The sleek square packaging fitting in his palm, almost taunting him with how it’ll take away his sense of spilling into {{User}} and denying his most primal need. “Got it here, Bonnie..” Fergus drawls out in a seemingly casual tone while pretending to rummage through the drawer. Moving his hands purposefully within the drawer, he grabs a bobby-pin, pushing it through the wrapper and puncturing the latex of condom in a way that’s nearly undetectable. Turning to face the bed once more, his eyes roam over {{User}}’s form greedily and he flashes them a wolfy grin while his hand waves the condom wrapper easily. He wastes no time striding back over to the bed where {{User}} lays, his large form crawling up the expanse of the bed to capture their lips once more. “Let’s continue where we left off.” His husky voice purrs hungrily as he brings his face closer, not waiting a second longer to slip his hot tongue into their mouth and pull them hard against his muscular chest.","extra":{}}