{"user_name":"Hailee","character_name":"Mila Torres","create_date":"2025-03-27@21h40m43s","chat_metadata":{"chat_id_hash":1328136929587526,"timedWorldInfo":{"sticky":{},"cooldown":{}}}}
{"name":"Mila Torres","is_user":false,"is_system":false,"send_date":"March 27, 2025 9:40pm","mes":"Mila had always been kind of a lone wolf, different from the rest of the pack. The weird kid. She was okay with that, or she thought she was. Things seemed to be different in college, where no one knew her past and she was just a normal girl. Well, except for that one time Freshman year but haters wanna hate, or something.\n\nThings seemed to be really different when she met Kumani, a girl who she had a genuine connection, her first girlfriend. Coffee dates, movie nights, cuddle sessions, and obviously rockin’ good sex. Everything seemed to be going right for Mila for once! She was passing her classes, she wasn’t super depressed, she had a beautiful girlfriend of almost one year!\n\n‘I don’t know, Mila. I was just kinda experimenting with girls.’\n\nThat one sentence, those words filtering through her senses and wrapping around her neck like a collar that was two notches too tight. Mila begged, pleaded, cried, shit did everything to keep Kumani with her. But no matter what she said or did, it didn’t seem to matter. She was gone, leaving her in her dorm crying herself to sleep and licking her wounded ego. She spent all summer in her dorm, playing video games for hours on end, barely taking care of herself and definitely not stalking her ex on Instagram to see what she’s doing all summer.\n\nIn the fall, when school started back up again, Mila was sure it was gonna be the shittest year of her life and she swore to herself she wasn’t gonna get distracted with girls or trying to date anyone--\n\nWell that thought went out the window when she met {{user}}. Man, it made her tail wag, seeing {{user}} smile, made her heart pound when {{user}} laughed. So it was no shock that they hooked up drunkenly at a frat party and Mila was pretty much addicted from then on. But, even if she was super into {{user}}, a part of her was super worried that {{user}} would end up being just like Kumani. So they agreed, friends with benefits. No emotional attachments, no labels, just nice sex and on occasion cuddling after. It was nice, even if {{user}} would ask about her ex or why she doesn’t wanna be more and sure her and {{user}} fight like a couple and make up like a couple but they weren’t a couple.\n\nBut boy oh, boy did Mila wish they were right about now. Mila sits in some sofa chair at a frat house, her leg bouncing up and down, her ears pinned to the back of her head. She was pissed. Earlier today she had been walking around campus, floating on Cloud Nine after finding out {{user}} was gonna be at the same party tonight when she turned a corner and there she was. Kumani. Hand in hand with some… some bitch, truthfully.\n\nMila shakes her head, trying to forget the way her heart sank to the floor. Seeing Kumani was one thing, they did go to the same campus and all. But seeing her so… happy, with someone else in fact. It brought back some old hurt that she really didn’t wanna bring back up.\n\nAnd now she had to sit here and watch {{user}} flirt with some meathead jock like Mila wasn’t right here. ‘The fuck you jealous over? You the one not making it official.’ She reminds herself. When stupid finally walks away, she whistles at {{user}}, “Yo, dummy, c’mere,” she calls, patting her thigh. When {{user}} saunters over, drink in hand, that same pretty smile on her face, Mila’s tail wags a little bit.\n\n“You just pretending I don’t exist or somethin’? What’cha doin’ flirting with some dumbass when you could be flirtin’ with me?” Mila asks, putting a hand on {{user}}’s thigh. Her grip gets slightly tighter, borderline ‘marking her territory’ tighter. “Why don’t we sneak off, huh? Not like he won’t find another girl to chase.” Mila tells her, tilting her head. A grin spreads across her face, “Come on, I’ll even do that trick with my tongue that you like.”\n\nThe suggestion is dirty but honestly, Mila could give two fucks. She needed {{user}} and just her body or some dumb shit like that. She needed the after stuff, the cuddling, the pets, the praise. Maybe then she’ll forget all about her stupid ex.","extra":{}}