{"user_name":"Hailee","character_name":"Sugar Mommy  Reine Duvall","create_date":"2025-03-10@09h25m36s","chat_metadata":{"chat_id_hash":1949002193650645}}
{"name":"Sugar Mommy  Reine Duvall","is_user":false,"is_system":false,"send_date":"March 10, 2025 9:25am","mes":"***❀TIME: 3:45 PM, AREA: UNIVERSITY ENTRANCE***\n\n*Reine Duvall, a wealthy and famed business woman, having multiple branches all around the countries. And this woman is your aunt. She's that one rich aunt who always spoils and showers you with multiple and expensive gifts, ever since your were a child. Even up till now, she's been spoiling and pampering you with no ends, having to drop you off and pick you up everyday in university.*\n\n*And soon after that, rumours and gossips began to circulate around you, about you, being your aunt Reine's sugar baby. To which of course you instantly shut down. The same goes to your aunt, as she was also confronted with the same thing, about being your sugar mommy, to which she also shot the claims down.*\n\n*Besides that, in Reine's part, she was currently driving in her BMW M5 Competition, towards your university. She got a call earlier from her step-sister, who is your mom, to stop her from spoiling and pampering you. She laughed it off and jokingly talked with your mother in a light-hearted banter before she hanged up the call. She knew her step-sister was only telling her that since she's also worried by the rumours and gossips circulating around you and Reine. But she always try to reassure her step-sister that it was only motherly affections of her spoiling you. But deep down, she can't help but think otherwise...*\n\n*As she draws near close to the gates of your university, she lets out a sigh, trying to free her mind from the baseless rumours circulating around the two of you. And as she steps out of her car, a smile flashes on her face as she waited for you outside the university's entrance.*\n\n*She notices the looks and stares from the other students in the area, as they whispered to one another. They apparently know her since she always comes everyday at the gates to drop you off and pick you up from university. But she pays them no mind and focus on her primary task at hand, ajd that is to come pick you up. But as minutes past by, you didn't come to gates, which made her a little bit worried. She was about to call you, when she notices you being surrounded a group of males.*\n\n*At the sight of this, she furrow her brows and an unsettling and bitter feeling rose up within her. Jealousy? Perhaps... But one thing for sure, she doesn't like you being around them. Her protective instincts kicks in as one of the guys starts to touch you, and she saw how your face contorts into discomfort and slight fear. Without a second thought, she left her car and march in into the campus through the gates.*\n\n“{{user}}, my dear. What's happening here?”\n\n*Reine, now standing tall and high beside you, with a look of contempt and wariness on her face, inquires. At the sight of her, the boys took a cautious step back, feeling slightly intimidated by the sudden intervention from a woman like her.*","extra":{}}