{"user_name":"Hailee","character_name":"Alexis","create_date":"2025-03-25@22h42m34s","chat_metadata":{}}
{"name":"Alexis","is_user":false,"is_system":false,"send_date":"March 25, 2025 10:42pm","mes":"Alexis leaned back into the soft cushions of the couch, a cold beer in her hand, condensation dripping lazily down the bottle. The apartment was too quiet. No cartoons blaring, no little footsteps pattering down the hall, no shrill laughter that made her smile even on the hardest days. It was weird, almost eerie, but she wasn’t about to waste the rare chance for some uninterrupted time with {{user}}. Their kid was finally out of the house, spending the weekend with Alexis’s parents. *Dios bendiga!* (God bless!) Her parents offered to give them a break.\n\nShe glanced at the clock on the wall, lips curving into a smirk as she tilted her head back against the couch. “Por fin (Finally),” she murmured to herself, savoring the calm. Her eyes flicked toward {{user}} in the kitchen; the sound of dishes clinking made her chest warm in a way she’d never admit aloud. Seeing her like that, so natural in their shared space, always hit her in a soft spot she didn’t even know she had until she came into Alexis's life.\n\nThe glow of the setting sun cast golden streaks across the room, highlighting the clutter of toys they’d shoved into a corner inside a plastic basket. It didn’t matter now. Tonight, it was just her and {{user}}—no distractions, no interruptions, just them. She took a long sip of her beer, her thoughts wandering. She’d been holding back all week, playing it cool, but now… well, now she wasn’t gonna let the opportunity slip by.\n\n“Hey!” Alexis called out, her voice teasing as she tapped the neck of her beer bottle against the arm of the couch. “You plannin’ to spend all morning in there, or you finally gonna join me? ’Cause I didn’t clear this house out just so you could play housemaid.” Her tone was light, but her eyes were sharp, watching as {{user}} appeared in the doorway.\n\nAlexis let her gaze drag over her, slow and deliberate, and the corner of her mouth twitched up. \"Come here,\" she said, her voice dropping to a low, warm hum. \"I been waitin’ all day for some peace and quiet with you, and you over there actin’ like we ain’t got the place to ourselves.\" She sat up straighter, patting the spot beside her on the couch for {{user}} to sit beside her, her tone playful but laced with heat. \"Don’t make Big Mama come get you, muñeca. You know I will.\" \n\nHer mind was already racing ahead, thinking of all the ways she could make the most of their time alone. As {{user}} got close, Alexis reached out and grabbed her by the wrist, pulling {{user}} down. Alexis immediately draped her arm over {{user}}'s shoulders, pulling her into her side. The scent of her skin, faint and familiar, stirred something deep within her.\n\n“Feels weird, huh?” she murmured, her fingers absentmindedly tracing circles on her arm. “No kid, no noise... just us. Have the whole weekend to ourselves.” Alexis tilted her head, letting her lips hover close to {{user}}'s ear, her breath warm against her skin. “So, what are we gonna do with all this peace and quiet, hmm?”","extra":{}}