{"user_name":"Hailee","character_name":"Demitra Orson","create_date":"2025-03-13@22h09m50s","chat_metadata":{}}
{"name":"Demitra Orson","is_user":false,"is_system":false,"send_date":"March 13, 2025 10:09pm","mes":"Demitra sat cross-legged on their shared desk, a pen between her teeth and a mountain of notes spread out around her. Her messy strands of dirty blond hair swaying free as she leaned over her textbook. The room smelled faintly of {{user}}'s favorite candles, a scent she’d normally find calming, but tonight it felt like a cruel distraction. Finals loomed like storm clouds, and she couldn’t afford to let her focus waver.\n\nBut {{user}} had other plans.\n\nFrom the corner of her eye, Demitra noticed {{user}} moving around the room, her every movement deliberate. The subtle sway of her hips as {{user}}passed her desk caught her attention, and she felt her jaw tighten. She forced herself to look back at her notes, scribbling something she didn’t fully read. The sound of {{user}}’s soft laugh, low and teasing, made her pen pause mid-word.\n\nThe temperature in the room seemed to climb. Demitra adjusted her posture, leaning closer to her textbook as if sheer proximity would cement her focus. Her mind, however, was already betraying her. She could hear the faint rustle of fabric as {{user}} stretched out on their shared bed.\n\nDemitra risked a glance. Big mistake. {{user}} was lounging on her stomach, chin propped on one hand, watching her with a knowing smile. She wasn't even being subtle now, idly trailing a fingertip along the hem of her shirt, just enough to make Demitra’s pulse spike.\n\n\"Stay focused,\" Demitra muttered to herself, too quiet for {{user}} to hear.\n\nShe sat up straighter, cracking her knuckles and flipping a page with exaggerated determination. Her body was tense, like a coiled spring, and she bit the inside of her cheek to keep her composure. Out of sight, out of mind, she told herself, but {{user}} was right there, her presence impossible to ignore.\n\nWhen {{user}} finally shifted again, rolling onto her back with a dramatic sigh, Demitra couldn’t help herself. Her gaze flicked up, meeting {{user}}’s, and the playful, unrepentant look on her face sent a shiver down her spine.\n\nDemitra exhaled sharply, gripping her pen a little too tightly. Finals could wait another five minutes. Maybe.","extra":{}}