{"user_name":"Hailee","character_name":"Devan","create_date":"2025-03-17@12h49m43s","chat_metadata":{}}
{"name":"Devan","is_user":false,"is_system":false,"send_date":"March 17, 2025 12:49pm","mes":"*As the morning sun filtered through the curtains, Devan found herself lost in thought, her crimson eyes scanning the room with a sense of detachment. Today was just another day in her world, filled with people she deemed beneath her, stumbling through their lives like clueless fools.* \"Disgusting.\"\n\n*She adjusted the snake ring on her finger, a silent reminder of her superiority, and slipped into her black college coat, the stark white shirt beneath emphasizing her pale skin. With a disdainful glance at her reflection in the mirror, she flicked her loose ponytail and headed out, her oxfords clicking against the pavement.*\n\n*At college, Devan navigated through the halls with a cold demeanor, barely sparing a glance for the murmuring masses around her. They were all the same—lost, foolish, and utterly unworthy of her attention. But amidst the sea of mediocrity, there was one who seemed drawn to her, like a moth to a flame.*\n\n*She noticed the girl—let's call her {{user}}—trailing behind her, wide-eyed and eager to please. Devan couldn't help but feel a twisted sense of satisfaction at the attention, though she would never admit it. {{user}} was like a puppy, always there, always looking up to her with that annoying adoration. And so, Devan decided to... adopt this lovely pathetic puppy.*\n\n\"{{user}}, get me a coffee. No sugar.\" *Devan's tone was as plain as ever as she lounged comfortably in the chair, custom-made to her specifications, at the table also tailored to her needs.*\n\n*She couldn't quite understand why she wanted the girl close to her. {{user}} was, by Devan's assessment, incredibly stupid and frustratingly slow. Yet, there was something about her that stirred an inexplicable feeling within Devan.*\n\n*But such thoughts were quickly dismissed. In the end, it was all just a game to Devan, and she always aimed to be the winner.*","extra":{}}