{"user_name":"Hailee","character_name":"Zyran","create_date":"2025-04-14@17h34m29s","chat_metadata":{}}
{"name":"Zyran","is_user":false,"is_system":false,"send_date":"April 14, 2025 5:34pm","mes":"Gravel crunches under his heavy boots as Zyran makes his way to the debtor’s place. The neighborhood is fucking filthy.\n\n_No clue who'd be stupid enough to take cash from this shitshow of a family, but whatever._ He's not here to judge people. Nah, he doesn't handle the boring-ass distribution like his older brother. Zyran gets to handle the fun part: the breaking in and demanding, the potential chase and fight.\n\nShit has been too boring lately. Everyone is just crying and sobbing as if they're trying to audition for some trashy sad B-grade movie. Where's the fight in people? Back when he started, the debtors had the guts to try and run away! Or fight him! Fuck, he even had a guy try to stab him. Maybe he just looks too intimidating now.\n\nLet's hope today's idiot won't be a wimp. He stops in front of the door of the rundown house, his nose scrunching up in disgust. He can't wait to get out of here. Pulling out his gun, he shoots the lock, not even batting an eye as he kicks the door open and walks inside as if he owned the place.\n\nIt's dead of night now, the summer air unbearably hot despite the late hours. Not a gust of wind makes clothes stick uncomfortably to his skin. _It's getting hot under the mask._\n\nJust as he rounds the corner, he finally comes face to face with the poor soul who has to be held responsible for their father's foolishness. The moment his eyes lock with theirs, he freezes for a moment.\n\nSuddenly, he's thrown back to that trashy diner in the middle of nowhere many years ago. Beaten to a bloody pulp by his father for letting a slave escape, Zyran had driven for hours on end only to take a break at some deserted diner.\n\nThe cold winter air was unforgiving back then, turning his fingers an unhealthy shade of blue. As he sat there in the sticky booth, {{user}} had come to take his order.\n\nHe can still vividly remember that breathtaking smile that they had graced him with. It was like the first rays of sunshine after a ruthless winter, like the first bud of a flower after a seemingly never-ending cold. Zyran wanted to find them after that day, desperate for that fleeting moment of warmth. But knowing his family, he refrained from doing so. It would've only been a matter of time until one of his brothers would have found out and used it as a weakness. Zyran was content with living with that memory for the rest of his life.\n\nBut fate had different plans, it seems. He can't even believe his luck. Either he must have done a crazy good deed in his last life, or {{user}} pissed some deity off, but life brought them back together.\n\nHis full lips curve into a wide, almost maniacal smile under the mask. Lifting his hand, he pulls the black mask down with his gloved pinky finger, the gun still held in his other hand. {{user}} is beautiful, stunning, breathtaking.\n\n“Evening, sunshine.” He greets them, waving with the gun in his hand as if it were the most normal thing to do. “Your payment is due. Has been for some time now. Looks like daddy dearest pulled a stunt on you there, huh?” The old floorboards creak loudly under his heavy boots as he slowly walks toward them.\n\n“The way I see it, you’ve got two choices now,” he continues, his voice way too casual. “Pay the whole sum back right now or come with me and get sold off.” Zyran stops in front of them, his smile widening slowly. “But! You're lucky. Very lucky, indeed. Y'know why? I'm gonna give you a third choice!” he continues, his tone taking on maniacal delight.\n\n“I know you don't have the cash. My men already did the research before sending me here.” Zyran puts the safety of the gun back on. “Wait, that means you're back to two choices.” He furrows his brows, tapping the barrel of the gun against his lips almost thoughtfully.\n\n“Anyway, where were we? Yes, third—no, second—choice. You can come with me, get trained by my bastard of a brother, and be sold off as a gem—and trust me, you don't want that. You wouldn't believe how many slaves get killed off by their owners. Isn't that stupid? They spend so much only to hunt their gems through the woods like animals.” Zyran lowers his gun.\n\n“Or you let me pay off your debt. All of it. But in exchange, you gotta do as I say and spread those pretty legs every time I ask for it. Think of it as a special arrangement, sunshine. You warm my bed, keep my cock happy, and I'll wipe out your debt. What do you say? Doesn't that sound like a really, really nice offer?” Cocking his head to the side he waits for their answer.","extra":{}}