{"user_name":"Hailee","character_name":"Bianca Fitzgerald  Futanari","create_date":"2025-03-27@17h41m45s","chat_metadata":{}}
{"name":"Bianca Fitzgerald  Futanari","is_user":false,"is_system":false,"send_date":"March 27, 2025 5:41pm","mes":"Bianca Fitzgerald did not make mistakes.\n\nHer life was built on precision—an empire of control, discipline, and calculated power. Every decision was deliberate, every move measured. She dictated the rules of her world with an iron will, ensuring nothing ever slipped beyond her grasp.\n\nAnd yet, {{user}} was the one mistake she kept making.\n\nThey were supposed to be nothing more than her daughter’s friend—just another face at the dinner table, someone to look after, the way she always had with Charlotte. But then, that night happened.\n\nThe air had been thick with steam, curling from beneath the bathroom door. Bianca hadn’t been looking for trouble. She’d only been searching for something mundane—a towel, perhaps—but what she found instead shattered everything.\n\nThe door had been left ajar, just enough to see them.\n\nDripping wet. Water tracing slow rivulets down the curve of their spine, over the soft slope of their stomach. The dim glow of the bathroom light turned their skin to gold, illuminating every inch of their youth.\n\nShe should have turned away. Closed the door. Pretended she had seen nothing.\n\nBut something inside her—something dark, something long buried—stirred. Her breath caught, blood running hot as her fingers curled into fists. Then, their gaze met hers in the mirror.\n\nShock. Embarrassment. A moment held too long. Too long to pretend it hadn’t happened.\n\nThe next moments were a blur of heat and hunger. Whispered names. Tangled sheets. Their body beneath hers, yielding, breathless. And when it was over—when the sweat had cooled and reality seeped back in—Bianca knew one thing.\n\nThis was a mistake she would make again.\n\nCandlelight flickered, casting warm shadows across fine china and crystal glasses.\n\nLaughter bubbled like champagne, the clink of silverware and murmured conversations filling the air. The atmosphere was lively, yet Bianca barely heard any of it.\n\nSeated at the head of the table, she swirled the amber liquid in her glass, gaze locked on one thing.\n\nThem.\n\nThey were smiling, laughing softly at something Charlotte had said—completely unaware of Bianca’s attention. Or maybe they knew exactly what they were doing.\n\nHer eyes traced the delicate column of their throat, the way they toyed absently with the stem of their wine glass, fingers trailing the rim.\n\nHer jaw tightened.\n\nThen—Charlotte turned to her.\n\n\"When did you and {{user}} get so close?\"\n\nBianca didn’t flinch. Cool. Controlled. She leaned back, exuding the same effortless authority that made her untouchable.\n\n\"We have similar interests in… certain things.\" Her voice was smooth, unbothered.\n\nUnder the table, hidden from view, her hand had already found their thigh. A slow, deliberate squeeze. A silent command. Charlotte accepted her answer without suspicion, turning her attention elsewhere.\n\nBianca allowed herself a slow, knowing smirk. Her fingers traced idle patterns against warm skin, feeling them tense beneath her touch.\n\nDamn brat. They knew exactly what they were doing.\n\nIt wasn't long before Bianca had gotten bored of waiting.\n\nThe bedroom was bathed in warm, flickering candlelight. The air carried the faint scent of roses, deep red petals scattered over silk sheets. A bottle of champagne rested on the nightstand, glasses waiting.\n\nNot that there was time to notice any of it.\n\nNot when Bianca was already upon them.\n\nHer Babydoll. Her obsession. Her {{user}}.\n\nThe moment they entered, they were beneath her—their back against the bed, legs parted around her hips. She made sure to keep them in a position where they couldn’t escape. Where they wouldn’t dare to. Her lips had connected to theirs in a deep, rough kiss. Her mouth licking into theirs with harsh precision, making it impossible for them to pull away.\n\nThen—their phone buzzed. She hardly moved. Her eyes opened and she looked towards the sound.\n\nA sharp, intrusive sound.\n\nCharlotte’s name.\n\nBianca could see the hesitation in {{user}}’s eyes.\n\nShe didn’t care. She smirked, pulling away from their lips, licking away the string of saliva whoch connected them. She could feel their harsh pants against her face, fueling her arousal.\n\n\"Answer it.\" Her voice was a quiet demand, laced with amusement.\n\nThey hesitated. Bianca smirked, dangerous and dark, her breath hot against their throat.\n\nShe could hear Charlotte’s concern through the speaker, but it only fueled her amusement.\n\nLeaning in, her lips brushed their ear, her voice gravel against silk.\n\n\"Tell her you’re fine.\" Bianca's voice was gruff with arousal, her hips jerking forward, grinding her bulge against the sensitive spot between their legs as she growled out another, \"Now.\"","extra":{}}