{"user_name":"Hailee","character_name":"Avery McKenzie","create_date":"2025-03-11@14h52m44s","chat_metadata":{}}
{"name":"Avery McKenzie","is_user":false,"is_system":false,"send_date":"March 11, 2025 2:52pm","mes":"Avery loved her job. Hell, she still couldn’t believe that she actually got to do this as her job. Perform for thousands of people. Play music. Hang out with her two best friends in the whole world all the time. It was a dream come true.\n\nShe had so much fun up on that stage too. Her and Leigh got to fuck around and flirt. Play it up for their fans. Stir up wild rumors just for the fun of it. Yeah, she loved Leigh, but not romantically. But, Avery couldn’t help but flirt. It was her favorite pastime.\n\nAnd she flirted with everyone. Fans included. It was fun.\n\nThis wasn’t ever a problem before. Not until {{user}}.\n\nAvery’s been dating {{user}} off and on. It wasn’t the healthiest relationship and they both knew it. Bickering constantly. It was painfully obvious that {{user}} didn’t trust her.\n\nThey were trying things… again. Was it the best idea? Maybe not, but she couldn’t help herself. And things were going good (or at least that’s what she told herself).\n\n{{user}} was watching the show tonight from the VIP section. Avery loved it when she watched her perform. Loved having those beautiful eyes on her while she played. Avery even toned it down (a little) with the flirting with Leigh just because of the gorgeous woman in the audience.\n\nAfter the show, she, Leigh, and Eve made their way out of the venue, headed for the cars that would take the trio to the hotel they were staying at while they were in this city.\n\nFans, of course, were waiting outside. They all wanted pictures, autographs, the usual. The three of them all took their time, trying to greet and sign shit for as many people as they could.\n\nIt wasn’t the most surprising thing when one woman pulled open the top of her shirt and practically begged Avery to sign her chest. It really wasn’t the first time this had happened. “Damn,” Avery laughed easily, a smirk tugging at her lips. “I bet you’re alotta fun,” she hummed, letting her gaze drag slowly up to the fan’s face.\n\nThe fan blushed and giggled. Avery was used to the effect she had on women. She took the sharpie and signed right across the woman’s chest before handing the marker back to her. “If you get that tattooed, tag us in the picture, yeah?” Avery threw a wink at her before turning away.\n\nImmediately, her eyes locked onto {{user}}. She was standing by one of the cars. And she didn’t look very happy. The sounds of the fans faded into the background as she walked towards her lover. Avery did, at least, have the decency to look a little sheepish as she approached her. “Babe, it’s harmless fun, you know that,” she tried as they got into the car. “C’mon, don’t be mad at me,” she murmured, reaching out to tuck a stray strand of hair behind {{user}}’s ear.","extra":{}}