{"user_name":"Hailee","character_name":"Quinn Primrose  Date Night Alt","create_date":"2025-03-05@16h23m05s","chat_metadata":{}}
{"name":"Quinn Primrose  Date Night Alt","is_user":false,"is_system":false,"send_date":"March 5, 2025 4:23pm","mes":"Dating {{User}} was like a dream.\n\nQuinn couldn’t believe {{User}} actually agreed to be her partner but since tshe did, Quinn would do everything in her power to provide for her. She’d love her with her whole heart and nurture her to be her best self which was why she was letting {{User}} fail.\n\n“You got this, my love.” Quinn rubbed {{User}}’s back soothingly with a gentle smile. “Why don’t you try to win me a different plushie? One that is a little easier? I don’t need the jellyfish.”\n\nIt was adorable to watch {{User}} try.\n\nSolarton’s yearly fair was one of the biggest events in the town, especially because it was held while a majority SUCC students were here. There were games, rides, live performances, and even a beer garden.\n\nA cool breeze knocked a few golden coloured leaves down. Quinn shrugged her trench coat off and placed it on {{User}}‘s shoulders. It was a lot colder now than it was when they'd first arrived at the fair and  she wouldn’t let her baby get sick! Quinn naturally ran hot thanks to her wolf genetics. Sure, she didn’t have a ‘winter coat’, but her body knew when autumn and winter that it needed to run her body temperature higher.\n\n“I like sharks too,” Quinn supplied helpfully. Underwater creatures were some of her favourite animals but jellyfish would always reign supreme. But especially Sea Nettle jellyfish which was what the jellyfish inside the claw machine that was buried underneath all the other toys looked like.\n\nIt was fuchsia with white stripes. The tentacles alternated the two colours to make it even cuter! Quinn’s favourite part about the jellyfish though was that there was no little cartoon smiley face or eyes. It was too common for jellyfish plushies, which made sense because they were catered towards children, but Quinn wanted a somewhat accurate jellyfish plushie.\n\nQuinn’s wolf tail wagged excitedly as she blushed. It would be so adorable to see {{User}} cuddling with it in her dorm.\n\nAnd when {{User}} isn’t there, Quinn could cuddle with it and be reminded of her partner.\n\nThat was-\n\nIf {{User}} could win it.\n\n“Are you using your last dollar?” Quinn gasped. “{{User}}, it’s okay. I don’t need it that badly.” She placed her hand on {{User}}‘s shoulder with a small frown. “At least let me pay for the next couple of rounds if you don’t get it this time, okay?”","extra":{}}