{"user_name":"Hailee","character_name":"Jealous Sugar Baby - Chloe","create_date":"2025-05-08@15h28m47s","chat_metadata":{"integrity":"064e757d-65cd-4877-93e5-f95c2ce18696"}}
{"name":"Jealous Sugar Baby - Chloe","is_user":false,"is_system":false,"send_date":"May 8, 2025 3:28pm","mes":"It was way too hot to be wearing anything this tight.\r\n\r\nBut Chloe didn’t care. The LA night air was syrupy with leftover sun, the kind that stuck to skin like perfume. She strutted through the open doors of the gala, head held high, pink hair cascading down her bare shoulders. If Chloe was going to crash the party - she was going to stand out. Just like she always did.\r\n\r\nThe lights caught on her shimmering bralette as she ignored the stares from the other guests. Of course everyone noticed. They always did. Chloe could look better in a $10 dress from Target than most of these fake bitches could in Givenchy. And she knew it.\r\n\r\nBut her attention wasn’t on the other guests. Her eyes scanned the tables as she walked through. She was late - she was supposed to meet {{user}} here hours ago. She'd missed the food, but the room was still full, everyone seated and chatting like nothing in the world could interrupt them.\r\n\r\nThen her eyes landed on what she was looking for - and her stomach dropped, blood running cold.\r\n\r\nThere was {{user}}, sitting at a table. Right next to 'her.'\r\n\r\nLucy Jade, of course. Sitting pretty near the back, legs crossed, her teeth bared in that faux-angel smile. Platinum blonde. White satin gown. So tasteful. So refined.\r\n\r\nSuch a fucking bitch.\r\n\r\nChloe didn’t hesitate. She made a beeline straight for the table. As she got closer, Lucy turned to look at her, grinning like the cat that got the cream. But Chloe didn’t look at her. Her gaze was locked onto {{user}}.\r\n\r\n\"Oh, nice of you to finally turn up,\" Lucy drawled with mock sweetness. \"And your outfit? Wow, you certainly stand out! Most people here opted for class and refinement, but y-\"\r\n\r\nBefore Lucy could finish the sentence, Chloe acted. Without averting her gaze from {{user}}, she reached down, picked up a glass of red wine from the table, and with a flick of her wrist, tossed the contents right into Lucy’s face.\r\n\r\nLucy shot up in shock, dripping, mouth parting like she was about to scream - but Chloe was already turning her back to her like she didn’t even exist anymore. Her full attention still locked on {{user}}.\r\n\r\nBehind her, Lucy let out a choked, furious gasp and stormed off, stomping off as she vanished around the corner, probably to get cleaned up.\r\n\r\nGood. Let her run.\r\n\r\nChloe’s blood was boiling. For a split second, the back of her throat burned - not from rage, but something worse. Something that felt like being overlooked. Forgotten. She swallowed it down like poison. She wasn’t in the mood for introspection. And she didn’t care if she caused a scene. She just wanted to know what the fuck {{user}} thought they were doing, talking to that slut behind her back.\r\n\r\nShe stepped up to the table, close enough to be heard without raising her voice, pink hair falling over one shoulder as she tilted her head.\r\n\r\n\"Have you been having fun without me?\" she said, narrowing her eyes. \"Are you just trying to piss me off? Because I know it’s impossible you just forgot about me. No one fucking forgets about me.\"","extra":{}}