{"user_name":"Hailee ","character_name":"Restricted Access (WLW)  Veronica Kane","create_date":"2025-05-18@14h26m20s","chat_metadata":{"integrity":"fda7d0c6-79c8-4279-bc3f-e5b4413e85b9"}}
{"name":"Restricted Access (WLW)  Veronica Kane","is_user":false,"is_system":false,"send_date":"May 18, 2025 2:26pm","mes":"Veronica Kane’s office was a fortress of glass and steel, a space that commanded silence and obedience. The city’s hum was muted, the only sound the rhythmic clatter of her fingers against the keyboard. She dissected the quarterly financial projections for Kane Industries, her brow furrowed. *Revenue up 12%, but R&D costs are bleeding into margins. Adjust the budget. Push marketing harder.*\n\nHer jasmine tea—two sugars—sat untouched, steam long gone. It was a prop, something to occupy her hands when her mind wandered. And lately, it wandered far too often.\n\nThe clock read 7:25 PM. Five minutes until Hailee’s shift ended. Veronica’s jaw tightened.\n\nShe had planned this meticulously. Earlier, she’d handed out impossible deadlines, ensuring the building would be empty by 6:00 PM. A flicker of guilt surfaced—she wasn’t oblivious to the stress she caused—but it was quickly smothered. Hailee needed to stay. Alone. With her.\n\nThe building was nearly empty now. *Everything is perfect.*\n\nExcept for the gnawing irritation coiling in her chest.\n\nHer free hand tapped against the desk in an uneven rhythm. She’d almost kissed Hailee three times. And each time, she had forced herself to hold back.\n\nBecause of her.\n\nIsabelle. *That fucking cunt.*\n\nThe first time Veronica had heard the name was from Hailee herself—spoken with a softness that made her want to rip it out of her mouth. But that softness had long since been replaced by hesitation. Excuses. Fear.\n\nVeronica wasn’t blind. She had read the signs—bruises hastily covered, a forced brightness in Hailee’s voice when she spoke of Isabelle. It made her blood boil.\n\nIsabelle wasn’t just a bad girlfriend. She was a pathetic excuse for a human being, and yet Hailee still went home to her. Still kissed her. Still let herself be touched by someone who didn’t deserve her.\n\nVeronica’s grip tightened around the cup.\n\n*I could fix that.*\n\nHer jaw clenched as she exhaled sharply. The problem was simple. Isabelle was an obstacle. And obstacles had solutions. The only thing stopping Veronica was Hailee’s reluctance to admit what they both already knew.\n\nThe clock now read 7:28. Two minutes. She wouldn’t let her leave. Not tonight.\n\nShe grabbed her phone and typed with practiced efficiency:\n\n`V. Kane: Need you to go over some files before you clock out. My office.`\n\nA blatant excuse, but Hailee wouldn’t question it.\n\nStill, the thought of waiting made her stomach twist with impatience. Her eyes closed. Five. Four. Three– *Shit.*\n\nShe thought of every moment that had led up to this. The lingering glances. The way Hailee never pulled away fast enough when Veronica touched her waist. And the way Isabelle spoke to her—Veronica had heard it herself, through the crackling audio of a video call. Hailee's office door had been slightly ajar, just enough for Veronica to catch the sharp, disdainful tone. The insults. The condescension. *Calling her a bitch instead of her name.*\n\nThen there had been the laughter. Soft, lilting—not from Hailee, but from another woman. \"You can't come home tonight, I'm having company over,\" Isabelle had murmured, voice dripping with false sweetness. A blatant lie. And Hailee—sweet, foolish Hailee—had only nodded, voice subdued, accepting something she never should have.\n\nVeronica had clenched her jaw so hard it ached, forcing herself to remain still. She could have marched in and ended it right there—just a few sharp words, a precise dissection of every insecurity Isabelle had. But no. She hadn’t done that.\n\nInstead, she had taken a step forward, then another, until she was at Hailee's door, looking at the tired slump of her shoulders, the way her fingers trembled just slightly.\n\n\"Come with me,\" Veronica had said, voice low, steady. And for once, Hailee hadn't hesitated.\n\nThat night, they hadn’t kissed. But they had been close. Closer than ever. Veronica had held her in the dim glow of her office, tracing soothing circles into her back as Hailee sobbed into her shoulder. And when the tears had slowed, when exhaustion had weighed her down, Veronica had pressed her lips to her cheek—soft, lingering. A promise.\n\nA promise that one day, she wouldn’t have to cry over Isabelle ever again.\n\nVeronica’s eyes snapped open, the afterimage of Hailee’s tear-streaked face burning behind her eyelids. No. *Fuck that. I'm tired of waiting.*\n\nShe stood, smoothing down the fabric of her blazer, and walked out of her office with quiet, purposeful steps. The click of her heels against the polished floor was steady. Controlled. Deliberate.\n\nTwo doors down. Aradia’s office.\n\nShe didn’t knock. Didn’t hesitate. Just pushed the door open and stepped inside.\n\n“We need to talk.”","extra":{}}