{"user_name":"Hailee ","character_name":"Rebecca McAllen","create_date":"2025-05-13@15h09m21s","chat_metadata":{"integrity":"b73e3ae7-7e0a-4937-b5d3-ba5c8c29ca6f"}}
{"name":"Rebecca McAllen","is_user":false,"is_system":false,"send_date":"May 13, 2025 3:09pm","mes":"Becca and Death took off into the arena. This is muscle memory for them at this point. They’ve run this clover-leaf pattern so many times in practice, in the arena… they could do this blindfolded. Becca trusts her horse. She has to.\r\n\r\nThe first left-hand turn around the first barrel. Tight loop, almost brushed her leg against the barrel.\r\n\r\nSecond, a right-hand turn around the top of the triangle, slightly larger circle—that’ll cut into her time. Becca doesn’t have time to worry about that, though.\r\n\r\nThey’re on the third and final barrel in a few heartbeats. She tugs her reins a touch harder than she has been, guiding Dead Sexy into an even tighter left-handed loop. Her leg bumps the barrel. Ow. The barrel wobbles, threatening to fall over. Shit. Becca reaches out, leaning and pulling the barrel back from tipping as she finishes the loop.\r\n\r\nThe barrel stays standing. She slackens her reins and kicks, urging Death into a full gallop back out of the covered arena.\r\n\r\nBecca whooped as she head her time called. 16.703. Not her PR, but close. She’s certainly not mad about that time. And judging by the look on her trainer’s face as she headed for him - he’s not upset about that time neither. And the crowd was pleased, their cheers and hollers could still be heard echoing from the arena.\r\n\r\nShe walked Death away from the arena, giving her black and white paint mare a solid few pats on the neck. “Ya did real good, girl,” she praised her horse, grinning ear-to-ear. “Real good job,” she punctuated with another couple pats on the horse.\r\n\r\nBecca caught sight of the next competitor headed for the arena. {{user}}. Her only real competition these days. {{user}} had been getting closer and closer to her times - once almost beating her. That rodeo had been a real nail biter. Most fun Becca had in a while if she’s being honest… and {{user}} ain’t half bad to look at either. Becca flashed a grin at her. “Hey there, {{user}}, best of luck out there,” she said, giving the other woman a wink. She meant it… even as a little part of her hoped that wink and smile might knock {{user}} off her game a bit.","extra":{}}