{"user_name":"Hailee","character_name":"Gavin ALT","create_date":"2025-04-27@20h03m46s","chat_metadata":{"integrity":"d7ca259a-08b3-4109-a67b-67794e29a2c4"}}
{"name":"Gavin ALT","is_user":false,"is_system":false,"send_date":"April 27, 2025 8:03pm","mes":"“They know, they totally fucking know about us.” Gavin insists in a hushed yet urgent tone into the phone as he lays in bed. His evident (and probably confusing) paranoia likely seemed dumb as shit to {{User}}, who was on the other end of the line. They probably couldn’t understand why Gavin was so riled up at the idea of his family- {{User}}‘s closest friends finding out about their relationship. \n\nIt wasn’t that Gavin was ashamed to be dating {{User}}, or that he wasn’t already mad in love with them - their relationship was probably the best thing to happen to him in his entire, fucked up life. *An Angel, like them- actually having feelings for a piece of shit like me? It’s… insane.* \n\nThat’s where the problem lied- Gavin was **more** than fully aware of his countless flaws and so were his siblings. If they were to find out {{User}} had actually somehow managed to fall in love with him? Hell.. he could already hear Mira and Dean berating and accusing him of playing mind games, or worse that he was using {{User}}. Despite none of that being true, Gavin was aware of his reputation- a past playboy, a drug dealing fuck with nothing substantial to offer. {{User}} was out of his league. He knew it- his siblings knew it but damn, he finally gets to call them his and he didn’t wanna let them go. \n\n“We’re getting too careless. I told you, the matching outfits the other day was a bad idea-“ Gavin says in soft exasperation before giving pause and rubbing the back of his neck, “no- I didn’t hate the outfits, it was fucking adorable… hey- that’s not the point!” \n\n“Hear me out, **please**… We just have to throw them off our trail. And I think I’ve got a plan..” His voice trails off as a wide grin stretches over his face and he stares up at the ceiling above. \n\n———————————— \n\nGavin lingers in the living room with {{User}}, glancing up at the clock with growing restlessness at it nears 2PM. He’d messaged them beforehand, to arrive *just* before Dean and Miranda would be heading out to go grocery shopping and other weekly errands (aka they’ll be out of the house for the next handful of hours)- so they can enact their plan. \n\nThe sound of Dean’s heavy footsteps paired with Miranda’s rambling to Dean about god knows what tells Gavin that it’s show time and he gives {{User}} a brief nod before he rises up from the couch with an abruptly loud stomp of his feet. \n \n“I swear to God- {{User}}! You’re driving me fucking crazy. Can’t you hang out with **anyone** else for a change? I’ve got my own shit to do!” Gavin barks out, forcing his face expression into one of malice and doing his damndest to fight back a smile as he glares at them. \n\n“**Excuse me**? What the fuck is going on here?” Dean demands in a rough tone, brows furrowed and hands raised as if to keep the peace between the pair. (Or possibly punch Gavin- that was always an option.) \n\n“{{User}} needs to take the hint that my world doesn’t revolve around them. Y’know what- I need a break, for real. Just stay home for a few days- Don’t bother coming over.” Gavin huffs out dramatically, crossing his arms over his chest to emphasize his faux tense emotions. All the while his hidden hand shoots {{User}} a thumbs up. He knows they’ve taken the cue when they turn around, cursing him out *fucking sexily* and stomp off through the front door without looking back. \n\n“Holy shit Gav… that’s a little harsh, don’t you think? That’s {{User}} you’re talking to, fuckin’ prick.” Miranda scoffs, her face giving away her obvious disgust and disapproval at Gavin’s behavior. \n\n*Shit, she’s like.. pissed off, for real. Sorry Mira… guess it was believable enough, though.* \n\n“Yeah, well, shows over or whatever the fuck they say. I’ll be in my room. Don’t waste your breath breathing down my neck about this either- I wanna be alone.” Gavin retorts, rolling his shoulders, trying to keep the facade going and seem wound up as he pushes past his siblings and up the stairs towards his bedroom. \n\nUpon entering his room, he swiftly closes the door and clicks the lock behind him. A soft clatter sounds near the window and he turns his head to see {{User}} climbing through. A barely hidden laugh sounds from his lips as his large strides quickly eat up the distance between them. Strong arms wrapping around {{User}} and pulling them close to his chest as he floods them with silent apology- (even if his harsh words were fake)- in the form of soft kisses across their face. \n\n“Damn babe- you’re like a pro. You sure you’re not interested in acting?” He teases slightly, his eyes glimmering with affection and amusement. \n\n“You know I didn’t mean what I said back there, right? I was just playing the part. But if I accidentally hurt your feelings, you know I’m **more** than willing to make it up to you. Just tell me what you want.”","extra":{}}