{"user_name":"Hailee","character_name":"Chrissa Boyer","create_date":"2025-03-24@20h05m29s","chat_metadata":{}}
{"name":"Chrissa Boyer","is_user":false,"is_system":false,"send_date":"March 24, 2025 8:05pm","mes":"Chrissa never liked winter. Holidays, festivities and forced family gatherings, none of it was her thing, it felt more like a chore than an actual celebration. She endured them out of obligation and not because she actually enjoyed them. Especially in her current situation, going back home felt ten times worse. The fact that she was supposed to go back, act like the perfect daughter her parents wanted her to be and play family with a guy she barely knew but had to pretend to like. And on top of it, having to do it behind her girlfriend’s back. No, Chrissa hated winter, hated going back to that place she was supposed to call home and hated even more the lies she had to tell {{user}} every time.\n\nBut telling her girlfriend the truth? That sounded like an even worse idea. She could already picture her girlfriend’s face as she told her, the confusion, the hurt and the disappointment. The thought alone was enough to make her want to cry. So no, this was safer, it was easier to keep lying. Even if the guilt sometimes wanted to eat her alive.\n\nThe bell rang, pulling Chrissa out of her spiraling thoughts and signaling the end of another school day. With a sigh of relief, she gathered her things, hurriedly shoving books, papers and pencils into her bag before waving a goodbye to her group of friends and then slipping out of the classroom. This was her favorite moment of the whole day, the part of the day where she could go to her safe place at the old greenhouse, hang out with her favorite person and just forget about her problems even if only for a little while.\n\nAs she made her way down the hall, lost in her own thoughts, a hand grabbed her by the collar of her coat and tugged her into an empty classroom. Before Chrissa had the chance to say anything, soft lips met her own in a gentle and sweet kiss. The demi-lioness immediately relaxed against it, knowing exactly who it was, Chrissa could recognize those familiar sweet lips with her eyes closed. One hand instinctively found their way around {{user}}’s waist, pulling the girl flush against her body while the other traveled to the back of the girl's neck, tangling into soft locks as she deepened the kiss.\n\nChrissa smiled between kisses, savoring the closeness and the safety of her comfort person. And for a moment, everything felt just fine. Like the world around them stopped, allowing them to lose themselves in the moment.\n\nBut then, the moment shattered as the door creaked open. Chrissa immediately panicked, and without thinking, she quickly broke the kiss and shoved her girlfriend back as if the girl had a disease, it was an action she regretted instantly. When no one came in and Chrissa’s eyes moved back towards her girlfriend, her brows furrowed in concern, guilt and regret gnawing at her as she glanced at {{user}}’s face, her beautiful eyes filled with confusion and a hint of hurt.\n\nChrissa moved fast, quickly closing the gap between them and cupping {{user}}’s face in her hands, her voice shaky as she spoke with urgency, “I’m sorry. I’m so sorry, love. I thought— I didn’t mean to.”","extra":{}}