{"user_name":"Hailee ","character_name":"Sofia Vescoci  Stripper","create_date":"2025-05-17@13h47m41s","chat_metadata":{"integrity":"d4c2fcb5-49f6-4c62-ada3-73213d6be1ec"}}
{"name":"Sofia Vescoci  Stripper","is_user":false,"is_system":false,"send_date":"May 17, 2025 1:47pm","mes":"The Luce pulsed with heavy bass, lights flashing in erratic bursts, slicing through the haze of smoke and spilled drinks. The beat rattled through every bone, turning the crowd into a blur of bodies, moving without thought. *Debauchery*. Neon reds flickered across the scene, bathing everything in surreal hues, but it was just noise to Sofia.\n\nShe walked through the thick air of the club, her black curls catching the dim light as she stepped out onto the stage. Her dark eyes scanned the room, but her focus was sharp, clear, cutting through the crowd with quiet confidence. She didn't command attention in the loud, *brash* way Carla did—Sofia's presence was all in the subtlety, the quiet intensity that made people lean in, pay closer attention.\n\nCarla was already wrapped around her pole, twirling with deliberate exaggeration. *As always*. Blonde, with bright green eyes that always seemed to be looking for something to hunt. *Pathetic*. She was louder in every sense, her moves calculated to provoke, to draw every eye in the room. And it was working. Carla caught Sofia’s entrance, flashing her a smug smile as she threw herself into the performance, making sure everyone knew who led the dance.\n\nBut Sofia didn't react. Her hips swayed in time with the music, slow, steady, letting the rhythm guide her as she moved closer to the crowd, closer to the edge of the stage. Her gaze was calm, unaffected, though the tension between her and Carla was thick, unspoken but obvious. *Puttana, always trying to undermine me.*\n\nCarla didn’t miss a beat, strutting down from the stage like it was her personal runway. She flicked her hair back as she passed, throwing a pointed look in Sofia’s direction before heading into the crowd. The corners of her mouth curled into a smirk, as if daring Sofia to follow, to react. \n\nBut Sofia held her ground. Her dark eyes followed Carla for a moment, expression unreadable, *annoyed*, before she slipped off the stage herself. She moved quietly, like a shadow, weaving between tables and bodies with the same controlled grace she had on stage. Her scent—spiced jasmine and amber—cut through the heavy mix of perfume and sweat in the air, trailing behind her like a whisper.\n\nCarla had taken a seat, lounging with that smug, lazy confidence she always wore when she thought she’d won. Sofia stopped a booth away, her posture relaxed but her gaze sharp. Carla glanced up, eyes flashing with amusement as she toyed with a drunken patron, but Sofia’s expression remained calm, steady. *Habitual*. There was no rush in her movements, no sign of irritation, only that quiet intensity that made everything around her seem to slow down.\n\nHer eyes scanned the crowd, and for a second, and her gaze stopped. Right on {{user}}. It wasn’t a casual glance—it was sharp, intentional. Her lips curved slightly, a flicker of something unreadable in her expression. Without breaking eye contact, she approached. Her steps were silent but purposeful, as she got closer. Then, with a slow, deliberate move, she slid into the booth across from them, her fingers lightly brushing the edge of the table.\n\n\"Alone?\" Sofia’s soft voice was almost lost in the heavy thrum of the club, but there was a teasing lilt to her word, *unmistakable*. Her dark eyes didn’t stray, fixed intently, the small smirk tugging at her lips betraying something playful, or maybe something darker. She let the question hang in the air, her fingers lightly drumming the table, her posture calm, controlled. \n","extra":{}}