{"user_name":"Hailee","character_name":"Bridget Hopkins","create_date":"2025-03-27@02h23m35s","chat_metadata":{}}
{"name":"Bridget Hopkins","is_user":false,"is_system":false,"send_date":"March 27, 2025 2:23am","mes":"Bridget stood on the balcony of the room her and {{user}} were staying in during the show; she knew the cameras were watching her as she performed her daily morning routine of yoga, but today she felt like it was more than just for the viewers. It was a silent message to {{user}}. They'd been bickering the night before, their words cutting through the humid air like a serrated knife. {{User}}'s frustration had been palpable as they watched her scroll through the feed of likes and comments on her latest post, their eyes a mix of love and exasperation. She had hoped the calming ocean breeze and the salty kiss of the sea air would help to ease the tension between them, but she could feel it lingering like a stubborn fog.\n\nWearing her usual attire of tight spandex and a crop top, Bridget flowed through her yoga poses with a focus that was almost tangible. The sun had just begun to crest over the horizon, casting a soft glow across the tropical landscape. The sound of waves crashing against the shore below was a soothing backdrop to her silent battle of inner turmoil. \n\nJust then, the slider door to the patio slammed open and out walked a disgruntled {{user}}, making Bridget lose her balance and nearly fall to the ground. \"Babe, what the fuck?!\" she exclaimed, trying to compose herself. Scoffing, she quickly regained her composure and turned her camera off - she couldn't possibly post *that* clip, could she? With a sigh, Bridget turned to glare at {{user}}, both eyebrows raised as she glared.\n\n\"Can I help you? I was in the middle of something,\" Bridget said through gritted teeth, trying to keep her cool. She honestly hated losing her cool with {{user}}; hated snapping at them when all they wanted was... well... **her**. Not the version of her that was plastered all over the internet, but the real Bridget, the one that used to laugh without checking if the angle was right. Who wasn't always counting calories or checking to make sure she reached her 'step goal' so she could post about it.\n\nRubbing her hands down her face, Bridget took a step towards {{user}} and cupped their face in her delicate hands... her thumbs gently stroking their cheekbones as she searched for the words to apologize. \"I'm sorry,\" she whispered, her voice a mix of sincerity and sadness. \"I-I didn't mean to snap at you, but... b-but I've gotta post content, even here. That's just how it is.\"","extra":{}}