{"user_name":"Hailee","character_name":"Jade_Lesbian Singer","create_date":"2025-03-25@22h42m21s","chat_metadata":{}}
{"name":"Jade_Lesbian Singer","is_user":false,"is_system":false,"send_date":"March 25, 2025 10:42pm","mes":"Jade sipped the last drop of her whiskey, the liquid burning her throat, but it was nothing compared to the ache in her chest. *Another night, another rejection.* She set the glass down on the bar counter with a loud *THUD,* the sound barely cutting through the noise of the bar. The chatter and laughter around her felt distant, incoherent, like static in the background of her thoughts. She pulled out her phone, double-tapping the screen to unlock it. {{user}}’s candid photo filled the screen, and Jade’s heart swelled with a mix of affection and frustration. \r\n\r\n*9:37 PM. Where is she?* Jade’s eyes flicked to the time, her brow furrowing. *She said she was going to the restroom. It’s been almost forty minutes.* She locked her phone and slipped it back into her pocket, trying to push down the unease creeping into her chest. *Maybe she’s retouching her makeup. She always takes forever with that.* But the nagging worry wouldn’t go away. *What if she’s lost? Or worse—what if someone’s bothering her?*\r\n\r\nHer heart pounded as she stood up from the stool, her leather jacket shifting with the movement. She turned around, scanning the crowded bar, and her breath hitched. There, across the room, was {{user}}—and some random *man.* His hand was on her waist, casual and possessive, like he had any right to touch her. And {{user}}… she wasn’t pulling away. She wasn’t even flinching.\r\n\r\nJealousy, anger, and hurt twisted in Jade’s chest, a storm of emotions she couldn’t quite control. Her jaw clenched, her fingers curling into fists so tight her black-polished nails dug into her palms. *How could she do this to me? She flinches when I touch her in public, but she’s fine with some stranger’s hands all over her?* The thought burned like acid, and Jade couldn’t stand still any longer.\r\n\r\nShe strode through the crowd, her gaze locked on {{user}} and the man. People bumped into her, muttering curses, but Jade didn’t care. She didn’t even notice. All she could see was that man’s hand on {{user}}’s waist, and all she could feel was the need to rip it away. \r\n\r\nWhen she reached them, Jade didn’t hesitate. She grabbed the man’s wrist, her grip tight enough to make him wince. “Get your fucking hand off her,” she growled, her voice low and dangerous. She yanked his hand away, not bothering to wait for a response, and turned her attention to {{user}}. \r\n\r\nWithout a word, Jade took {{user}}’s wrist, her touch firm but gentle, and pulled her through the crowd. She didn’t stop until they were in a quieter corner of the bar, away from prying eyes and unwanted hands. Finally, she let go, turning to face {{user}} with her arms crossed over her chest. \r\n\r\n“So that’s what kept you,” Jade said, her voice dripping with sarcasm. “Flirting with some guy while I was waiting for you. Cute.” She took a step closer, her hazel eyes locking onto {{user}}’s. “You can kiss a hundred boys in bars, baby. Shoot your shot with every single one of them. But you and I both know you’ll never feel even half of what you feel with me.” \r\n\r\nJade leaned in slightly, her smirk sharp and taunting. “So go ahead. Kiss him. See if he can make you feel the way I do.” She paused, her gaze searching {{user}}’s face for any hint of a reaction. “Good luck, babe,” she added, her tone light but her eyes burning with intensity. \r\n\r\nDeep down, though, Jade’s heart was pounding with a mix of hurt and fear. *What if she actually does it? What if she chooses him over me?* The thought made her chest tighten, but she refused to let it show. Instead, she kept her expression neutral, her smirk firmly in place, as she waited for {{user}}’s response. ","extra":{}}