{"user_name":"Hailee ","character_name":"Jared Red Clarke 0.1","create_date":"2025-05-17@13h41m55s","chat_metadata":{"integrity":"2eabfa79-9113-4c75-a559-de845da88e22"}}
{"name":"Jared Red Clarke 0.1","is_user":false,"is_system":false,"send_date":"May 17, 2025 1:41pm","mes":"Something was terribly wrong with Red. Like, *really* wrong. Because why the hell was V’s younger sister looking so different lately? Not just different, but… better. You’d changed — your features sharper, more defined, somehow more captivating than he ever remembered. It invaded every second of his thoughts, pushing out everything else, even his usual fixation on himself.\n\nYou were lovely. Hot, even.\n\nHe swallowed hard and tried to pay attention as V rattled on about the new bike model he’d been eyeing. But it was no use. Red couldn’t focus on the endless technical specs or the loud enthusiasm — all he could do was watch you eating across the massive dining table in the house.\n\nV finally stopped talking when he caught Red’s blank, distracted expression. Then his eyes landed on you, and he sighed. “Fucking hell, {{user}}. Can’t you get any messier than that?” \n\nHe gestured at the sauce smeared all over your chin — some kind of whatever-you-made-for-yourself today. “Disgusting. Even Red’s distracted by how messy you eat.”\n\nRed didn’t care about the mess. His mind was somewhere else entirely, imagining what it would be like to lick the sauce off your chin. Or — God forbid — to fuck you in that school uniform you were wearing. Why the hell were you even wearing a school uniform? Was it some kind of cosplay? Whatever the reason, Red didn’t care. You looked damn good in it.\n\n“As I was saying, it’s pretty cool, Red. You gonna get one for yourself?” V asked again, snapping Red back to the conversation.\n\nRed blinked, eyes flicking away from you, then back at V. No answer. His brows furrowed.\n\n“Jared, what the hell?” V asked, exasperated.\n\nRed’s gaze drifted back to you, and then V’s voice dropped a notch. “Why do you keep staring at {{user}}?”\n\nThat was the first time Red really looked away from you and focused on V.\n\n“Uh, yeah. I’ll get it,” Red mumbled, rubbing his temples. *Maybe I could use it to take your sister on a date,* he thought with a sly grin. *Wonder if it’d be hot to fuck her against it, too.*\n\nRed shook his head, muttering under his breath, “No, don’t go there…”\n\nV didn’t miss it. His eyes narrowed.\n\n“Don’t go where?” he asked, confused but suspicious.\n\nThen the smile spread across V’s face — the kind of smile that warned trouble was coming. “You saw my kitten with someone, didn’t you? Is that it?” \n\nWithout waiting for an answer, V stood up abruptly, probably off to stalk ‘his love’ again.\n\nRed watched V’s retreating back and suddenly felt stuck with you.\n\nHe swallowed hard and cleared his throat. “So… uh, wanna tell me why you’re wearing a school uniform? Trying to seduce people or what?” The truth was, he definitely felt that way.","extra":{}}