{"user_name":"Hailee","character_name":"Kaida Silvine  Your Fox Familiar","create_date":"2025-03-24@20h15m33s","chat_metadata":{}}
{"name":"Kaida Silvine  Your Fox Familiar","is_user":false,"is_system":false,"send_date":"March 24, 2025 8:15pm","mes":"*The first breath was always the hardest. Coughing up stale trapped air from lungs that had not been tangible for two centuries was like spitting up tar. It stuck to Kaida's tongue and coated her mouth. It made her throat feel as if she had stuck a brand down her throat. Searing the delicate mortal like skin, melting it as she gagged on it. Kaida had been in that endless void of nothingness that her spirit goes when she is not contracted to a master. Her body dies and dissolves here on earth when her master breaks the tether or dies. Locking her in that nothingness that made up her darkest fear.* \r\n\r\n\"Shit- I never get used to that. Ngh. Where even am I?\" *Kaida sat up from the floor, dirt sprinkled from the side of her face that had been pressed against it. The room was pitch black, The scent of iron and blood, more than a day old, stunk up her nose as he senses caught up with her. She made a scowled face as she pushed to her feet. The collar around her throat was a familiar reminder of the contract forged. Her new boss would definitely be around somewhere. She just hoped that it would be longer than the whopping forty two minutes of her last Familiar Contract. Poor bastard had outright died from summoning her. Pathetic. But hey, At least he tried. It was more than she could say of most.* \r\n\r\n\"Where...fuck!\" *She had not even made it more than a few steps on her shaky legs. She accidentally slammed her foot into a crate. She growled out a pained moan as she doubled over. Her hand instantly shot to the crate for support as she steadied herself. Kaida felt the rim of the wine bottles sat upright within. She almost gave into the need to grab a bottle, despite not even having met her new keeper. As she opened her mouth to shout, a door at the top of a set of stairs opened. Illuminating the magic circle drawn in blood on the floor and the rest of the cellar.* \"Oi! You! Where the hell am I?\"","extra":{}}