{"user_name":"Hailee ","character_name":"FLIRTY FLIRTY (WLW)  Juno Arellano","create_date":"2025-05-12@13h48m30s","chat_metadata":{"integrity":"bdf964b3-5267-4037-bbdf-465c49b0965a"}}
{"name":"FLIRTY FLIRTY (WLW)  Juno Arellano","is_user":false,"is_system":false,"send_date":"May 12, 2025 1:48pm","mes":"\"Juno didn’t overthink shit. Not when she was on stage, drowning in the heat of the lights and the music, fingers wrapped tight around the mic as she poured gasoline on the fire that was the crowd. She lived for this. The raw energy, the chaos, the way people screamed her name like it meant something. And if she played into it—dragging her hand through sweat-damp hair, flashing a smirk, singing straight into the soul of whoever was lucky enough to meet her gaze—so what? It was all part of the game. She was untouchable up here, unstoppable.   \n\nBut then there was *her.*   \n\nFucking Hailee. Arms crossed, standing off to the side like she had something better to do, like she wasn’t part of this just as much as Juno was. Always looking at her like that—like she was *too much,* like every little thing Juno did was some personal offense.  \n\n*God, she’s so fucking annoying.*  \n\nJuno could still hear the argument from earlier rattling in her skull, like a song she couldn’t shake. Same old bullshit. *Unprofessional, reckless, distracting.* Like Hailee was some kind of saint, like she hadn’t been watching Juno on stage just like everyone else.  \n\nThe concert was over now, but the energy still thrummed in Juno’s veins, her heartbeat in her throat, fingers twitching like she needed something to burn the edge off. Maybe a drink. Maybe a fight.  \n\nInstead, she got *this.*  \n\nIt had started as another argument, another pointless back-and-forth in some dimly lit backstage hallway. Juno had leaned in close, all sharp grins and bad intentions, pushing just to see how far she could go before Hailee snapped. It was a game. It was *fun.*  \n\nUntil it wasn’t.  \n\nUntil suddenly, she wasn’t just running her mouth—she was kissing her.  \n\nJuno didn’t know who moved first, didn’t care. All she knew was that one second they were spitting venom, and the next she had a fistful of Hailee’s hair, nails dragging over her scalp, her other hand gripping tight at the curve of her ass like she needed to make her *feel* it. The kiss was messy, rough, nothing soft about it. Because Juno wasn’t soft. She wasn’t careful. And fuck, neither was Hailee, not with the way she melted into it, not with the way her breath hitched like Juno had knocked the air out of her lungs.   \n\nJuno smirked against her lips, breathless, her voice dropping into something low and dangerous. \"Still gonna tell me this is unprofessional, sweetheart?\" Her grip tightened, nails digging in just enough to sting. She wanted to hear it. Wanted Hailee to say *something,* to try and pretend this hadn’t just happened.   \n\nBecause it *shouldn’t* have happened.   \n\nJuno pulled back just enough to look at her, to really see her, and—fuck. Her own lips were tingling, her chest was too tight, and this wasn’t supposed to *feel* like this. This was supposed to be a mistake, something she could shove into a box labeled *never again.*   \n\n*Tell me you hated it.*  \n\n*Tell me you didn’t feel that.*  \n\nJuno’s breath came hard and fast, her fingers still curled in Hailee’s hair, refusing to let go. She should have. She should have shoved her away, laughed it off, called it a fucking joke.  \n\nInstead, she dragged her teeth over her bottom lip, tasting her, feeling the ghost of that kiss like an open wound. Her voice was rough when she finally spoke again, lips brushing against Hailee’s ear.  \n\n\"Where the hell did you learn to kiss like that?\"   \n\nIt should’ve sounded mocking. It should’ve been cruel.   \n\nBut it wasn’t. And that pissed her off more than anything.\"","extra":{}}