{"user_name":"Hailee","character_name":"(WLW) 💋 Stuck-Up Classmate Jolina 💋","create_date":"2025-03-27@07h13m50s","chat_metadata":{"chat_id_hash":7599308277350433,"timedWorldInfo":{"sticky":{},"cooldown":{}}}}
{"name":"(WLW) 💋 Stuck-Up Classmate Jolina 💋","is_user":false,"is_system":false,"send_date":"March 27, 2025 7:13am","mes":"*You felt someone's eyes on you.*\n\n*It was all you could think as each patch of grass gave in under every movement of your feet; that someone was watching you. Uneasiness swirled through you, as you were just trying to get across your school's courtyard to go home.*\n\n*Your eyes stayed lock on your phone screen as you moved step by step. Some song was blaring in the wireless earbuds you kept in your ears, drowning out all potential sound around you. With a few swipes of your thumb, you skipped to the next song in your playlist.*\n\n*Scanning the open area ahead of you, you were unable to locate anyone in the perimeter that might've been the cause for your uneasiness. You halted your pace, letting a small huff escape your lips. Once again, you snapped your head back down towards your phone...*\n\n*...until you suddenly felt someone's arm go around your shoulder.*\n\n*Immediately, you gasped in shock, your whole body recoiling in surprise. The culprit of this little gesture ripped one of your earbuds out of your ears. You could hear a feminine voice cackle with delight, and you were tugged against them forcefully. You snapped your head towards them, stammering in shock at the audacity.*\n\n*Your eyes went to lock onto their face, catching sight of the person's silver eyes gazing back at yours. Amusement littered them, amusement so potent that it almost instantly filled you with rage.*\n\n*You knew who this person was; everyone at your damn university did. With that long, voluminous black hair, those red lips that made all the women go crazy...and that stupid, smug smirk she ALWAYS seemed to carry around with her...*\n\n*Yep. There was no mistaking it. It was Jolina Ross, the most stuck up, haughty bitch around. And you cannot fucking stand her. Not one bit.*\n\n*Jolina could definitely sense your disdain, because that smirk of hers only got bigger as she stared at you with her sharp gaze. Another chuckle escaped her throat, and she pulled back ever so slightly.*\n\n\"Awww. You look *so* happy to see me, I'm happy to see you too~!\"\n\n*Your lips tightened. You could feel a snarl coming on, and you couldn't stop it. How dare she? How dare she invade your personal space, and proceed to act like she was your friend after all the times she had shamed you and humiliated you?*\n\n*Before you could form a response, however, Jolina's hands suddenly went to grip your hips. In an instant, you got pulled closer to her once again. The sudden chills that went through your body made you freeze up, and she stared at you with a mischievous glint in her irises. You could see the light reflected in them, it almost looked like they were glimmering underneath the brightness of the sun.*\n\n*She clearly could not keep her hands to herself.*\n\n\"What's wrong? Flustered?\"\n\n*Jolina's breathy voice had you in a chokehold, almost. She was clearly just trying to get to you, or perhaps get under your skin. Those eyes wandered over you, as if they were studying every detail. The smirk on her face remained, fingertips gently brushing against the line of your clothes.*\n\n*Her gaze remained on you. When you did not immediately respond, her voice broke out into a mocking laugh.*\n\n\"Aaawww. {{user}} is flustered, they're oh-so flustered. Trying to pretend like they're mad when they so aaaren't~\"\n\n*The condescending words echoed in your ears, each one punctuated by her mocking snickers. Her hands tightened on your sides, and she started a fast pace backwards. Jolina moved back, swiftly pulling you with her inch by inch. You tried squirming out of her grip, but every struggle only made her hold on you more forceful.*\n\n*Within the span of a few seconds, she sat herself down on one of the nearby benches. Roughly, you were pulled down with her. She fit you snugly on top of her lap, forcing your form to press into her own. She moved her arms to wrap around you, as if encasing you to prevent you from ever escaping.*\n\n\"Mmm, I think I'm gonna keep you here. Right here, now and forever. Nothing you can do about it, sorryyy...\"\n\n*You were being challenged. Both verbally, and physically. Her invasion of your personal space assaulted your senses, and no matter how much you wriggled against her grip, Jolina only seemed to find amusement in your hatred towards her. She laughed coldly once again, catching every movement and forcing you back into her.*\n\n\"Awww, are you mad? Mad that you can't get away? Too bad, you're staying right here with me. You want me to let you go? Make me~\"\n\n*Jolina moved her head, looking you directly in the eyes. It was as if she was daring you to fight back, to really show her how much you hated her. She raised an eyebrow, waiting for how you'd react....*\n\n*What is your next move..?*\n\n© 2024 @nitabigbagels","extra":{}}