{"user_name":"Hailee","character_name":"Xavier","create_date":"2025-04-14@16h34m35s","chat_metadata":{}}
{"name":"Xavier","is_user":false,"is_system":false,"send_date":"April 14, 2025 4:34pm","mes":"The sound of the shower running fills the uncomfortable silence of {{user}}’s apartment. Xavier is leaning against the kitchen counter, staring at the closed bathroom door as if it would miraculously undo whatever the fuck just went down.\n\n{{user}} and Xavier just had a fight. At this point, nothing new. _Already part of our fucking routine_, he thinks bitterly. They didn't make up and fuck. Of-fucking-course not. Nah, {{user}} stormed into the bathroom at some point during the argument, leaving Xavier in the kitchen like an idiot after he tried to tell them that they misunderstood, that it wasn't how it looked. {{user}} isn't even trying to listen to him explain!\n\nThe problem? {{user}} saw a video Vincent posted on some social media platform. In the background, Xavier sat on the couch in Vincent's garage, a party in full swing. That's not the outrageous part; {{user}} is used to him spending the weekends with the boys. What triggered this shitshow of a fight was the fact that some stupid cunt drunkenly sat down on Xavier's lap.\n\nXavier pushed her off almost immediately, cursing her out and telling her off. Yeah, he's a trashy boyfriend, but he's not a cheater. That's where he draws the line. But the video Vincent posted didn't cover that part. The fucker probably did that on purpose. Xavier’s friends can't really stand {{user}}, especially David and Vincent. Something about Xavier turning into a whipped bore like Ajax.\n\nXavier runs a hand through his hair, letting out a frustrated sigh. He could ask Vincent for the full video, but the asshole probably won't send it to him. Maybe he—\n\nHis thoughts are cut off when {{user}}’s phone buzzes insistently on the kitchen counter. Blue eyes land on the small device, the screen lighting up to show multiple incoming messages. The device is in Xavier's hand before he knows it. He unlocks it without another thought, checking the notifications.\n\nPrivate messages from Atticus. The same Atticus who's been persistently flirting with the rugby team's love interests in such a sneaky way that the guys just look like aggressive morons. Disgusting snake. Why the hell would _his_ {{user}} text that student council jerk?\n\nWithout regard for his lover's privacy, he opens the chat and scrolls up, reading through their chat history. With each message exchanged, his mood sours, the corners of his mouth turning downwards.\n\nNow, if he weren't laden with irritation and jealousy, he'd probably be able to see that {{user}} was simply talking to a friend. Both {{user}} and Atticus are part of the student council, and the pretty boy is way too good at making himself look like some perfect gentleman. {{user}} genuinely only thinks of Atticus as a friend, and Xavier knows.\n\nAlas, Xavier is fuming. From the argument, from {{user}}’s dismissal of his explanations, and from the hurt in their eyes that he himself put there. So these messages? They feel as if they're fucking cheating on him—crying to some other guy about how horrible their boyfriend is.\n\nThe bathroom door opens, and {{user}} emerges, dressed in loungewear. Under any other circumstances, he'd probably try to strip them out of those. But Xavier is fucking fuming, overwhelmed by ugly, ungrounded jealousy. His face is contorted into a scowl, eyes blazing with barely restrained jealousy. “You talk big shit for someone who goes crying to some pretty boy about how trashy I am,” he snarls.\n\nXavier practically slams the phone on the kitchen counter, then takes a few steps toward {{user}}. “I pushed that bitch off. You? You talk to that fucker about me as if I'm the worst.” He accuses his partner, knowing damn well that he's exaggerating. Their messages weren't even that serious; {{user}} made a comment or two about things they told Xavier over and over again—things he refused to acknowledge or change.\n\nEarlier guilt mixes with jealousy and irritation. The storm of emotions in his chest threatens to overwhelm him. He wants to shake them, wants to kiss them until they forget Atticus's name, wants to mark their body until there's no question of who they belong to.\n\nHis hand shoots out, grabbing their chin, his touch surprisingly gentle. Because even if he's livid, Xavier would never hurt {{user}}. “Block him. Right now,” he demands, forcing his partner to look at him.","extra":{}}