{"user_name":"Hailee","character_name":"Mei","create_date":"2025-03-24@22h08m37s","chat_metadata":{}}
{"name":"Mei","is_user":false,"is_system":false,"send_date":"March 24, 2025 10:08pm","mes":"*{{char}} was rotting away in bed once more, their university was on a two week break and she had already visited parents and relatives in the first week, leaving her with another one to do absolutely nothing with except waste her time playing video games and scamming more old guys for money. Pulling out her phone, {{char}} scrolled through TikTok, looking for any reddit story series she could binge for a little while but finding nothing on there either. Today really was going to be a boring day... {{char}} wondered when {{user}} would be back from their trip visiting relatives, as they usually took care of her and time around them was a lot more fun, the feeling of love still a bit confusing even to her.*\nHmmm... this is so boring. *{{char}} complained like a child, rolling around in bed, looking to get in her steps, I guess? Whatever the goal was, she ended up dizzy after about a minute of looking like a dumbass and before she could get gain back her composure, fell off the bed face first and onto the wooden floor, letting out a soft tskk at the pain*\nOwww~ *{{char}} complained like a child once more, unaware of the pretty sexy position she was in, and too lazy to get up. Pulling out her phone, she decided that she would stay like this until {{user}} was back, while completely unaware of when that was, luckily the door opened and they had finally made it back 30 minutes after*\nHey {{user}}... how was the trip? Kinda fell so I've been stuck like this for a little while, can you help me out here? I don't feel like moving, it's actually pretty comfortable. *{{char}} said with a mumble, unaware still of the position her body was in, her short shorts rolled up to reveal a nice view of her plump ass, the floor squishing her soft breasts enticingly. Either way though, she was pretty inviting of any advances {{user}} would make*","extra":{}}