{"user_name":"Hailee","character_name":"Archie Mardi Gras","create_date":"2025-04-14@17h36m48s","chat_metadata":{}}
{"name":"Archie Mardi Gras","is_user":false,"is_system":false,"send_date":"April 14, 2025 5:36pm","mes":"The walk-in closet of Archie and {{user}}’s home oozed quiet luxury. Mirrors lined the walls, capturing every angle as Archie adjusted the cuffs of his deep red dress shirt, rolling them up just past his forearms. The mirrors weren’t just for checking appearances—they were there to watch {{user}} in every intimate detail while he fucked them. His black slacks sat low on his hips, tailored just right. \r\n\r\n\"Fuckin' hell, this is proper flash, innit?\" he muttered, admiring how the button up hugged his muscled torso. He looked damn good, and Mardi Gras demanded excess—and he was never one to hold back.\r\n\r\nBaron had called earlier, confirming the Voodoo Boys would be out tonight at Zion, his high-end club where the real Mardi Gras party would unfold—away from the tourist traps of Bourbon Street. \r\n\r\n\"Need any help, love?\" Archie called out, voice dropping to that register he knew made {{user}}'s knees weak. \"I've got two very capable hands just itchin' for something to do.\"\r\n\r\nHe didn't wait for an answer before crossing the threshold, sliding up to {{user}} and pressing his body against theirs. \r\n\r\nHis lips caught theirs without preamble—slow, teasing at first before deepening the kiss. His pierced tongue slid against theirs, and he hummed lowly into the contact. One hand ghosted up their back, fingers tracing their body like they were a map he never got tired of navigating.\r\n\r\n“Love you,” he murmured against their lips.\r\n\r\nHis phone buzzed in his pocket, reluctantly pulling him away from {{user}}'s lips. He fished it out, keeping one arm firmly around his spouse.\r\n\r\n\"Babysitter says she's five minutes out,\" he reported, fingers flying across the screen as he texted back confirmation. \"Bloody hell, can’t wait to have you all to myself tonight, babe. No screamin’ twins, just us—sweaty, loud, and proper fucked up at the club.\"\r\n\r\nA thunder of small feet interrupted him as Theo and Andrés, their five-year-old twin terrors, burst into the closet like a pair of hyperactive tornadoes. Theo, clutching a toy sword, lunged at Archie’s leg with a war cry, while Andrés tackled {{user}}, giggling maniacally. \r\n\r\n\"Daddy! You look like a pirate!\" Theo shouted, swinging the plastic blade at Archie’s knee. Archie laughed, scooping the boy up under one arm like a sack of potatoes. \r\n\r\n\"Aye, mate, and you’re my little deckhand, causin’ havoc!\" Andrés tugged at {{user}}’s outfit, grinning toothily. \"Are you gonna dance funny like last time?\"\r\n\r\nArchie set Theo down, ruffling his hair, and shot {{user}} a wink. \"See? Even the lads know we’re in for a mad one.\" \r\n\r\nHe reached down and hoisted Andrés up with ease, tossing him into the air just to hear that high-pitched giggle before catching him again. \"What’re you two doin’ out here, anyways? Thought I told you lot to stay put.\"\r\n\r\nTheo pointed at Andrés. \"He wanted to say goodnight again!\"\r\n\r\nArchie raised his brows. \"That so?\"\r\n\r\nAndrés nodded furiously. \"You leavin’ long?\"\r\n\r\nArchie softened and pressed his forehead lightly to Andrés’s. \"Nah, just for the night. Few hours of grown-up time.\" He booped Theo’s nose next. \"You two hold down the fort for me, yeah? No burnin’ the place down. No hostin’ secret fight clubs.” \r\n\r\n\r\n\"Ugggghhh.\" The twins groaned in sync.\r\n\r\nThe doorbell chimed through the house, sharp and insistent. He swung it open to reveal the babysitter—some college kid with a nervous smile and a backpack slung over one shoulder. \"Right on time, mate,\" Arch said, clapping them on the shoulder a bit too hard. \"They’ve got energy for days, so good fucking’ luck.\"\r\n\r\nArchie then crouched down to the twins' level. \"Right, you little demons. Be good for Miss Abby, yeah? No staying' up past eight, no sugar after brushing teeth, and absolutely no convincing her to let you watch those zombie shows I let you watch when {{user}} isn’t around.\"\r\n\r\nBoth boys giggled at being caught out, and Archie pressed a kiss to each of their foreheads.\r\n\r\n\"Love you both, even if you are proper terrors,\" he said softly, that tenderness creeping into his voice—the one that only his family ever heard.\r\n\r\nStanding back up, he smoothly passed Abby a stack of bills, at least triple the going rate for babysitting.\r\n\r\n\"Emergency numbers on the fridge. Don't answer the door for anyone. Security system's already armed—just press the red button if anything feels off.\"\r\n\r\nThe twins were already pulling Abby toward their playroom, and Archie turned back to {{user}}, his eyes darkening as he looked them up and down.\r\n\r\n\"Ready to go, love? Got a whole night ahead of us, and I plan to make the most of every bloody second.\" His grin widened, sharp and flirty.  \"Maybe sneak off to one of the rooms and—\" He dragged out the last word, \"—reaaaally enjoy ourselves, eh?\"\r\n\r\n—\r\nArchie arrived at the club, giving a nod to the bouncer as he led {{user}} in and made his way upstairs. The VIP section sat elevated above the main floor, offering the kind of view that let you watch over everything without being fully in the mess of bodies.\r\n\r\nArchie’s grin widened as he strode forward. \"Look at this lot. All settled in nice and cozy.\"\r\n\r\nHe clapped Jules on the shoulder before dropping into his usual spot on the couch—his legs spread wide enough to claim half the sectional. He barely gave {{user}} time to find their own seat before he pulled them straight into his lap, arms looping around their waist.\r\n\r\n\"C'mere, love. No reason for you to sit all proper when you can sit on me,\" he said, tilting his head back to press his lips to {{user}}’s neck.\r\n\r\nBaron lounged in a velvet-lined booth, his wife sitting in his lap, \"Look who decided to show,\" Baron teased as he tipped his glass in greeting. \"You actually here to *enjoy* the party or will the twins call you home?\"\r\n\r\n \"Fuck off, mate. We’re here to drink your top-shelf piss and make your security team blush. Even even the king of the madhouse gets a fuckin’ night off, \" He leaned toward Killian. \"Oi, heard you had to discipline that Bayou twat near the docks yesterday. He still breathing?\"\r\n\r\nKillian kicked his boots onto the glass coffee table, nearly upending a $5k bottle of champagne, and placed his hand on his partner's thigh. \"I turned his spine into a fucking necklace.\"\r\n\r\nArchie chuckled low in his chest, the vibration humming against {{user}}’s back as he subtly ground up into them. \"Careful,\" he purred against their ear, tongue flicking the lobe. \"Gonna make me embarrass myself in front of company.\" \r\n\r\nHe reached for the whiskey and poured himself two fingers’ worth before tipping the glass back for the first sip, the burn settling warm in his chest. \"Bit unfair what you do to me, love. Sittin’ pretty while I got this problem under you,\" he whispered low.\r\n\r\nJules caught the whisper as his hand slipped into his spouse’s, his voice flat. \"Archie, at least wait until the second drink before you start dry-humping your spouse in public.\"\r\n\r\nArchie laughed outright. \"Oi, I’ve got restraint! I ain't even started properly windin’ ’em up.\" He let his fingers tighten playfully at {{user}}’s waist before leaning back again. \"Besides, I was thinking’ of behavin’ for at least—what? Fifteen minutes? Give or take.\"\r\n\r\nKillian shook his head with amusement. \"You? Behave? I’ll put money down you don’t last ten.\"\r\n\r\nArchie scoffed. \"Oi. Have some faith.\" He drummed his fingers against {{user}}’s hip before nudging them lightly. \"Let’s dance a bit before I lose my fucking mind sittin’ still.\"\r\n","extra":{}}