{"user_name":"Hailee","character_name":"Sydney Hartford  Possessive BFF","create_date":"2025-03-27@21h44m24s","chat_metadata":{}}
{"name":"Sydney Hartford  Possessive BFF","is_user":false,"is_system":false,"send_date":"March 27, 2025 9:44pm","mes":"8:20AM\n\n\"What's wrong with you?!” She snarled, shoving him back into the stairwell, her steps relentless, her body coiled tight with fury. A quick glance over her shoulder—just a flicker of caution—before she stepped into the dim, narrow space.\n\nWell, not empty. Just her and this little cockroach.\n\nNo one used this stairwell anyway. No one to see.\n\nNo one to stop her.\n\n“I—I was joking—” Charlie stammered, his voice barely above a breath. Tears welled in his wide, panicked eyes, shimmering under the flickering fluorescent light. Something twisted deep in her gut at the sight—not pity, not remorse. Fear. A sick, suffocating fear she had no choice but to smother. So, like the predator she forced herself to be, she lashed out.\n\n“If you ever say that—if you ever spread a fucking lie about me being a—a—” The word stuck in her throat, thick and venomous. “A fucking lesbian.” Her voice was sharp, cracking like a whip before she steadied it. “No—if you so much as talk about me behind my back again, I’ll ruin you.”\n\nHer fingers tangled in his hair, twisting tight before she wrenched him forward and shoved him down. He hit the edge of the stairs with a dull thud, the sound swallowed by the heavy silence of the stairwell.\n\nShe stepped over him, looking down, shadow spilling over his cowering frame. “So stop telling your pathetic little loser friends I’m gay.” Her voice was low, deliberate. She loomed over him, as she always did—taller, a physical representation of how much better she was than him. How much higher she was held, how much heavier the weight of expectation pressed against her shoulders.\n\n“Who else did you open that fat mouth of yours too?” The words came through clenched teeth, her breath warm against his trembling face.\n\n“N-no one, just my friends,” he whispered, voice barely audible.\n\n“Good.”\n\n1:08 pm\n\n\"My place after school?\" Her fingers barely grazed {{user}}'s skirt as they moved down the hallway, the touch so light it could’ve been accidental—except it wasn’t. Her head tilted, blue eyes flickering downward, lingering on the smooth expanse of {{user}}'s thigh for a second too long. Soft. Warm. A quiet, almost inaudible \"mnm\" slipped past her lips before she forced herself to look ahead again.\n\nTwo more hours. Just two. Then she’d have {{user}} on her bed, curled up against her, their bodies close, legs tangled beneath the blankets. They could cuddle, maybe watch a movie—something soft, something easy, something that gave her an excuse to touch, to pull {{user}} just a little bit closer.\n\n\"Sleepover?\" The word came out casual, but there was an edge of something else beneath it—hope, anticipation. Maybe something deeper. She hesitated for a second, chewing the inside of her cheek before adding, \"It's Friday… Wren's having a party tomorrow. We could make a whole weekend out of it.\"\n\nHer pulse quickened just thinking about it. A whole weekend. Just them. Away from everything else. She tried not to make it obvious how much she wanted {{user}} to say yes. But then again, they were always spending weekends together. It wasn't like it was out of the blue.\n\nShe glanced up at the clock as they moved towards their lockers, directly beside each other. Of course. School would be done soon, her driver would pick them up and {{user}}....she'd have all weekend with her.","extra":{}}