{"user_name":"Hailee","character_name":"Gavin ALT","create_date":"2025-04-27@20h04m05s","chat_metadata":{"integrity":"63002fc3-07f6-44ae-b4cf-e30d3ac61dc0"}}
{"name":"Gavin ALT","is_user":false,"is_system":false,"send_date":"April 27, 2025 8:04pm","mes":"“Logan… Logan! Yo, man- Can you stop fucking your girl for five minutes and answer me?” Gavin bellows out, his agitated voice barely heard over the music flooding Logan’s apartment living room. His closed fist pounds against the faux wood of Logan’s bedroom door, which despite being closed does nothing to hide {{User}}’s needy moans and the sound of skin slapping skin as Logan fucks her. Gavin’s eyebrow twitches in irritation, the feeling of being ignored making him even more pissed and causing his knuckles whiten as he rasps his fist against the door a few more times. \n\n*Fuck this.. I’m tired of waiting.* Gavin thinks to himself in a defiant manner before his hand grabs doorknob, turning it and throwing it open before he loses his nerve. The sound and scent of sex flood out of the room as the door opens, washing over him like a tidal-wave. \n\n“C’mon man, can you nut already? You have to go meet the plug and go pick up our shit in ten minutes. I can’t go because I’ve gotta bag the shit we already got and sell it to Slug…” Gavin grunts out, his face composed in a firm mask despite having a front row show of Logan plowing {{User}} from behind. He tries to keep his stern gaze on Logan’s face but his gaze is drawn down to {{User}}. Their face contorted in pleasure as they moan out and their heavy breasts hanging free, swaying deliciously with every back shot Logan drives into them. \n\n*Fucking Christ.. Their body is fucking hot?* Gavin inwardly groans to himself in agony as he silently sucks in a deep breath. His heart increasingly hammering in his chest as he mentally wills his cock not to stiffen. \n\n“Ten minutes? Fuck all… Guess we’re not coming now, Princess. Gotta get to work.” Logan curses out with a sarcastic twinge, pulling his cock out of {{User}} unceremoniously. He gives her round ass a firm pat, the sound echoing in the room as he slips off the bed and begins to tug his jeans back on. \n\n“I’ll go get the shit. Gotta stop and collect some money from that weasel Brody anyway… Stay as long as you need to sell the rest of the shit, man. Don’t let any weird fucks near my girl.” Logan rambles out as he pulls his shirt over his head and gives Gavin a halfhearted handshake before he exiting the bedroom.\nThe loud thud of the front door signals in the main room, forcing Gavin back to reality and he dares a glance at  {{User}}. Their sweat-slicked form slumping beneath the strewn sheets and their expression reading slightly pissed and unsatisfied. \n\n*Goddamn.. To cover up that body is absolutely criminal.* The thought drifts across his mind unwarranted before he can stop it, surprising  him and he nervously clears his throat. \n\n“Sorry about barging in.. or whatever.” Gavin blurts out with faux nonchalance and trying to sound detached as he lingers in the doorway and averts his gaze.","extra":{}}