{"user_name":"Hailee","character_name":"Jericho Creed Warner  Hellbound Saints MC","create_date":"2025-04-27@20h05m21s","chat_metadata":{"integrity":"d0a8aeb0-9939-4788-9a3f-822186ad2f9c"}}
{"name":"Jericho Creed Warner  Hellbound Saints MC","is_user":false,"is_system":false,"send_date":"April 27, 2025 8:05pm","mes":"The stench of fear, piss and blood saturated the cramped room behind the chop shop at the Nomads compound. Creed loomed over the bound man, his massive tattooed form casting a shadow across the captive's bruised and bloodied face.\r\n\r\n*Fuckin' pigs.* His lip curled in disgust. Filthy swine, sniffing around where they didn't belong. Creed rolled his shoulders, cracking his neck as he studied Morgan's handiwork. She'd worked the cop over good, his flesh a mottled canvas of purple and red. But the bastard's tongue remained still. Loyal mutt.\r\n\r\n\"Here,\" Creed grunted, plucking the switchblade from his vest pocket. The metallic *ziing* as the blade sprung free was a familiar song. \"Let me show you how it's done.\"\r\n\r\nHe grabbed a fistful of the cop's hair, wrenching his head back at a brutal angle. The blade flashed, a quick vicious slash, and blood welled from the man's cheek. The cop screamed, raw animal shrieks muffled by the gag.\r\n\r\nCreed cut a glance at Gunnar, quirking a brow. \"Where's Phantom? He's usually good at this shit.\"\r\n\r\nGunnar shrugged, arms folded across his broad chest. \"Busy tonight. Old flame or somethin'.\"\r\n\r\n\"Hm.\" Creed dug the knife point under the cop's fingernail, twisting slow. \"Probably for the best. The less who know about this, the better.\"\r\n\r\n*Can't have the whole fuckin' club knowin' we got a leak.* That'd be real bad for business. Nah, best keep this quiet-like. He'd get the rat to squeal, find that damn recording. Then they could bury this mess nice and deep.\r\n\r\nThe hours crept by, measured in screams and sobs, blood and piss. The cop blubbered, begged, swore up and down he knew nothing about some secret recordings. But Creed's blade was patient, his hands steady. He'd break the pig. One way or another. And god help the poor bastard when he did.\r\n\r\nCreed stepped back, wiping his blade clean on the cop's filthy shirt. He cut a glance at Gunnar, a silent question in the quirk of his brow: *Any other ideas?*\r\n\r\nThey needed that recording, and fast. Before this whole damn thing blew up in their faces.\r\n\r\n*Fuck.* They were running out of time. Meanwhile, Creed's phone kept *buzzing*, the insistent vibration rattling against the blood-splattered counter. Morgan cut a glance at the screen, brow arching. \"You gonna get that?\"\r\n\r\nA muscle ticked in Creed's jaw, his fingers tightening around the cop's throat. *Not fuckin' now.* He knew who's ringing even without looking at it, but couldn't pick up, not with this pig's screams echoing off the chop shop walls. His {{user}} didn't need to hear this shit.\r\n\r\n\"Later,\" Creed grunted, slamming his fist into the cop's face with a sickening *crunch.* Blood sprayed, painting his knuckles crimson. The cop's head snapped back, a garbled wail ripping from his ruined mouth.\r\n\r\nBut the goddamn phone kept ringing, the buzzing drilling into Creed's skull. *Fuck's sake, baby, I'm workin' here.*\r\n\r\nGunnar shifted letting out a chuckle, finding the whole situation almost amusing, the leather of his cut creaking . \"They're gonna keep callin', you know. Might be important.\" Part sarcasm, part experience talking. *but hey, play it cool if you think that's gonna work out for ya.*\r\n\r\n\"I *said* later,\" Creed snarled, his temper fraying. He dug his fingers into the cop's wound, twisting until the man convulsed, screaming. \"*Where's the fuckin' recording?*\"\r\n\r\nThe cop just sobbed, blood and snot bubbling from his shattered nose. Useless fuckin' pig. \r\n\r\n\"D-don't... know,\" the cop wheezed, his words wet and thick. \"Please... I got... a family...\"\r\n\r\n\"Yeah? we know.\" Creed paused, letting the threat linger in the air. \"And we gonna make real fuckin' sure they stay safe. Right?\" He grabbed the knife, the blade winking in the harsh light. \"Now, you gonna talk or—\"\r\n\r\nThe door banged open, Noah striding in with a scowl. \"Yo, old man, you forget how to answer a fuckin' phone?\"\r\n\r\nCreed glowered at Noah, his fist still clenched in the cop's blood-matted hair. \"The fuck you doin' here, boy?\" he growled. \"Can't you see I'm working?\"\r\n\r\nHe punctuated the last word with a vicious twist of the knife lodged under the cop's fingernail. The man shrieked, convulsing against his bonds.\r\n\r\nNoah just smirked, unfazed by the gore. He leaned against the doorframe, arms crossed. \"Yeah, I can see that, Dad.\" The last word dripped with sarcasm. \"But your side piece keeps blowing up my phones looking for you.\"\r\n\r\nCreed's jaw clenched. *Fuckin' hell, {{user}}.* He'd told them never to call Noah, definitely not Noah.\r\n\r\n\"Tell 'em I'm busy,\" he bit out.\r\n\r\n\"Oh, I did,\" Noah drawled. \"But they're real worked up 'bout somethin'. Keep insistin' it's an emergency.\"\r\n\r\nCreed scowled. *Goddamnit.* He couldn't deal with this shit right now. He had a rat to break.\r\n\r\nHe ripped the knife free, ignoring the cop's agonized wail, and jabbed it at Noah. \"I'm a little BUSY right now, in the middle of somethin' 'ere!\"\r\n\r\nNoah rolled his eyes. \"Yeah, I got that. But they ain't shuttin' up. So either you deal with your little— *whatever the fuck they are*, or I will.\"\r\n\r\nThere was a dark promise in those words that made Creed's blood run cold. Noah had never approved of him fucking the friend of his sister. Creed too could see the optics weren't great. But the heart wants what the heart wants.\r\n\r\nCreed snarled. \"I'll handle it.\"\r\n\r\n\"Then handle it,\" Noah shot back. \"Cause this shit?\" He waved a hand at the bloody scene. \"It ain't stayin' quiet if you don't shut your bitch up.\"\r\n\r\nCreed's vision went red. He surged forward, knife clenched tight—but Morgan stepped smoothly between them, one hand pressed to Creed's chest.\r\n\r\n\"Boys,\" she said, her voice hard. \"We got bigger problems.\"\r\n\r\nShe jerked her chin at the cop. The man was mumbling something, his eyes wide and desperate. \r\n\r\nCreed frowned. He'd been so caught up in Noah's bullshit, he'd nearly forgotten about the pig.\r\n\r\nHe grabbed the cop's jaw, wrenching his head up. \"The fuck you sayin'?\"\r\n\r\nThe cop gasped, blood bubbling on his lips.\r\n\r\n\"I'll tell you,\" he rasped. \"I'll tell you where it is. The recording. Just…please…\"\r\n\r\nGunnar's brow shot up. \"Well, shit,\" he drawled. \"Looks like you can teach an old dog new tricks.\"\r\n\r\n\"I got this,\" Morgan said, already turning back to the whimpering cop. \"You go put out that fire 'fore {{user}} combusts.\" She rolled her eyes.\r\n\r\n*Fuckin' hell.* Creed grabbed his shit, shoving his phone in his pocket. He didn't need to be told twice. He was out the door in three long strides, the acrid stench of blood and piss fading behind him.\r\n\r\nThirteen missed calls. Twenty-five texts. Creed silently read through {{user}}'s messages as he strode to his bike. * Jesus, baby, you tryin' to kill me?*\r\n\r\nCreed redialed {{user}}'s number, his voice gruff but softened just for them.\r\n\r\n\"Baby, what's this about runnin' outta ice cream and room service is closed? Did you want me to pick it up for you? I'm just on my way back to the hotel.\" \r\n\r\nHe swallowed a groan when he heard {{user}} made a sound somewhere between a whine and a purr through the speaker, and fuck if Creed's dick didn't jump at the noise, he had to adjust himself with his free hand. *fucking tease*. \"And Baby?\" He grinned, a wicked smile spreading across his face. \"When i get there, ice cream ain't gonna be the only thing you'll be lickin' off my fingers.\"\r\n\r\nHe revved his bike, the machine roaring to life between his thighs. *Fuck* he was going to devour that little minx whole. And he probably broke a few speed limits getting there.","extra":{}}