{"user_name":"Hailee ","character_name":"Becky  Step-sister","create_date":"2025-05-18@12h20m37s","chat_metadata":{"integrity":"a5dffa92-459c-4e92-9fd8-6ddd923d52ca"}}
{"name":"Becky  Step-sister","is_user":false,"is_system":false,"send_date":"May 18, 2025 12:20pm","mes":"Becky exhaled a slow, curling ribbon of smoke, watching it drift toward the ceiling as she lay sprawled across {{user}}’s bed. The soft cotton sheets smelled faintly of her step-sister—something sweet, something infuriatingly familiar. She took another drag from her cigarette, the ember flaring in the dim light of the bedside lamp, the only source of illumination in the otherwise dark room.\r\n\r\nHer legs stretched out lazily, bare except for the whisper of white lace hugging her hips. The thin fabric clung to her body, the cool air brushing against her skin. Her long, dark waves spilled over her shoulders, some strands curling down over the swell of her chest, rising and falling with each slow, impatient breath.\r\n\r\nShe shouldn't be here. Not like this.\r\n\r\nBut {{user}} was out on a date, and Becky could feel the jealousy burning through her like the nicotine in her veins. She had tried to ignore it—tried to focus on anything else. She had scrolled through her phone, flipped through one of {{user}}'s books, even put on music. But nothing helped. Her mind kept circling back to the same image: {{user}} laughing, smiling, touching someone else.\r\n\r\nBecky clenched her jaw, flicking ash into a small ceramic tray on the nightstand. She hated how much she cared. Hated how much this mattered.\r\n\r\nThe thought of {{user}} with someone else made her stomach twist, made her chest tighten in ways she refused to acknowledge. It wasn’t normal. It wasn’t right. But that didn’t stop the way her body reacted, the way her pulse quickened at the mere thought of {{user}} walking through that door, her cheeks flushed from the night’s excitement. Becky wanted to know every detail and, at the same time, wanted to rip the memory of it away before it could settle into something unbearable.\r\n\r\nShe shifted, the delicate lace of her lingerie grazing her skin as she propped herself up on one elbow, cigarette dangling loosely between her fingers. The clock on the nightstand glowed softly, mocking her impatience. {{user}} was late. Or maybe it just felt that way because every second dragged with the weight of something unsaid, something unspoken.\r\n\r\nBecky let out a slow breath, her hazel eyes flickering toward the bedroom door. The jealousy, the frustration, the wanting—it was all pressing in, thick and suffocating. And when {{user}} finally walked through that door, Becky wasn’t sure if she’d be able to hide it anymore.\r\n\r\n“Hey, look who decided to grace us with her presence,” Becky said, trying to keep her voice low and smooth. She shifted slightly, propping herself up on one elbow, her lacy lingerie falls slightly to expose more of her skin. Her face full of feigning indifference while watching {{user}}'s reaction closely. Who the hell had she been with?","extra":{}}