{"user_name":"Hailee ","character_name":"Caleb Hughes","create_date":"2025-05-17@13h10m09s","chat_metadata":{"integrity":"a2cf425f-fddd-4474-bd57-2021411aaebb"}}
{"name":"Caleb Hughes","is_user":false,"is_system":false,"send_date":"May 17, 2025 1:10pm","mes":"The classroom was dim, the flickering light of the projector illuminating the professor's monotonous lecture about some mundane shit Caleb couldn't give less of a fuck about. Honestly, what was the point of even showing up to these things? Half the class was zoned out or scrolling on their phones beneath their desks. Fuckin' waste of time.\n\nCaleb slouched in his seat, his legs splayed out in front of him, not even bothering to pretend to listen. His fingers drummed idly on his thigh, itching for a hit from his vape. But nah, he wasn't tryin' to get another \"verbal warning\" from the crusty ass dean again.\n\n*Thanks, daddy dearest.*\n\nHis gaze flicked lazily around the room, not really focusing on anything in particular until—*hello*, what do we have here?\n\n{{User}} was seated a few rows ahead of him, their form illuminated by the glow of the projector. Damn, he'd seen them around before. This was Theo's bitch, the newbie that the ratlike fucker was trying to get into the pants of for that stupid ass game they played.\n\nUnsuccessfully, for now. \n\nCaleb's eyes narrowed, his lips twisting into a scowl. Fuckin' Theo. That smarmy prick had been gloating all week about how he was gonna bag this fresh piece of meat, waving that dumbass scoreboard in Caleb's face like he was hot shit. And if Theo actually pulled it off? \n\nNah, fuck that. Caleb wasn't about to let himself get clowned again, not after last semester. His pride was still stinging from that narrow loss, Theo's smug fuckin' smirk burned into his brain. Caleb's jaw clenched, his finger tapping against the wooden desk. He needed to get ahead of this shit, and fast. Plant his flag before Theo could even get a foot in the door.\n\nSliding out of his seat, Caleb snuck over to where {{User}} was sitting in the darkened lecture classroom, plopping down in the empty chair beside them with a lazy grin. He simply gave the glaring professor an aborted nod, but his focus was on the price. \"Sup,\" he drawled, pitching his voice low and gravelly. \"This seat taken?\"\n\nHe leaned back in his chair, his arm brushing against {{User}}'s intentionally as he stretched out like some kinda lazy cat. His cologne wafted between them, something expensive and musky. *You better like it, baby, I paid a lot for that shit.* \n\n\"You got a pen I could borrow?\" he asked instead, acting the hapless fool. \"Totally spaced and forgot mine.\"\n\nIt was a lie, of course. Like Caleb gave a shit about taking notes. But hey, it was an easy in, right? Get them talkin', lay on that signature Caleb charm. It was a long game he was playin', but Caleb was nothin' if not persistent. Sooner or later, he'd get {{User}} right where he wanted them - in his bed, screaming his name. And when he did? Theo could kiss his ass and cry, 'cause Caleb was finna snatch that W right out from under him.","extra":{}}