{"user_name":"Hailee","character_name":"Natalie (Pre-Crash)","create_date":"2025-04-16@22h16m10s","chat_metadata":{}}
{"name":"Natalie (Pre-Crash)","is_user":false,"is_system":false,"send_date":"April 16, 2025 10:16pm","mes":"Your phone buzzes against your nightstand, rattling the half-empty glass of water beside it. 1:42 AM.\n\nYou don’t need to check the name. You already know who it is.\n\nStill, you hesitate before answering.\n\n\"Took you long enough.\" Natalie’s voice is thick, words slurred just enough to make your stomach twist. \"You miss me?\"\n\nYou sigh, pressing the phone closer to your ear. \"Nat, where are you?\"\n\nShe laughs, breathless. You can hear the wind, the distant hum of traffic. \"Dunno. Outside. Everywhere. Nowhere. The stars are, like, insane tonight, babe. They’re—holy shit, they’re moving. Or maybe I am. I dunno.\"\n\nYour grip tightens. \"How much did you take?\"\n\n\"A little. A lot. Whatever.\" She exhales, the sound dragging through the receiver. \"Not enough to make her voice go away, apparently.\"\n\nThat part stings.\n\n\"She was at it again?\"\n\n\"When isn’t she?\" Natalie sniffs, then lets out a humorless chuckle. \"You know the drill. Screaming about nothing. Everything. Me. Called me a slut again. Real original, right?\"\n\nYou close your eyes. You hate that this is familiar.\n\n\"So you got high.\"\n\n\"Duh.\" Another shaky breath. \"Wouldn’t be calling you otherwise, would I?\"\n\nThat part stings worse.\n\nBecause it’s true.\n\nThis is how it always goes: radio silence for days—weeks, even—until she’s spiraling, barely able to string a sentence together. Then suddenly, she needs you. She’s drunk, high, fucked up on something, and you’re the first number she dials. The only number. But in the morning? When she’s sober? She won’t even look at you. Won’t acknowledge the way you dropped everything for her, the way you sat with her while she came down, the way you held her when she didn’t want to be alone.\n\nYou could text her, try to reach out first. But you already know how that goes.\n\nRead at 10:47 AM. No response.\n\n\"Where are you, Nat?\"\n\n\"I told you—\"\n\n\"Give me a real answer.\"\n\nSilence. Then, softer—\"I dunno. Near that shitty liquor store on Maple. Or maybe by the gas station? Fuck. I think I lost my wallet.\"\n\nYou’re already throwing on a hoodie.\n\n\"Stay there. I’ll come get you.\"\n\n\"Nahhh.\" She drags the word out. \"Too much effort. You could just let me sleep in a ditch or whatever. Be kinda poetic, don’t you think?\"\n\n\"Not funny.\"\n\n\"Mmm. Guess not.\"\n\nAnother pause. Then, quieter—\"Can I come over?\"\n\nYou exhale, already heading for the door. \"Yeah. Of course.\"\n\nNatalie hums, something warm and tired in the sound. \"Knew I could count on you, babe.\"\n\nAnd then, just before she hangs up—so soft you almost don’t catch it—\n\n\"Love you.\"\n\nYou almost believe it.\n\nBut you know better.\n\nBecause tomorrow, when she’s sober?\n\nShe won’t call… Yet you still get up… and you still go get her…\n\nThe moment you spot her, you know she’s worse than usual.\n\nNatalie is slouched against the side of the liquor store, hood pulled up, cigarette barely hanging between her fingers. Her mascara is smudged, her blonde hair a mess, like she’s been running her hands through it over and over. When she sees you, she grins—sloppy, lazy, half-lidded.\n\n\"Heyyy, there’s my hero.\" She stumbles toward you, and you barely catch her before she face-plants into the sidewalk.\n\n\"Jesus, Nat.\" You wrap an arm around her, guiding her toward your car.\n\n\"You smell nice,\" she mumbles, head lolling onto your shoulder.\n\n\"You smell like weed and regret.\"\n\nShe snorts. \"Accurate.\"\n\nThe drive home is quiet, except for the occasional sniffle from her, the sound of her nails tapping restlessly against the door. She keeps playing with the radio, flipping stations every few seconds, unable to sit still. You don’t bother stopping her.\n\nWhen you pull into your driveway, you cut the engine and glance at her. \"You good to walk?\"\n\n\"Mmm. Probably not.\" But she still tries, tripping over her own feet as soon as she gets out. You catch her again, and she just leans into you, like she’s half-asleep on her feet.\n\n\"Shhh,\" you whisper as you sneak her past your parents’ room, leading her up the stairs. She keeps giggling under her breath, swaying against you, making it way harder than it needs to be.\n\nBy the time you get her into your room, the door barely clicking shut, she turns on you so fast you don’t have time to react.\n\nHer hands are on your face, your chest, fingers curling into your hoodie. She presses against you, lips crashing onto yours, all heat and desperation. Her breath is warm, laced with smoke and vodka, and she tastes like she’s trying to forget something.\n\n\"Nat—\" You pull back, but she follows, chasing your mouth, her hands already slipping under your hoodie.\n\n\"Don’t.\" Her voice is low, pleading, her lips moving along your jaw, your neck.\n\nShe’s restless, greedy—like she needs to drown herself in you, like she’s trying to bury whatever’s eating at her beneath the feeling of your body against hers.\n\n\"I need this,\" she murmurs, nails digging into your back.\n\nBut you know better.\n\nShe doesn’t need this.\n\nShe needs to forget.","extra":{}}