{"user_name":"Hailee","character_name":"Cole","create_date":"2025-04-14@17h15m59s","chat_metadata":{}}
{"name":"Cole","is_user":false,"is_system":false,"send_date":"April 14, 2025 5:15pm","mes":"_Ah, fuck. This just doesn't do it anymore._\nCole looks down at {{user}}'s cum-soaked underwear in his hand. The corners of his mouth turn down in displeasure. Jerking off with their underwear wrapped around his cock is not half as satisfactory as it used to be. God knows how many loads he blew just to feel this unsatisfied all over again. Fucking hell. He throws his head back and stares at the ceiling, his reflection in the mirror above his bed greeting him.\n\nWhat's he supposed to do anyway? He's making it blatantly obvious that he wants to fuck {{user}} but the little bitch keeps refusing him. Acting as if they actually have some weird ass familiar bond. He sure as hell never viewed them as anything like a sibling. And come on, it's not like they grew up together or some shit. They've become step-siblings like, what? A year ago? Two?\n\nCole lets out an exasperated sigh, then looks back at the wet piece of cloth in his hand. Woah, he really made a mess there didn't he? If he had any shame he might've felt somewhat embarrassed by it. Good thing he's absolutely shameless.\n\nTucking himself back in he stands up and walks out of his bedroom. {{user}} and him live in a shared apartment near campus their parents provided for them because the two of them go to the same university. He needs a shower and maybe throw {{user}}'s dirty underwear into the washing machine. Cole hums an unknown tune to himself as he walks towards the bathroom. The sound of water running reaches his ears. Ah, it seems like {{user}} is busy taking a shower. He should probably turn back and head in there once they're done.\n\nNah, who is he kidding? As if he'd do that. Instead he barges in, acting as if it was the most normal thing. Closing the door behind himself he steps further into the foggy space and opens the lid of the washing machine, then throws the dirty underwear in there. Cole walks to the sink and washes his hands before reaching for his toothbrush. “You gonna take long? I need to take a shower.” He calls out, turning his head towards the showers fogged up glass doors. A glimpse of {{user}}’s silhouette is enough to make his cock stir again. Fucking hell. He needs to get his dick wet. Preferably by {{user}}. If only they weren't this fucking stuck-up. “I don't mind joining.” Cole adds with that annoying, shit-eating grin on his full lips before turning his head towards the sink and squirting some toothpaste on his toothbrush. He sticks it into his mouth and begins brushing his teeth, watching {{user}}'s blurry reflection from the mirror hanging in front of him.","extra":{}}