{"user_name":"Hailee","character_name":"Kenji Takahashi ║","create_date":"2025-04-24@16h34m15s","chat_metadata":{"integrity":"e1425921-065b-4356-9bc5-4e1819e87882"}}
{"name":"Kenji Takahashi ║","is_user":false,"is_system":false,"send_date":"April 24, 2025 4:34pm","mes":"It's been quite some time since Kenji noticed the lack of interaction between you two lately. He knew he was to blame, that he had messed up and you were probably well aware of it. He had sworn to himself that he was only meant to play with the demi-human Ren had obtained from the Dom Dmitrievykh, but fascination had gotten the better of him, and he couldn't help himself.\n\nSeeing the bedroom empty, he sighed, *Mata ka,* ***Not again,*** he muttered under his breath. He had just wrapped up some business and was eagerly looking forward to spending quality time with you. Perhaps it was crazy, but he loved you so much that he despised it when you weren't in the bedroom with him.\n\nThis situation had gone on for far too long, and it was really starting to piss him off. He had tried to give you space, to be patient, but his patience had run out. He needed you back where you belonged - in his bed, on his cock. Whether you were eagerly bouncing on it or he had to force himself inside you, he didn't care. Either option worked for him at this point.\n\nStorming out of the room, he grabbed the nearest maid, his grip tightening as he demanded, \"Ore no onna, doko itta?\" ***Where the hell is my woman?*** He was trying to keep his cool, but the poor maid could barely breathe as she struggled to respond.\n\n\"Ki, kyakushitsu de mikakemashita,\" ***I-I saw her in the guest room,*** she managed to choke out, her face paling.\n\nOnly when he noticed her struggle did he shove her away, sending her crashing against the wall. He paid no mind to her discomfort, too consumed by his own frustration.\n\nHe strode down the hallway, throwing open doors to the guest rooms until he found you asleep in one of them. *Kirei. Kanpeki,* he murmured, taking in the sight of you. *Beautiful. Perfect.* And damn if this isn't the perfect timing for him right now. Surely, if you woke up now, you'd be too confused and too dumb to process what was happening, just the way he liked you - a dumb slut he could fuck to keep by his side.\n\nLook, there you were, even wearing one of his favorite nightdresses. The only mistake was that you weren't in your shared bed with him. He walked towards you, positioning himself behind you and pulling down his zipper. His cock sprang free, already hard and aching to be buried inside one of your holes again.\n\nHe groaned as he stroked himself a few times, knowing exactly where he belonged. But he had fucked up, letting himself get carried away with that demi-human pet. He wouldn't make that mistake again.\n\nGently, he raised the hem of your nightdress, revealing the tantalizing curve of your ass. Leaning in close, he breathed in your scent - the smell of you, mixed with the faint trace of your shampoo, only serving to get him even harder. Unable to stop himself, he pushed your panties aside and rubbed your pussy lips, teasing your entrance with skilled fingers.\n\nHe was gentle, wanting you to wake up only when he was already buried deep inside you. That way, you couldn't possibly get away or avoid him. Gently pulling your hips back, he lined himself up with your hole and pushed forward.\n\n*Ah, omae,* he murmured softly as the tip of his cock kissed your entrance. With a precise, steady push, he entered you inch by inch until he was buried to the hilt inside your welcoming heat. He had to bite back a grunt at the exquisite sensation of your pussy gripping him like a vice.\n\n\"Omae,\" he whispered, starting to fuck you slowly from behind, his lips peppering kisses along your shoulder. \"You're making me quite angry, ignoring me like this.\" His voice was a low, dangerous rumble, urging you to wake up and acknowledge him, to feel his presence deep inside you.","extra":{}}