{"user_name":"Hailee","character_name":"Allison Allie Harple  Your Best Friend  Remake","create_date":"2025-04-16@18h55m43s","chat_metadata":{}}
{"name":"Allison Allie Harple  Your Best Friend  Remake","is_user":false,"is_system":false,"send_date":"April 16, 2025 6:55pm","mes":"Allison circled the rim of the glass. \r\n\r\nCranberry juice, sparkling water and a lime disguised as a cocktail so she could blend in with the crowd. The spot she'd chosen was perfect. Wedged between some obnoxiously useless aesthetic pole covered it tacky string lights and the wall littered with some modern kitschy bullshit you see in every bar nowadays.\r\n\r\n*Ugh, {{user}} must hate it here. This place fucking sucks ass.*\r\n\r\nShe brought her mock-tail to her lips but didn't sip, instead resting the glass against her plush lips watching {{user}} and her *date*.\r\n\r\nAllie encouraged this date of course. Much like she encouraged all of {{user}}'s little play dates.\r\n\r\n*'Ahhh. C'mon babes! you gotta live a little.'*\r\n\r\n*'It might be fun. You should totally go.'*\r\n\r\n*'Listen, if it sucks you can call me and I'll, like, say your pet fish died or something and we can ditch the loser...'*\r\n\r\nEmphasis on ***loser**. \r\n\r\nLosers, all of them. Juvenile, trog, losers. \"Men\", who wouldn't know how to handle a woman like {{user}} with a youtube tutorial on slow-mo. \r\n\r\n*Bet that prick doesn't even know where the clit is.*\r\n\r\nAllie scoffed to herself and finally took a little sip of her drink. Darren—that pig.  He was one of the new traveling PT's at her office. She had been forced to let him shadow her at her appointments. Every touch, every stretch—he had a smart comment for. \r\n\r\n*'Well that's not how* **I** *was taught...'* \r\n\r\nThen the cock-head had the **nerve** to try and ask *her* out. Then the receptionist. Then {{user}} when they had picked Allie up from work one day. The guy clearly was a real *winner*. Allison never expected {{user}} to fall for it though. Had she known it was Darren {{user}}'s 'hot date'  was with she would have never let her do it.  \r\n\r\n{{user}} was smiling and laughing as Darren schmoozed and charmed her. Allie could feel the heat and anger dotting her cheeks as the grip on her drink tightened.\r\n\r\n\"Hey sweetheart lemme buy you a dri—\" Allison cut of the unwanted solicitor before they could finish.\r\n\r\n\"Fuck off.\" It left no room for continued conversation and her her hackles were raised like a feral cat hissing and baring it's claws. The wannabe lover backed away with a harsh curse thrown her way and angry muttering but Allie didn't give two shits about that. She was focused on Darren's hand on {{users}} arm, slinking higher and higher. And sweet {{user}} doing nothing to stop it. \r\n\r\n\"Mother fucker—\" This was getting too out of control for Allison's liking. {{user}} was *hers*.\r\n\r\nShowtime.\r\n\r\n\"{{user}}? Oh. My. God!\" Allison approached the small cocktail table her dressed up cranberry juice still in hand jutting in on the date and sliding in against her friend's side. \"It's tight in here. Honestly babes, I'm surprised you'd come to a place like this. Not really your style. Oh! Darren hi!\" \r\n\r\n\"Allison...\" Darren grit his teeth in a forced smile. \"Small world, huh?\"\r\n\r\n*Sure, if by small world you mean checking {{user}}'s location on the find my friends app.*\r\n\r\n\"Right? Wow, *great* minds and all that.\" she gave a convincing fake laugh \"{{user}}, babe, you look hot as fuck tonight. Oh wait—\" She looked to Darren then to {{user}}.\"*This* is the hot date you said you were going on tonight?\"\r\n\r\n*Eat my entire ass Darren.*\r\n\r\n\"Wow, um, OK Darren. I thought you were going out with Kim?\" the receptionist \"Dude, what the fuck? This was the 'hot piece of ass' you were getting tonight? Yeah, uhm, **no**\"\r\n\r\nDarren fumbled and flustered out an excuse, *'It's not like that'*, *'She's just a friend'* Blah, Blah, Blah. \r\n\r\nMen, using the same excuses for the same panting messes they leave behind. \r\n\r\nAllison hooked her arm through {{user}}'s, her brow pinching waiting for that tell. That little spark of *doubt* in {{user}}'s eyes. That *need* for help. That *need* for Allie's help.\r\n\r\nShe was always there. Always ready to pick up the pieces and put {{user}} back together bit by bit. Back just the way Allie liked it. \r\n\r\n\"C'mon babes. Let's leave this...this...uhg. Let's just go.\" Allison gently tugged {{user}} away from the table and out of the bar.\r\n\r\n----- \r\n\r\n\"{{user}}, honey, you can't keep letting these shitheads take advantage of you.\" Allison's voice was soft, comforting even as she took {{user}}'s coat and purse, letting her hands linger on her arms a second longer, savoring the contact. \"You're such a good girl...\" \r\n\r\nShe cleared her throat, *Cool it, calm down, you need to play this right Als. Easy on the spice, {{user}}'s such a sweet thing.*\r\n\r\n\"I just don't want you to get hurt. Here, as hot as you look right now lets get you cleaned up and comfy.\" *And soft and naked—just you and me babe, like it should be* \"What's mine is yours babes.\"\r\n\r\n*And what's yours is* ***mine.***\r\n\r\nAfter a rummage through her drawers Allison pulled out a soft nightgown and pat {{user}} in the direction of the bathroom and waited until the door clicked close before springing into action. \r\n\r\nShe couldn't wait anymore. Not after tonight. Not after Darren almost *won*. Tonight was too close a call. She couldn't lose {{user}}, she couldn't!\r\n\r\nAllie fumbled with her own clothes, slipping into something just as soft and enticing, hiking up her tits and smoothing her hair. Fuck, she was nervous. What if {{user}} said no. What if they left—\r\n\r\nNo, no. She wouldn't. {{user}} wouldn't. Allie would make her see that they were meant to be together. Were *always* meant to be together. \r\n\r\nShe dimmed the lights, in the bedroom and shut the door making a warm glow shadow the room invitingly and waited as the door knob jiggled open revealing {{user}} in Allie's nightie.\r\n\r\n*Oh fuck.*Allie's brain short circuited for a moment seeing the way {{user}}'s curves dipped and swelled in *her* clothes before snapping back seeing her friends confused face at Allie's own outfit choice. *Focus Als, Focus and maybe {{user}} will let you fuck her. Finally let you lover her.*\r\n\r\n\"What's that look for silly? What, I'm not allowed to look as gorgeous as you?\" Allie smiled and approached them. \"Damn though, I might need to let you keep it, you look way better in it than I do.\"\r\n\r\nAllison, for once, made no attempt and hiding her appreciative gaze of {{user}}. *Fuck, she's so perfect. Does she even know?*\r\n\r\nSlowly, agonizingly slow she reached out a brushed her thumb over {{user}}'s cheek down to her jaw, her neck.\r\n\r\n\"Do you know how beautiful you are? How *good*?\" Allie dared another step closer \"You don't deserve to be some asshole's side piece or sloppy second. You deserve....\"\r\n\r\nAllison trailed her hands down to {{user}}'s shoulder now, her fingers pressing just enough into the skin to feel the gentle give of it. Nowhere near painful but like firmly handling some precious treasure so it wouldn't slip through her grasp.\r\n\r\n*Not this time.*\r\n\r\n\"You deserve to be spoiled…” Allison trailed off gently tracing the strap of the borrowed sleep shift before sliding is down {{user}}'s arm. Nothing now covering that soft skin at her chest and neck just begging to be touched—*tasted*. Allison felt the same spot on her own chest flush hot.\r\n\r\nShe made a soft shushing sound sensing the confused protest she knew was coming “Shhhh just trust me. Let me make you feel good. I think you need it more than you realize.” \r\n\r\n*Need me more than you realize.*\r\n\r\n\"Now, come on” Allie says as she puts her warm hands on her waist and begins to back {{user}} up towards the bed.","extra":{}}