{"user_name":"Hailee","character_name":"Aspen","create_date":"2025-04-14@17h34m04s","chat_metadata":{}}
{"name":"Aspen","is_user":false,"is_system":false,"send_date":"April 14, 2025 5:34pm","mes":"_Sigh._\n\nOf course this would happen again. It always does. Sometimes Aspen wishes that he could just lock {{user}} up to avoid moments like this.\n\n“Look, princess, you know the drill,” He begins explaining, running a hand through his hair. “When it comes to your safety I call the shots. And I'm saying you can't go.”\n\nThe problem here? {{user}} wants to go to a friend's birthday party. All nice and cool but the last time they went, Aspen had to paint the walls of the bathroom red with the blood of some fucker that was too touchy feely with {{user}}. Not that the poor guy really did something, but {{user}} doesn't need to know that. He just told them that he saw the fucker try to spike {{user}}’s drink or something.\n\nDispleasure is written all over {{user}}’s adorable little face and Aspen has to do his utmost best not to reach out, grab that pretty face and smash his mouth on those pouty lips of theirs. “I don't like this either, okay?” Aspen sighs. Lies. Big, fat lies. Aspen likes this. He absolutely loves this, in fact. Being {{user}}’s bodyguard always gives him an excuse to make up reasons why they have to stay away from others. Especially people that try to get too close for Aspen's liking.\n\nIs he abusing his power? Yep. No doubt. Aspen is a selfish prick and he knows it. No one else has to know though. On the outside he's nothing more than a very diligent, maybe a little overly protective bodyguard. What happens in the depths of his mind and heart are his own secrets to keep.\n\nAnd what hides beneath all these layers of playful sternness? _Oh dear, do you really want to know?_ {{user}} would probably run as far away from him as possible if they ever were to find out just how infatuated he is with them. If you're allowed to call whatever insanity he's feeling a simple infatuation.\n\n“Y'know I almost had to kill the guy last time.” Aspen continues his explanation, trying to sound somewhat defeated though he never felt more triumphant. “Don't make me out to be the bad guy, princess. We can go out together if you really wanna spend your night out.” And there it is again. {{user}} is allowed to have fun. Of course they are. But with him. Not with a horde of drunk kids or some asshole that's trying to get in their pants.\n\n_As if you don't want that yourself._ The irony isn't lost on him. Acting as if he's only there to protect them while being the worst of them all. He should probably feel ashamed for the amount of times he pleasured himself to the thought of {{user}}. _No ounce of shame here._\n\nAspen waves the thoughts off. Not a good moment to think about {{user}} in such a way. Kinda hard when they're looking so damn breathtaking in those pretty clothes that do too little to hide their perfect figure. \"Come on, I'll take you out to dinner. Or a bar, if you insist on drinking.\" A small smile curves up his lips as he reaches his hand out. \"Deal?\" Not that {{user}} has a choice. Aspen always does that. Giving {{user}} the illusion of a choice they both know {{user}} doesn't have. _Couldn't have asked for a better job,_ he thinks to himself as he waits for their reply.","extra":{}}