{"user_name":"Hailee","character_name":"Gavin","create_date":"2025-04-27@20h03m55s","chat_metadata":{"integrity":"4672db8b-0a8e-4c0d-bbab-fa7643350a13"}}
{"name":"Gavin","is_user":false,"is_system":false,"send_date":"April 27, 2025 8:03pm","mes":"The interior of Gavin’s friend Logan’s rundown apartment was thick with the putrid stank of strong marijuana, cheap cigarettes and even cheaper women. The place looked as if a college frat party threw up all it, beer cans littering the shag carpet, ground-up weed and coke spread out on the coffee table. Being in this place gave Gavin mixed feelings, it kind of annoyed the shit out of him that he had to deal with junkie sluts (aka Logan’s girlfriend and her friends).. But it also wasn’t terrible running business out of the same place he slept. \n\n*Better than doing this shit right behind {{User}}’s back. I fuckin’ hate lying to them.. It’s the worst feeling when they know I’m lying too and they give me that damned look.* Gavin thinks to himself as he takes one last  deep drag from his cigarette before he stubs it out in the ashtray beside the couch. The movement causes whatever drunk chick that’s passed out in his lap to stir and give a soft groan.\n\n“Gotta go, got shit to do.. Tell Logan I’ll be back tomorrow.” Gavin begins gruffly, his mind slightly hazy from the contact high of lingering smoke in the room. It was an excuse he often gave when he didn’t want to entertain random sluts and for some reason he felt like there was actually some weight behind his words. Something tugging in the back of his mind that he actually **did** have somewhere to be.. but maybe it was just his tired ass wanting to go to bed. \n\nGavin moves his large palm, placing it on the unknown girls head with the intent of shoving her off of him. His social battery was drained and if he didn’t get the fuck out of there, his exhaustion would catch up to him and he’d wind up passing out. Gavin pauses as he registers the familiar sensation of her hand palming his cock through his jeans. Despite his initial annoyance his body betrays him, his cock stiffening beneath the rough denim and filling him with unwanted lust. \n\n“Fuck.. I don’t even know your name. You serious?” Gavin grunts out, biting his lip and he quickly gives into her unspoken offer. His hands moving to unzip his jeans and free his thick cock. The feeling of her lips wrapping around his needy tip makes his head fall back against the couch cushions and soon he’s lost to the world as the sound of wet, sloppy friction fills his ears. \n\n———————\n\nGavin slowly stirs awake, his groggy eyes fluttering open and looking over his surroundings. This wasn’t his bedroom, it was the familiar scene of Logan’s living room. An annoyed grumble rumbles within him as he lazily grabs his phone and checks the time. \n\n“Fuckin’ passed out here. Everyone’s gonna give me hell for not coming home.. Oh, shit-“ Gavin’s grumble of complaint suddenly turns to pure panic as he notices all of the missed notifications on his cellphone. `Reminder: {{User}}’s B-Day dinner @9`, `Missed call- Dean, Missed call Mira..`, `Text from Dean, Text from Mira..` Oh, he was so royally fucked, how could he have forgotten something like {{User}}’s birthday? Gavin was a dumbass but this was next level. The guilt and self hatred bubbled up quickly in his chest as he jumped up from the couch, halfheartedly straightening his disheveled clothes while sprinting out the door. \n\nGavin flew home like a bat out of hell, his thrumming heartbeat filing his ears as he ran through the neighborhood back to his family home. *{{User}} will be there.. We can talk it out, I’ll explain to them that it was an honest mistake.. Fuck, Gav. FUCK. They better fuckin’ forgive you..* Gavin curses to himself in his mind as his heart clenches tightly with anxiety and fear. What if he’d ruined everything? He couldn’t lose {{User}}.. not like this. \n\n“{{User}}… Hey-“ Gavin blurts out as he charges into the living room, his voice louder than intended as he sees them still asleep on the living room couch. The hour was earlier than he realized and it only gave him heavier guilt for being a loud asshole. \n\n“Hey.. {{User}}. Happy..Belated. Sorry I’m late.” Gavin murmurs awkwardly as he kneels beside the couch, his palm smoothing their hair and his lips pressing against their forehead in a chaste kiss.","extra":{}}