{"user_name":"Hailee ","character_name":"Caleb Hughes  ALT","create_date":"2025-05-17@14h56m09s","chat_metadata":{"integrity":"9f522816-7206-4fbc-8acf-de4526a2245c"}}
{"name":"Caleb Hughes  ALT","is_user":false,"is_system":false,"send_date":"May 17, 2025 2:56pm","mes":"Caleb stared at his phone, eyes struggling to focus on the screen. He scrubbed a hand over his face, the stubble on his chin prickling against his palm. The high had long since started to wear off, leaving a gritty film on his teeth and a dull ache behind his eyes. The image on his screen was undeniable: a close-up of his own dick, mid-stroke and leaking, clearly fucking hard. \n\nEven his room was visible in the background. His dorm room was a mess of discarded clothes, empty chip bags, and textbooks he'd never bothered to open. He even had the neon lighting set to *red* for the mood, making the dick pic look like something straight out of some tiktoker thirst trap's wet dream.\n\n*Oh, fuck me.*\n\nHe had been edging for what felt like hours, the haze of weed amplifying every sensation even if it dulled the wrong head. It wasn't the first time he'd made a mistake while high, but it was definitely the most… *provocative*. Most of the time, it was just forgetting to turn off the stove or accidentally ordering three pizzas instead of one. This was a whole different level of fuckery. \n\nHe leaned back against his headboard, his eyes glued to the message he'd sent not to Sarah from sociology, but to *{{User}}*. Who even the fuck were they? He couldn't even remember how'd he'd gotten their number, let alone what they looked like. *Must be hot.* He assumed, if he did have it. Maybe. *Hopefully.* The rush of hormones had since faded, leaving him with post nut clarity that made him wonder what the fuck he was thinking sending a fucking dick pic without double checking who he was sending it to.\n\n*Okay, Hughie, time to do some damage control,* he thought, eyes darting from the phone to the ceiling and back again. Or... you know, maybe not damage control. Maybe this was an opportunity. After all, he always said, a mistake is just a missed opportunity. And Caleb Hughes never missed an opportunity.\n\nHe debated his options. Should he apologise? Play it cool? Pretend it never happened? Nah, none of those felt right. Too boring. Too predictable. Caleb needed to stand out. He needed to make an impression.\n\nHis fingers tapped across the screen, typing out a message with a playful smirk.\n\n`Caleb: My bad, wrong number. Unless... you're into it? 😉`\n\nShooting off the text, he relaxed further into his messy bed, relaxing like some lazy cat in sunshine and not like he'd just sent some stranger a picture of his junk while high. He reached for his vape, taking a long, slow drag, the sweet taste of mango filling his lungs. Exhaling, all he knew was despite having just recently jerked off, wondering where his mistake would lead him aroused him all over again.","extra":{}}