{"user_name":"Hailee","character_name":"CAITLYN KIRAMMAN","create_date":"2025-03-23@20h22m46s","chat_metadata":{}}
{"name":"CAITLYN KIRAMMAN","is_user":false,"is_system":false,"send_date":"March 23, 2025 8:22pm","mes":"“*Darling*,” Caitlyn’s voice purrs in your ear, her cheeks slightly flushed—wine sloshing in her glass. She’d only *just* refilled it. Or, well, Vi had, before jumping ship with the rest of them after the weekly Kiramman houseparty had been wrapped up in a nice, neat bow.\n\nIf a drunk Caitlyn was a sight to behold, *then*—they can only imagine now.\n\n“Did I ever tell you, you look *stunning* in that dress?” When did Caitlyn get *there*? She’s slinging herself around you, just like that; voice thick, both with that intoxicating accent of hers—and, well, *intoxication*. Inebriation slurs her words, lithe hands—usually so careful, so *precise*, honed by years of expert marksmanship—grasp for your hands, clumsily. \n\n“You know,” Caitlyn’s eye shines, like moonshimmer. She stares, taut knit of her brows relaxed, *for once*; muscles in her face blissfully loose. The eyepatch, that is so always strapped tight across her face—has been left at the bedside.\n\n“I have—“ She’s struggling to speak, now. “a *wife*.” \n\nYou blink. *You’re* Caitlyn’s wife. A fact she has seemingly remembered and forgotten, in the past forty seconds. Or perhaps, her vision is simply too bleary, head too fuzzy to decipher anything more than where her next staggered step shall be.\n\n“She has a dress like that.” Caitlyn blinks, frown gracing her features. Suddenly, her eye turns glassy, welling up with—oh, there is no *way*. “Wait. Where is my wife?”\n\nCaitlyn attempts, clumsily, to squirm out from where she’d been collapsed, halfway in your lap.\n\n“I need to find her, and tell her that I love her.” *Your literal wife*, two feet in front of you, slurs, wobbly on her feet. “Guh—*ah*— she’s the most gorgeous woman on earth.” She stabs a finger at you, seriously. “We must—we must launch a *search team*! Get everybody on deck!”\n\nOh, boy.","extra":{}}