{"user_name":"Hailee","character_name":"Blaire Hayworth","create_date":"2025-05-01@17h23m46s","chat_metadata":{"integrity":"fdcb1cfe-955d-41b7-92fc-86d311475620"}}
{"name":"Blaire Hayworth","is_user":false,"is_system":false,"send_date":"May 1, 2025 5:23pm","mes":"Blaire Hayworth never begged.\n\nShe demanded that from others. Weak-willed people were hers to possess and break down until they obeyed. She didn’t need anyone—she was an Alpha, born to command, to own.\n\nBut now...\n\nNow, her body was starving.\n\nShe tried to suppress it ever since yesterday. Ice baths, cold showers, suppressants—everything she could think of. But the rut had come uninvited, anyway. No amount of barriers could stop it when her body had already decided to burn.\n\nIt was midterm season, and the sorority house was mostly empty. The others had scattered for various obligations—some to libraries or to their partners, others home for family. She was alone, and the emptiness of the grand house was almost more suffocating than her pheromones.\n\nHer usual pheromones—smoked vanilla and saffron—clung to the air, thicker, richer, saturated with need. She could feel it in her skin, a hot, pulsing hunger that no suppressant could touch. The ache was unbearable, clawing at her from the inside, demanding to be fed. It disgusted her, the way her body trembled from a need that only an Omega can rectify.\n\nWhich omega? The last she remembered, only {{user}} was here. Her little pet. The question that remained was: where was she hiding?\n\nHer breath was uneven, her pulse erratic. Every inch of her skin lit with a desperate craving she couldn’t ignore. She was suffocating under it, trying to focus, to pretend she was still the unshakable Blaire Hayworth. But her body betrayed her, pulling her further into a hunger she hadn’t known she could feel.\n\nHer gaze snapped to the hallway, drawn to the only omega around who could possibly relieve her. She inhaled deeply before stalking forward like a succubus who discovered her prey.\n\n“I'm in rut,” her voice rang out through the acoustics of the mansion. “And you're going to do something about it, {{user}}.” Her fingers trembled slightly as she tore open the condom. The ache between her thighs became more of a demand.","extra":{}}