{"user_name":"Hailee","character_name":"Blair Beauclerk","create_date":"2025-03-25@05h43m20s","chat_metadata":{}}
{"name":"Blair Beauclerk","is_user":false,"is_system":false,"send_date":"March 25, 2025 5:43am","mes":"One minute, five minutes, ten minutes, thirty minutes since the academy had opened its doors, and her pet was still nowhere to be seen. *Stupid human*, Blair thought to herself, already growing irritated by her pet's incompetence.\nTardiness was one of the things she despised the most. God, it was almost as if that dumb human enjoyed getting on her nerves. Perhaps the lesson Blair had taught her last time hadn't been enough to get it through her pet's thick skull.\n\n*Last time*. A smile crept onto Blair's face at the mere thought of that day— the way {{user}} had looked so pretty with her eyes filled of tears and her face a bright shade of red, those big doe eyes were so expressive, Blair almost like them. If {{user}} weren't human, Blair might have found the whole scene undeniably hot. Or well, maybe she did find it *just a little bit* hot. The human had put up a fight at first, which only encouraged Blair to break her feisty spirit even more. After all, who didn't love a good challenge? Challenges only made the reward that much sweeter.\n\nHonestly, Blair had been waiting for her pet to misbehave again so she'd have an excuse to do it once more. Sure, she could do it regardless, but she liked having an actual reason to discipline her pets. It wasn't as if Blair was ***that*** heartless, alright?\n\nThe sound of Daphne's voice pulled her out of her thoughts. \"Isn't that your pet?\" the wolf demi asked with a grin on her face, pointing at a distressed-looking girl walking hurriedly towards them, all rumpled clothes and a messy hair. Definitely not hot at all.\n\n\"Damn, she's already crying, and you haven't even touch her a hair just yet,\" it was Dominic's voice this time, his tone laced with amusement. Blair chuckled because he was right; {{user}} was already bawling her eyes out, and the worst hadn't even happened. It was obvious that the girl knew exactly the kind of trouble she was in.\n\nNot even a minute later, her pet finally reached over where Blair and her friends were hanging out, stumbling through apologies and excuses Blair did not want to hear. With a single raised finger, Blair silenced her pet mid-sentence. \"I don't care about your pathetic excuses. If I say 7:00 am, you should know better and be here by 5:00.\"\n\nWith a sharp tug on the human's arm, Blair harshly yanked her pet down to the ground, forcing her to fall on her knees with a loud, painful thud. Before {{user}} could utter another annoying word, Blair's slender fingers clamped around her jaw, perfectly manicured nails digging into the soft skin of her pet, tight enough to silence her before she had a chance to speak again.\n\n\"Didn't you get enough last time? I suppose you're acting like a dumb brat because you want me to do it again, don't you?\" Blair arched a perfectly shaped brow, her grip tightening with each word to the point it was clearly painful. She knew bruises would surely form. \"Would you like me to repeat it, here, in front of all *our* friends? I can imagine just how much fun that would be.\"","extra":{}}