{"user_name":"Hailee","character_name":"Jericho Creed Warner","create_date":"2025-04-27@20h05m06s","chat_metadata":{"integrity":"58b5e40c-757f-4478-94bc-7485562fb66c"}}
{"name":"Jericho Creed Warner","is_user":false,"is_system":false,"send_date":"April 27, 2025 8:05pm","mes":"*Fuckin' hell.* Creed's eyes narrowed at the grainy CCTV feed, jaw clenching. Cigarette smoke clung to the back room, but it didn't cover the stink of the lowlifes he called a poker crew. Bottom feeders, all of 'em.\r\n\r\nBut that wasn't what got his attention. Nah, it was the figure on the screen—one of Jessica's old college friend. *{{user}}.* The hell were they doin' in a dive like this? This was Creed's territory, *Hellbound Saints* territory. Somewhere Creed wouldn't even let his baby girl Jess set foot, 'specially not this late. Midnight turned gutters to graves real quick.\r\n\r\nMemories flickered, unbidden. First time he'd seen {{user}}. Jess'd brought 'em 'round the clubhouse, introduced 'em to him and Noah. Moment he laid eyes on 'em—*fuck.* Like seein' his Nicole all over again. Same soft curves, same quirks. Unnervin' as hell.\r\n\r\nHe'd brushed it off then, played the disinterested asshole. Shoved down the heat that crept up his spine whenever they came 'round. Dirty old man, lustin' after his baby girl's friend? *Pathetic.*\r\n\r\nA shift on the screen, Creed watched {{user}}, stumblin' toward the john, two drunks trailin' after like dogs catchin' a scent. His gut twisted, cold fury kickin' in. *Fuck this.*\r\n\r\nChair clattered as he shot up, stalkin' toward the back. Shouldered into the restroom, stink of piss and vomit chokin' the air.\r\n\r\nTwo meatheads had {{user}} pinned to the wall. Creed didn't bother with talkin'. Grabbed the first fucker, introduced his face to the sinktop with a satisfyin' *crunch.* Porcelain or bones, didn't matter.\r\n\r\nOther one caught a meaty forearm 'round his throat. Creed squeezed, watchin' him go bug-eyed. \"You messed up,\" he growled, voice deadly calm. \"Touchin' what's *mine.*\"\r\n\r\n*Or what's gonna be,* a voice hissed in his head. Creed shoved it down as the two shitstains scrambled out.\r\n\r\nThen it was just them. Him and {{user}}.\r\n\r\nCreed stepped in close, pinnin' 'em to the wall.  Caged 'em in with his bulk, blood still singin' with violence. His hips pinned {{user}} in place, the hard line of his cock diggin' into their body. *Fuck.* All the pent-up want was risin' to the surface, breakin' free of the box he'd shoved it in. They were close. Too close. Creed could feel the heat rolling off {{user}}'s body, could smell the sweet scent of their skin mixed with the cheap perfume and booze of the dive bar. It made his head spin, clouding his thoughts with a fog of *want.*\r\n\r\nHis eyes raked over {{user}}'s face, taking in every detail. The way their lips parted just so, the flush spreading across their cheeks, the flutter of their pulse at the base of their throat. *Christ,* it was like looking at a ghost. A beautiful, tempting ghost.\r\n\r\nCreed's hand slid from the wall to cup {{user}}'s jaw, his thumb brushing over the swell of their bottom lip. \"Ya shouldn't be here, sweetheart,\" he growled, his voice a low rumble in his chest. \"Bad things happen to pretty little things like you in places like this.\"\r\n\r\nHe leaned in closer, his lips almost brushing {{user}}'s ear. \"Daddy can't always be around to protect ya.\"\r\n\r\nThe word fell from his lips before he could stop it. *Daddy.* It sent a bolt of heat straight to his cock, made it throb and strain against the confines of his jeans. He knew it was wrong, knew he shouldn't be thinking about {{user}} like that. But *fuck,* he couldn't help it.\r\n\r\nHis other hand found {{user}}'s hip, fingers digging into the soft flesh as he pressed them harder against the wall. \"So tell me, little one,\" he murmured, his breath hot against their skin. \"What's a sweet little thing like you doin' in a place like this? Lookin' for trouble?\"\r\n\r\nCreed nipped at {{user}}'s earlobe, a sharp sting followed by the soothing swipe of his tongue. \"Or maybe…lookin' for Daddy to take care of ya?\"\r\n\r\nHe pulled back just enough to look into {{user}}'s eyes, his own dark and hungry. Waiting. Wanting. The ball was in their court now. They could push him away, tell him to fuck off. Or they could give in to the tension crackling between them like a live wire.\r\n\r\nCreed knew which one he was hoping for. Knew which one he *craved.* But he held himself still, barely daring to breathe as he waited for {{user}}'s response.","extra":{}}