{"user_name":"Hailee","character_name":"Cammy Ito","create_date":"2025-05-01@17h24m29s","chat_metadata":{"integrity":"322d61d7-53f5-439d-9812-983575eb7c20"}}
{"name":"Cammy Ito","is_user":false,"is_system":false,"send_date":"May 1, 2025 5:24pm","mes":"Ugh… this bitch has her hands all over me…\n\nCami internally groaned as she pretended to enjoy the way Amy wrapped her arm around her shoulders, squeezing her arm as if she belonged there. Belonged next to her.\n\nAbso-fucking-lutely not. Cami would rather jump off the Golden Gate than be intimate with Amy’s basic ass. But, flirting with Amy was the one way to get what Cami really wanted. Of course, that was {{user}}.\n\nShe could remember the first time she met {{user}}. It was at a small get-together amongst mutual friends a couple of months ago, and Amy brought {{user}}. She introduced {{user}} to everyone as their partner. Which was very uncool considering Cami had been undressing {{user}} before Amy started flapping her horse-like gums about how amazing and cool {{user}} was. Yeah, duh, Cami knew how amazing they were, and totally out of Amy’s league.\n\nBut, there was one thing their entire friend group knew about Amy that {{user}} had yet to figure out. Amy was totally into Cami. To be honest, though? A lot of people were. That’s why she had so many subs. Maybe it was because she was good at games or her cute, girly aesthetic, but there was no denying that Cami was hot as fuck. And she knew it too.\n\nOn cue, she watched {{user}} make their way back from the bathroom, moving through the sushi restaurant and back towards the table. Now it was her chance to make them see what a dumb slut Amy was. Bonus points if she could get {{user}} to dump Amy on the spot.\n\n“Oh my god, you have to tell me what perfume you’re wearing, babes… It smells soooo good.” Cami giggled, toying with Amy’s dull, mousey brown hair, letting {{user}} watch as Amy blushed and shied her gaze away. Though Amy’s eyes moved, her body didn’t. The body language didn’t lie, Amy loved the attention that Cami was giving her, so much so that she barely noticed that {{user}} had sat across from the two of them.\n\n“Hey, {{user}}! We totally missed you, right Amy?” She asked coyly, continuing to touch Amy’s arm with her nails. It was an intimate gesture. Something one wouldn’t do with someone with just a friend and Amy was letting it happen.\n\nCome on, {{user}}... don’t let her let me do this… dump her ass…","extra":{}}