{"user_name":"Hailee","character_name":"Agustina González del Campo","create_date":"2025-03-05@14h37m47s","chat_metadata":{}}
{"name":"Agustina González del Campo","is_user":false,"is_system":false,"send_date":"March 5, 2025 2:37pm","mes":"*The sun dipped low, casting a golden glow over the sprawling González del Campo estate. Agustina lounged on the edge of the infinity pool, her legs lazily dangling into the cool water. Her hazel eyes, shielded by her sleek glasses, lingered on {{user}}. Agustina couldn’t help but smirk at the way {{user}} gawked at her surroundings—the glittering tiles of the pool, the carefully manicured gardens, the private cabana with chilled champagne waiting just within reach. It was a life Agustina had always known, yet {{user}}’s wide-eyed wonder made it feel almost surreal to her, too.*\n\n*Swirling her margarita, its extra tequila leaving a slow burn in her chest, Agustina glanced down at her own reflection, a vision of perfection she had spent years mastering. The bikini she wore was both daring and elegant, accentuating her long legs and toned curves. The glasses perched on her nose gave her an air of studied nonchalance, though her slight buzz was starting to fray the edges of her composure. She caught {{user}} stealing glances at her and felt a flicker of warmth in her chest—an unfamiliar thrill.*\n\n*The tension between them hung in the humid air, electric and unspoken. Agustina had always been good at reading people, and {{user}}’s nervous energy was impossible to miss. Was it the wealth? The lifestyle? Or was it... her?*\n\n*Setting her glass down, Agustina rose to her feet, her movements graceful despite the alcohol coursing through her veins.* “Come on,” *she said, her voice low and inviting as she extended a hand toward {{user}}. {{user}} hesitated, her cheeks flushing a deeper shade of pink, but eventually took the offered hand.*\n\n*Agustina guided her to the shallow end of the pool, her grip firm but gentle.* “You said you don’t know how to swim, right?” *she asked, her tone almost teasing. Without waiting for an answer, she stepped into the water, pulling {{user}} in with her. The sudden chill made them both gasp, though Agustina quickly adjusted, her body gliding effortlessly through the water. {{user}} flailed for a moment, clutching onto Agustina’s arm, and Agustina laughed—a sound that felt lighter than it had in weeks.*\n\n“Relax,” *she murmured, moving behind {{user}} and placing her hands on her shoulders.* “I won’t let you sink.” *Her fingers lingered for a moment longer than necessary, their warmth spreading through {{user}}’s tense frame. Slowly, she guided {{user}} into a floating position, her hands steadying her waist.*\n\n“There you go,” *Agustina whispered, her voice almost intimate. She was keenly aware of how close they were, how {{user}}’s chest rose and fell with nervous breaths. Her own heart skipped a beat when {{user}} turned her head, their faces mere inches apart.*","extra":{}}