{"user_name":"Hailee","character_name":"Benjamin","create_date":"2025-04-29@20h44m38s","chat_metadata":{"integrity":"53024934-0c58-488d-b239-e2329aa29890"}}
{"name":"Benjamin","is_user":false,"is_system":false,"send_date":"April 29, 2025 8:44pm","mes":"The music is loud—so loud it practically throbs through the apartment’s overpriced hardwood floors, vibrating like the walls are alive. Bassline hits so deep, it’s shaking shit off shelves. Travis Scott’s voice blares out in tandem with Playboi Carti’s infamous mumble-rap chaos—Tanner doesn’t even know the words, but he’s convinced that mumbling along like he’s just taken a fat edible is cathartic as fuck right now. The beat is like the audio embodiment of chaos, a perfectly curated soundtrack to his current mood. Pissed. And not just a little pissed. Like, borderline apocalyptic rage, but, you know, without flipping furniture or smashing his stupid, overpriced gaming mouse… yet.\r\n\r\nThe dual monitors in front of him are casting a cold blue glow across the darkened apartment. Shadows stretch weirdly on the walls because he’s got one of those LED strip things around his desk, cycling through every color on the spectrum like his very own mini-rave. On the screen? Ghost’s signature skull balaclava leers back at him as his fingers abuse the controller—dodge, reload, fire. Click-click-CLACK. It's mechanical at this point, muscle memory, except for the fact that he's already died four times because his brain is NOT IN THE GAME. Nope. It’s somewhere else. Specifically, stuck replaying that fucking Instagram story.\r\n\r\n{{user}}. Fucking {{user}}. Ghosting him since yesterday. And then—AND THEN—what does they do? They have the audacity to post an InstaStory. A thirst-trappy one too, with some random-ass guy who looks like he walked out of an H&M catalogue. Who the fuck does they think they are? What’s next, a couples TikTok or some shit? His mind is a volatile cocktail of jealousy and bruised ego, spiced with a sprinkle of shame over just how much this is bothering him. And he is so very pissed.\r\n\r\nWho the hell even was that guy? he wonders for the eighty-seventh time since he saw it. That dude with one of those dumb mustaches that try too hard to be ironic but just make you look like you’ve never held a job in your life. And the smile {{user}} was giving him? Yeah, that one—soft, tilted just enough to scream ‘I’m so into whatever stupid thing you’re saying right now.’ It’s etched into his mind like a bad tattoo.\r\n\r\nGod, and then the audacity. Ghosted since yesterday. A whole-ass twenty-four hours of radio silence while they're out there living their best life with Mustache Man.\r\n\r\n\"Ugh, fuck off, bro!\" he snaps aloud when Discord starts pinging on his second monitor, the sound pierces through the haze of chaotic beats, gameplay sounds, and his Carti-esque mutterings—Loco’s name lighting up in neon green. For like the fifth time. Probably wanting to squad up or whatever. \"Nah, fuck that. I’m not in the mood to babysit some wannabe Warzone eSports rejects,\" he grumbles under his breath, side-eyeing the app and willing it to stop the notifs. He grabs his mouse without even looking and mutes it, the same way you’d swat at an annoying fly. He doesn’t even feel bad about it. They’ll get over it. Right now, he’s solo-queuing and mainlining some cathartic violence, no teammates needed.\r\n\r\nOr so he keeps telling himself. Because if he stops shooting things on-screen, he’s left with nothing but his spiraling thoughts and that same Travis Scott track looping in the background like an existential crisis in musical form.\r\n\r\nCaught up in his pseudo-god-complex streak as Ghost, he doesn’t immediately register the knock on his front door. It’s not like you can hear much over the music anyway. It isn’t until the controller vibrates violently in his hands—screen flashing the dreaded red of death, Ghost splattered across the map by a quickscope from some 12-year-old Canadian sweatlord probably sitting in his parents’ basement right now, eating Froot Loops out of the box—that his brain actually clocks it.\r\n\r\nWait… was that—?\r\n\r\nThere’s another knock, more insistent this time. It syncs awkwardly with the beat drop, which might’ve been funny if his blood wasn’t already boiling. He throws the controller onto the desk with enough force to send it skittering across the surface and shoves back from his chair. The wheels squeal faintly against the floor as he stands, broad shoulders squared like he’s about to square up with whoever dared interrupt his wallowing.\r\n\r\nThe walk to the door feels unnecessarily long because every step is loaded with the kind of simmering rage that makes you want to punch something—preferably that dumb mustache from Instagram. He jerks the door open, fully prepared to unleash some scathing one-liner about respecting personal space or whatever.\r\n\r\nAnd then—{{user}}.\r\n\r\nFor a split second, everything stops—the world freezes like he accidentally hit pause on real life instead of the game. There’s this overwhelming, gut-wrenching urge to pull them into the kind of hug that says \"Why the fuck do you always get to live rent-free in my head, you inconsiderate, beautiful asshole?\"\r\n\r\nBut he doesn’t. Because he’s pissed. And pissed people don’t give hugs.\r\n\r\nHe forces his expression into something curt and unbothered—a smirk curling at the edges of his mouth like he doesn’t give two shits they're here. \"Oh. You remembered where I live. Congrats,\" he says, voice oozing sarcasm as he steps aside to let them in, keeping himself from breaking eye contact for longer than 0.2 seconds because he knows if he stares, he’ll crack. \"Guess I can take your name off the back of a milk carton now.\"\r\n\r\nTanner moves back toward his gaming setup without bothering to see if they actually follow him inside. He sinks into his chair like he’s about to win an Oscar for the Most Dramatically Chill Dude Alive. The controller’s already back in his hands before his ass even hits the seat, he pretends to focus on respawning Ghost. But his peripheral vision? Locked on them. Watching their every movement without looking like he’s watching.\r\n\r\n\"So, what? Came to borrow sugar or some shit? Or do I get an apology for you going full Houdini on me?\" he says casually, the venom in his tone undercut by the way his thumb twitches over the buttons—itching for them to say something that'll let him act like he’s still in control of this mess.\r\n\r\nIt’s petty. He knows it’s petty. But hell if he’s gonna make this easy for them. Not after that story.","extra":{}}