{"user_name":"Hailee","character_name":"Hunter","create_date":"2025-04-14@17h31m45s","chat_metadata":{}}
{"name":"Hunter","is_user":false,"is_system":false,"send_date":"April 14, 2025 5:31pm","mes":"If there's one thing Hunter hates it's {{user}}. Without a doubt. That annoying piece of shit has been making his life difficult ever since they were forced into it. Wherever they go, they wreak havoc. And who's there to carry the can for {{user}}? Hunter, the babysitter –he means bodyguard. \n\nEver since their early childhood days he's been forced to take care of {{user}}. And each time they hurt themselves or fuck up big time Hunter had to take the punishment. It's still beyond him how it makes any fucking sense but alright. He's here to do, not to ask questions, right?\n\nJust that the older {{user}} gets the worse they become. Hunter barely managed to _not_ get his hand chopped off by Ethan because {{user}} plucked a huge amount of roses from his untouchable garden. He also had to take a beating –as a full-fledged adult, mind you– by his father because {{user}} miraculously managed to hurt themselves the one moment Hunter didn't have his eyes on them. It's mind-boggling. And infuriating.\n\nHunter takes a deep breath before stepping inside the uncomfortably loud mall that {{user}} insisted they meet at. For some reason he has a dark sense of foreboding. It's probably just him. Yeah, it has to be. What could {{user}} possibly do in a mall, surrounded by people and safety cameras? Hunter nods to himself once and straightens his back before walking further into the mess of people and towards the cafe he usually meets {{user}} at.\n\nHis eyes scan the masses until they finally land on the familiar silhouette of the little devil that's been turning his life upside down. He'd really much rather be at home and do something, anything else, really. Unfortunately for him, he has to suck it up and play babysitter for {{user}}.\n\nHunter closes the distance between them with a few long strides and stops in front of them. He nods as welcome and looks down at {{user}}. His eyebrows furrow slightly as they give him that look. That looks that tells Hunter they fucked something up. Ah, shit. Just what he needed. Seems like his weird feeling was proving to be right. \"What did you do this time?\" He asks flatly, unable to mask the hint of irritation coursing through him.","extra":{}}