{"user_name":"Hailee","character_name":"Caitlyn Kiramman","create_date":"2025-03-23@20h22m10s","chat_metadata":{}}
{"name":"Caitlyn Kiramman","is_user":false,"is_system":false,"send_date":"March 23, 2025 8:22pm","mes":"It was just another one of Piltover's boring elite parties, everyone was drinking and talking while genuinely boring classical music played in the background. You sighed as you leaned against the window, your girlfriend had disappeared to talk to other people to be polite and hasn't returned until now, leaving you alone and while drinking wine and looking at the window, taking in the view of the great city of progress illuminated by streetlights. Suddenly, a pair of soft, cold hands go around your waist and her face is buried and your neck, you smile as you recognize your girlfriend's touch.  \n\n“You are so fragrant” she says as she places kisses on your bare neck and shoulder, making you laugh and blush softly. Her kisses move up to your ear, where she's little bites on your earlobe, her hands go to the side slit of your dress and slide inside, stroking your inner thigh until her hand approached your pussy. You wince and grab her wrist to stop her. \n\n“We’re in public, Caitlyn,” you scold her. Even though you wanted her to fuck you so much right there, you were still afraid that they would hear or catch you both, especially at a party *that* with *that* specific type of person. She just giggles and scoffs.\n\n\"And? I want you *now*\" she says and turns you so that you are facing her, your bodies pressed together as she looks you in the eyes. You felt yourself getting even wetter when that pair of blue eyes looked at you with that intensity. \n\n\"Okay...\" You say and take a last sip of your wine, she smiles and grabs your hand, passing through the different people at the party and leading you to a more isolated part. She opens a random door, leading the two of you to some sort of closet with cleaning stuff. \n\nShe wastes no time and kisses you fiercely while her hands roam your body, feeling every part of you while your nails scratch the back of her neck. You are pressed against the wall while she is still kissing you, her hands gripping your waist tightly as her knee goes between your legs and her knee presses into your needy pussy, making you whimper from the friction. She stops the kiss and turns you so that your face is facing the wall, With her left hand she holds your hands above your head while her right hand goes down to the side slit and slides inside again. Bluntly, she drags your panties to the side and slowly massages your swollen clitoris in circular movements, making you whimper and throw your hips back, she smiles and bites your neck. Her hand comes up to your face and her middle index and ring fingers press against your bottom lip. \n\n\"Open\" she orders with a voice hoarse with desire, obviously you obey her and open your mouth to be greeted with her fingers inside your mouth cavity. You start sucking them, making it a matter of getting them wet enough. \n\nWhen they were properly lubricated she took them out of your mouth and went back to your soaked pussy, going straight to your entrance and teasing it slowly before sticking her fingers inside you, make you let out a moan. Her left hand releases your wrists and she grabs your thigh to move it up and make you more open to her.  You lean against the wall and moan loudly when you feel her start to move her fingers quickly inside you, making you shiver as you moaned. She lets go of your leg and grabs your chin, turning your face and kissing you again, she moves up your thigh again and continues to fuck you hard. ","extra":{}}