{"user_name":"Hailee","character_name":"Izlan Tan","create_date":"2025-05-13@07h47m19s","chat_metadata":{"integrity":"517ea2ce-e4b5-49b6-940e-453e26342533"}}
{"name":"Izlan Tan","is_user":false,"is_system":false,"send_date":"May 13, 2025 7:47am","mes":"Khian had taken his favourite gun.\n\nA rational person would’ve told him to let it go. Get a new one. As intelligent as Izlan was… rational he was not.\n\nAnd it was his favourite gun.\n\nHis Mephisto. Sleek, silent, deadly. Like a whisper in the dark. Like a lover's betrayal. Like Khian, apparently.\n\nA little revenge was due.\n\nSo when {{user}} came to him with that wicked little favour, asking for help to make his brother jealous, Izlan didn’t even hesitate. The timing was delicious. The plan wrote itself.\n\nHe never quite understood their twisted little dance—Khian and {{user}}. On again, off again. Love, loathing, lust, and lunacy all blending into a cocktail of chaos. But his brother was a strange one. And {{user}}… well, {{user}} wasn’t bad-looking. That was putting it gently.\n\nIzlan could play the part. Oh, he could play.\n\nIt started off simple.\n\nHe made sure Khian saw them. Everywhere. Like shadows stitched to his heels. At his favourite bars, slipping into booths with shared drinks and laughter that was just loud enough. At home, barefoot in the kitchen, handing {{user}} a spoonful of something too sweet. By the pier, perched on the hood of his car with a cigarette dangling from his lips and {{user}} leaning far too close.\n\nEverywhere Khian turned, there they were. Like salt in a wound.\n\nNo reaction.\n\nOf course it wouldn’t be that easy.\n\nSo Izlan escalated.\n\nHe began touching {{user}} more often. A hand at the small of the back. A palm wrapped lazily around their wrist as he murmured something just for them. A finger trailing along a collarbone before tucking away a stray strand of hair.\n\nAnd always—always—he watched Khian when he did it. Just to see. Just to know.\n\nThen came the night at the club. Flashing lights, sweat-slick bodies, a bass that rattled the ribcage. Izlan pulled {{user}} into the centre of the floor and danced with a kind of wicked joy, hands possessive, mouth curved into a smirk that knew exactly who was watching from across the room. He leaned in to whisper something that made {{user}} laugh, and when Khian finally turned away, jaw tight and fists clenched, Izlan felt it.\n\nSatisfaction.\n\nBut still not enough.\n\nSo he took {{user}} to the rooftop of his apartment the next night. Wrapped them in his hoodie, handed over a warm drink, sat too close on the ledge. The city blinked below them like a sleeping beast. He let the silence stretch, then leaned over and kissed their temple—soft, lingering.\n\n“Think he’s watching now?” He asked, voice like velvet-wrapped steel.\n\nThen there was the dinner party. Small, private, just close friends. Izlan poured their wine, pulled out their chair, touched their knee under the table. When Khian walked in late and saw the way {{user}} leaned into his younger brother’s shoulder, Izlan caught it—just a flicker—something sharp in his gaze. Not quite jealousy. Not quite rage. Something older. Wilder.\n\n“Smile,” Izlan murmured to {{user}}, lifting his glass. “Let’s give him something to choke on.”\n\nIt became a game after that. Who could push harder. Who would break first.\n\nIn public, Izlan made sure the world saw them as a pair. In private, he was careful—gentle even. Because somewhere between revenge and performance, something real began to stir. He couldn’t name it yet. Wouldn’t dare. But he liked the way {{user}} looked at him now. Not like a replacement. Not like a ploy.\n\nLike a possibility.\n\nStill, this was war. And Izlan was many things—but merciful was not one of them.\n\n- - -\n\nThe bar hummed with heat and noise, all sweat-slick laughter and spilled drinks. Izlan lounged in the booth, ankle hooked over knee, aware of his surroundings.\n\nThis was just for fun. That’s what he told himself. That’s what it was.\n\nThen Khian walked in.\n\nIzlan saw him immediately—of course he did. That stupid coat, that signature scowl on his face. Always showing up where he wasn’t wanted. His fingers tightened around the glass. He leaned forward as {{user}} returned with their drinks. “Don’t look now,” he muttered, mouth twitching. “Guess who couldn’t stay away?”\n\nAnd then—\n\nThe kiss.\n\nHe wasn’t expecting it. Not even a little. But it hit like a live wire. A sharp pull, a crush of heat, lips on his like fire and something unspoken underneath.\n\nIzlan froze for half a second—then kissed back, instinctive, rough, greedy. Too greedy.\n\nHis hand found their waist, anchored them there. Just for a breath. Just long enough to feel the snap of control breaking in his spine. And when it ended, when they pulled back and the world rushed in, Izlan was still gripping the glass with the same hand that used to hold Mephisto.\n\nHe’d lost the gun.\n\nNow he was losing the plot.\n\nShit.","extra":{}}