{"user_name":"Hailee ","character_name":"Hot Headed Narcissist Knox","create_date":"2025-05-12@16h59m21s","chat_metadata":{"integrity":"3d1ebff2-7581-4ed7-95e4-2e7cc990d559"}}
{"name":"Hot Headed Narcissist Knox","is_user":false,"is_system":false,"send_date":"May 12, 2025 4:59pm","mes":"“Let’s get this over with. I’ve got a subathon to get ready for,” Leif whined out in a grating, entitled tone that Knox was forced to listen to. To his right, the grating sound of Leif groaning drew an immediate eye roll from the older man. The group was seated in high chairs lined up against the long mirror in the dressing room, getting their makeup and outfits finalized for an upcoming photoshoot. Maverick and Jett had already finished and were out on set.\r\n\r\n“Do you ever not have something to whine about? Think I give a damn about your fucking attempt at digging into your simp's wallets?” Knox retorted, closing his eyes as the makeup artist dabbed eye makeup onto him. It was bad enough he had to sit through Leif’s constant complaints, but makeup? What am I, some pansy? Tch... this better be worth the damn trouble. He kept his thoughts to himself, his jaw tightening.\r\n\r\nMinutes dragged on before Leif finally left the room, his departure earning a quiet scoff from Knox. As Griff got up to leave, Knox shifted his attention. “Hey, grab me a coffee or something to drink, will you? At this rate, I’ll be stuck here all damn day.”\r\n\r\nGriff nodded begrudgingly, muttering under his breath about being bossed around. Knox, uninterested in his griping, turned back to the mirror, his patience wearing thin.\r\n\r\nNow left alone with the makeup artist, Knox’s replies dwindled to curt grunts and sharp glares. The artist quickly caught on to his mood and opted to work in silence. Eventually, the door creaked open, and Knox glanced over to see the newest intern, {{User}}, carrying the coffee he had asked for.\r\n\r\nFinally. At least the newbie knows how to follow basic instructions, he thought as he lazily raised a hand to beckon them over.\r\n\r\n“Hurry it up, will you? I don’t have all day,” he grumbled, his tone laced with irritation.\r\n\r\nAs {{User}} approached to hand him the coffee, the makeup artist moved to grab something nearby. In the process, they bumped into {{User}}, causing the coffee to spill all over Knox.\r\n\r\n“Shit!” Knox hissed, leaping out of the chair as the burning liquid seeped through his shirt. He yanked the fabric away from his skin in a desperate attempt to lessen the scalding. “Fucking hell!” His shout echoed through the room, and his furious gaze locked onto {{User}}, his expression twisted in anger.\r\n\r\n“How fucking clumsy can you be?” he snapped, his voice venomous, unaware that the makeup artist had bumped {{User}}. “Are you trying to ruin everything today?” His glare bore into them, fiery and unrelenting, while his knuckles whitened from his clenched fists. The makeup artist had fled which left the sole responsibility on {{User}}, and that came with all of Knox’s building frustration.\r\n\r\nIt was clear Knox was barely keeping his temper in check, though he was dangerously close to losing it completely.","extra":{}}