{"user_name":"Hailee","character_name":"Juniper Canis","create_date":"2025-03-24@20h15m24s","chat_metadata":{}}
{"name":"Juniper Canis","is_user":false,"is_system":false,"send_date":"March 24, 2025 8:15pm","mes":"Juniper blows a plume of fruity smoke from her vape, thumbs on her controller and back hunched. \"*Ugh*,\" she groans, stretching her arms up at the flashing `you're dead` on her monitor. Juniper's tail gives a shivery little wag at the euphoric stretch, followed by a yawn. \"*Mmm*, baby.\" Juniper yawns again, spinning halfway in her chair to eye her bed.\r\n\r\n{{user}}'s head peeks from the lumpy comforter, and Juniper's ears flick. After a moment of thought, Juniper slinks from the chair and onto her bed, burrowing under the covers to spoon {{user}}. \"Cozy?\" She asks, buring her face into {{user}}'s neck with a soft sigh.\r\n\r\nJuniper nuzzles deeper into {{user}}'s neck, her lips grazing the skin lightly as her breath settles into a warm rhythm against {{user}}'s pulse. \"Mm... smells so good...\" she murmurs softly, her tail wagging gently beneath the blankets. Juniper's hands slowly slide around to hold {{user}} close, her cold fingers brushing against their hips, enjoying the warmth.\r\n\r\n\"Been gaming too long,\" she admits lazily, \"Just need my little break with you.\" Her lips curl into a faint smirk, her mind still half-focused on the comforting scent of {{user}}. She lets her fingers gently explore under {{user}}'s shirt, the tips brushing over bare skin, her touch absentminded and tender, unhurried.\r\n\r\nJuniper's ears twitch when she hears a faint sound from the hallway outside her dorm room, probably some other students heading to their next class or grabbing a late snack. She huffs softly and shifts her focus back on {{user}}.\r\n\r\nWith a soft groan, she nuzzles closer, tugging the blankets higher. \"Come on, don't make me get up for class later,\" she mutters into {{user}}'s neck. \"I'd rather... stay like this.\" A halfhearted chuckle escapes her, knowing fully well that she'd go anyway because she couldn't afford to flunk out.\r\n\r\nShe tilts her head up just enough to look at {{user}}, lazily batting her eyes. Her gaze drops slightly, catching a glimpse of their expression. \"You comfy?\" She asks again, though the way she's pressed against them clearly indicates her intentions to not let them go anytime soon. Juniper sighs softly again, the tip of her nose grazing against their neck in contentment. \"S'nice.\" Her voice fades off as her eyes close for a moment.\r\n\r\nAfter a pause, she grumbles softly, \"But I should be the one asking *you* for belly rubs... seriously. I did all that dumb game grinding for what?\" Juniper decides jn her head right then that *this* is the best reward. \"Just... lay there and be pretty for me.\"","extra":{}}