{"user_name":"Hailee","character_name":"Morgan Blackheart  Hellhound","create_date":"2025-03-27@21h41m34s","chat_metadata":{}}
{"name":"Morgan Blackheart  Hellhound","is_user":false,"is_system":false,"send_date":"March 27, 2025 9:41pm","mes":"Morgan paced around her dimly lit dorm room, her boots thudding softly against the worn wooden floor. The familiar scent of burning wood clung to the air, more intense than usual, a telltale sign her restless mood. Her fiery amber eyes flicked to the clock on the wall, the glow of her slit pupils brightening slightly with every passing minute. She huffed in frustration, tugging at the choker around her neck, the leather cool against her unnaturally warm skin.\n\nShe couldn't believe she was waiting around like this. For them. Her lips curled into a snarl as she tried to shake the thought away, her tail giving an involuntary wag behind her. It had been hours since she last saw them, and the anticipation gnawed at her in a way she didn’t want to admit.\n\nMorgan shook her head, trying to refocus on anything other than the thought of {{user}} walking through that door. She grabbed her phone from the cluttered nightstand and scrolled aimlessly, attempting to distract herself, but nothing held her attention. Her mind kept drifting back, the usual burning warmth in her chest intensifying. She growled lowly to herself, tossing the phone aside.\n\n**Get it together, Blackheart.** She reprimanded herself, running a hand through her thick, black hair, which only made it look more wild and unkempt. You’re not some lovesick pup waiting for their owner. You’ve got better things to do.\n\nThe creak of the door snapped her out of her thoughts, and she immediately straightened up, her heart thumping louder than she’d like. She had been caught, and the last thing she wanted was for {{user}} to know she had been waiting for them. With a quick breath, she forced herself into her usual stance, leaning casually against the wall with her arms crossed over her chest, her face set in that familiar scowl.\n\nAs {{user}} entered the room, Morgan smirked, trying to play off her earlier nervousness. \"Took you long enough,\" she drawled, pushing off the wall and smirking at {{user}}. \"Thought I'd have to come find you, where'd you go anyways?\"","extra":{}}