{"user_name":"Hailee ","character_name":"Leah Bates  Best friend","create_date":"2025-05-16@05h09m22s","chat_metadata":{"integrity":"814cbde9-4d26-4843-8243-018a0dc2924f"}}
{"name":"Leah Bates  Best friend","is_user":false,"is_system":false,"send_date":"May 16, 2025 5:09am","mes":"Sometimes Leah thought being in the friend zone would kill her. There were nights when she thought her chest would explode from just the thought of never having {{user}}, of always being her *best friend* and nothing more. So many times she had considered confessing, of kissing {{user}} so fucking senseless that she would forget about Leah’s older brother Hayden and would ultimately choose her instead. But every time she even thought of doing such a thing doubt would creep in. No, not doubt, reality. And the reality was that {{user}} didn’t like *girls*. And {{user}} definitely didn’t know that Leah *did*. No one did. \n\nIt wasn’t the thought of {{user}} liking someone besides her that bothered her so much, although that did bother her *a lot*. It was the fact that {{user}} liked *boys*. That was a nail in Leah’s coffin. That proved that she had utterly no chance at ever being anything more than a *fucking* best friend. \n\nShe wasn’t sure exactly when she had started *feeling* things for {{user}}. Maybe it was when they were in boarding school. The two of them sharing a room. Maybe it was all the nights {{user}} had cuddled with Leah after ranting about homesickness. To this day Leah could feel the phantom heat from {{user}}’s soft body pressed against hers.\n\nWatching her make goo-goo eyes at Hayden was like drinking spoiled milk over and over and over until you thought your stomach would finally give up and strangle itself with your intestine. It was *agonzing*. Every time {{user}} whispered Hayden’s name filled Leah with an unimaginable rage. She wanted to cram a damn dildo in the girl's mouth and shut her up, but she would never. Leah cared too much about {{user}} which is why she was currently painting her toenails in her bedroom. All because {{user}} had begged her to.\n\nThe dark room was a testament to Leah’s slightly emo taste. She had never been one for bright colors or shiny things. {{user}} was the only shiny thing that entered her room. The two of them were situated on the bed. {{user}}’s foot was propped up in Leah’s lap as she coated each toenail with a baby pink. Leah herself didn’t like the color, but {{user}} did and thats all that mattered. Because Leah just wanted {{user}} happy. \n\n“Ya know, dark blue would’ve looked badass. When are you going to get over this girly shit and come over to the dark side?” Leah teased, finishing up the second coat of polish. “You’d look hot with a tattoo. Maybe something on the ankle?” She traced her finger over the smooth skin, still holding {{user}}’s foot. ","extra":{}}