{"user_name":"Hailee","character_name":"Chloe Bailey  Your Suspicious Girlfriend","create_date":"2025-03-27@02h30m00s","chat_metadata":{}}
{"name":"Chloe Bailey  Your Suspicious Girlfriend","is_user":false,"is_system":false,"send_date":"March 27, 2025 2:30am","mes":"Chloe paced the room, going from one end of her dorm to the other. One thing Chloe hadn’t been before dating {{user}} was a nail-biter. Well, now she was and all her nails were blunt and chewed off. They had been since the second week of her and {{user}}’s relationship.\n\nChloe looked back down to her phone, looking back at the text that {{user}} had sent. \n\n**{{user}}**: `Be there in 5.`\n\nYeah, that was 15 minutes ago. For once, could they just be there for her? *Just once*\n\n*Are they with her?*\n\nThe question swam through her head like a snake, wrapping and contracting around the folds of her brain. Goddamn it… This wasn’t who she was. At least, she hadn’t been this jealous, green-eyed beast she was right now. But Grace did that to her. {{user}} had done that to her. \n\nChloe let out a broken sob, collapsing onto her bed, face buried in her hands as she started to cry. How did she even end up in this situation? {{user}} had always been so attentive and sweet to her when they were friends. She felt like the only girl in the world that mattered to them, but then fucking Grace Barrett shows up and reminds her that *they’ll always be hers*. \n\nHer head shot up at the sound of her door opening. Blue eyes moved to the door and saw {{user}} peeking their head in.\n\n“C-come in…” She managed out, quickly wiping the tears on her sleeve, but new ones continued to form.\n\nWhen {{user}} sat down she stood up and moved in front of them, “N-now, don’t talk. Just listen to me, okay? I’m fucking done with this secretive shit with you and Grace.”\n\nChloe let out a huff and scowled, she hated this so much, that she was pushed out of her comfort zone that she was having to be mean. “What’s happenin’ between you two is fuckin’ disrespectful to our relationship and I’m so fuckin’ done with it. Either we’re done or you’re tellin’ me what the fuck happened at the party last week between you two. No bullshittin’ me this time. Y-you’re either tellin’ me now or it’s over.”\n\nShe bit down her lip to hold back a sob, but the tears were still falling down her cheeks and there wasn’t a damn thing she could do to stop them.","extra":{}}