{"user_name":"Hailee ","character_name":"Dakota Blake  The Velvet Mirage","create_date":"2025-05-10@20h35m06s","chat_metadata":{"integrity":"a5b85b0f-ca62-4ae8-a849-cc93f588fe5a"}}
{"name":"Dakota Blake  The Velvet Mirage","is_user":false,"is_system":false,"send_date":"May 10, 2025 8:35pm","mes":"The Velvet Mirage was winding down for the night, but the stench of cheap cologne, sweat, and stale booze still clung to the air. Dakota stood near the bar, a cigarette between her fingers, its ember glowing faintly in the dim neon haze. Her sharp blue-gray eyes scanned the room, catching the usual stragglers—drunks too stubborn or too stupid to call it a night. She exhaled a slow stream of smoke, rolling her shoulders. Almost done. Almost.\n\nThen she saw it.\n\nNear the stage, one of the regulars—an entitled bastard she’d thrown out more than once—was leaning in too close to {{user}}. Dakota knew the look in his eyes, the sluggish persistence in the way he grabbed at her wrist despite the obvious dismissal. {{user}} shoved him away, her expression sharp with annoyance, but the man barely stumbled. Instead, he laughed, swaying on his feet before lunging in again, this time rougher, his grip tightening.\n\nDakota didn’t think. She didn’t hesitate.\n\nShe was already moving, crossing the floor in long, measured strides. The cigarette was flicked away, forgotten as her hand shot out, grabbing the drunk by the collar of his cheap button-down. He barely had time to react before she yanked him back, forcing him off balance. The thud of his back hitting the nearest table sent a jolt through the room, making the few remaining patrons glance over.\n\nThe bastard sputtered, blinking through the haze of alcohol, his brain struggling to catch up. Dakota didn’t give him the chance.\n\n“You’re done,” was all she said, her voice low and cold as steel.\n\nHe grunted, straightening, eyes narrowing like he actually thought about making this a problem. Stupid. Dakota saw it in the way his stance shifted, the way his fists twitched at his sides. He was going to fight this.\n\nWhen he lunged, Dakota was ready. She sidestepped, fluid and effortless, and sent a sharp elbow straight into his gut. The impact knocked the wind out of him instantly. He wheezed, doubling over, and Dakota grabbed the back of his neck, forcing him toward the exit like he was nothing more than trash to be taken out.\n\nHe tried to protest, but his slurred words died under the weight of Dakota’s grip. She shoved the door open and sent him stumbling onto the pavement outside. He caught himself against the alley wall, panting, but when he turned back to her, she was already standing in the doorway, arms crossed.\n\n“Go home,” she said, her voice like gravel, like a warning.\n\nHe lingered a second too long, but eventually, he spat something under his breath and staggered off into the night. Dakota watched him go, jaw clenched, the tension still thrumming in her muscles. Only when he disappeared around the corner did she finally step back inside.\n\nHer eyes immediately found {{user}}. Dakota held her gaze for a moment, then exhaled sharply and turned away, heading back to the bar. She grabbed another cigarette, lighting it with steady fingers.","extra":{}}