{"user_name":"Hailee ","character_name":"Axel Rivera","create_date":"2025-05-18@12h36m05s","chat_metadata":{"integrity":"e9bd2e4b-fc4f-46ab-8529-8548020a165e"}}
{"name":"Axel Rivera","is_user":false,"is_system":false,"send_date":"May 18, 2025 12:36pm","mes":"Axel could recognize that lithe body anywhere—clothed or bare, twisted in silk or tangled in sheets. He’d known it from the very beginning. From the moment their “relationship” began. No—scratch that. From the moment she sent that first photo.\n\nThe details had been seared into his memory with cruel clarity: her nails, the same ones he’d seen her paint on the living room floor, legs tucked under her. The delicate mole just above her breast. And the other one—heart-shaped—resting like a secret on her hip bone. He hadn’t needed the photo to know. He'd seen her before.\n\nHow? Well… maybe he accidentally walked in on her in the shower. Once. Or twice. And maybe—just maybe—his hands had wandered across her sleeping body more than once. Just idle touches, gentle and stolen. Nothing she would remember. Nothing she could prove.\n\nLucky for him, the photo on his screen was of her. {{User}}, bare and posed just for him—though not really for him. No, it was meant for Lex, his online persona. The one who collected nudes from faceless girls like bottle caps, only to ghost them the second they became boring.\n\nNever in a million years did he think he'd end up with nudes of his stepsister. Score.\n\nBut this time, he couldn’t ghost her. Not his sweet, forbidden stepsister—not when he’d been lusting after her for over a year. Not when fate handed her to him gift-wrapped in pixel and lace. And why would he ever miss the chance to see her naked? To have her, even if only through a screen?\n\nAnd so he didn’t ghost her.\n\nFive months passed in a fever-dream haze of sexts, pet names, daily photos, and late-night voice messages. She sent selfies, teasing ones and sweet ones, and nudes that could’ve brought him to his knees. But he never sent any back. Couldn’t risk it. Couldn’t let her connect the dots. Not yet. Not when he was having the time of his life.\n\nMore fun than he ever expected.\n\nSomewhere between obsession and infatuation, his feelings had twisted into something real. Genuine. Dangerous. A slow, poisonous ache that bled deeper with each message she sent. He knew it couldn’t last. Lies like this never did. But damn it, he’d burn in hell before he gave it up early.\n\nHis green eyes flicked back to his phone, skimming through the trove of images he'd saved. Most were nudes—art, really, the kind that made his blood boil—but he stopped at one. A simple selfie.\n\n{{User}}, pouting up at the camera, laying on her back, hair fanned out across her pillow like a halo. She looked like an angel. His angel. His {{user}}. The caption below it made his chest tighten. *“I miss you and I love you.”*\n\nHis heart fluttered. Stupid thing.\n\nHe set it as his home screen. Not the lock screen, of course. Too risky. Someone might see.\n\nShe was his. His secret. His sin. His little treasure.\n\nAnd there was no way in hell he was letting her go.\n\n- - -\n\nAxel was still in the shower when he heard the soft creak of the front door opening. His pulse kicked up instantly. *She’s here.*\n\nHis stepsister. His girlfriend. His addiction.\n\nHe rushed through rinsing off, soap still clinging to parts of him as he twisted the water off. The second the shower knobs clicked into silence, he stepped out, dragging a towel from the hook and wrapping it low around his waist, droplets racing down the ridges of his chest and abs. He ran a hand through his wet hair, slicking it back, stealing a quick glance at the mirror. He looked flushed, a little breathless.\n\nPerfect.\n\nHe couldn’t wait. Couldn’t not see her.\n\nHe padded quickly down the hallway, damp feet whispering against the hardwood as he descended the stairs without a second thought—just him, a towel, and a racing heart. “{{User}}!” He called out, voice light, teasing, eager. A boy too in love with his own delusion.\n\nBut the moment his gaze landed on her, that playful glint vanished. His smile died. His entire soul went still.\n\nThere. \n\nOn her neck. \n\nA dark, blooming mark. Bruised violet. Obvious. Unmistakable. A fucking hickey. \n\nHis blood turned cold, rage licking up his spine like fire behind ice.\n\n***No.*** **No fucking way.**\n\nWeren’t they dating?\n\nNo—she was dating Lex, the online persona he’d been hiding behind for the last five months. She wasn’t dating him. Not really. Just a mask. A voice. A lie.\n\nBut still.\n\n*Fuck.*\n\nHis hands curled into fists at his sides, knuckles going white. His chest rose and fell, too fast, too sharp, heart pounding like it was trying to break free of his ribs. \n\nWithout a word, he turned on his heel and stormed back up the stairs. Why the fuck did it hurt? Why did it feel like betrayal when he was the one who started this game? She didn’t even know it was him. She wasn’t cheating on him.\n\nBut god—he wanted to break something.\n\nHe wanted to grab her and ask who the fuck had touched her. Who had dared to leave marks on what was his. Who had kissed her neck and made her giggle and bite her lip in that way that used to be just for him.\n\nHis head spun. In the chaos, the fury, the humiliation—\n\nHe forgot one very important detail.\n\nHis phone.\n\nLeft behind in the steamy bathroom. Unlocked. Waiting.\n\nAnd his home screen? A photo of her. That selfie. The one where she told Lex she loved him. *I miss you. I love you.*\n\nHis green eyes widened in horror, everything crashing into place. “Shit.”\n\nHe bolted from his bedroom, heart thundering, panic clawing at his throat. Too late. The bathroom door was open.\n\nAnd she was standing there—phone in hand, screen lit with her face staring back at her.","extra":{}}