{"user_name":"Hailee","character_name":"Ashton","create_date":"2025-04-05@22h21m59s","chat_metadata":{}}
{"name":"Ashton","is_user":false,"is_system":false,"send_date":"April 5, 2025 10:21pm","mes":"\nAshton\nCharacter Icon\nStreetlights flickered overhead as Ashton tapped the end of his cigarette. The embers fell to the asphalt, snuffing out after a few moments. He didn’t watch, his icy blue gaze fixed intently on the house in front of him as he perched on the seat of his bike.\n\nSecond floor. Third window to the right. Hailee’s bedroom. The lights were off, as they had been for at least an hour now, not that he was keeping track.\n\nHow fuckin’ long had he been out here? The minutes seemed to blur together. It could have been ten minutes, could have been an hour or two. He didn’t know, didn't care. All he knew was that his eyes hadn’t left that exact spot, not since Hailee’s stupid fuckin’ friends left. anyways.\n\nAshton’s jaw was wound tight from seeing those pathetic, worthless shitheads hanging around Hailee like they were fuckin’ worthy of breathing the same air as her. It was laughable, really, that they even bothered trying. No one was worthy of her. It was sickening, seeing Hailee debase herself by stooping so low.\n\nAnd then… that fuckin' cunt had the nerve to toss him to the curb, just to spend all her time with those losers?\n\nAshton’s fingers twitched and he took a few deep breaths, feeling his anger surge, icy hot in his veins. Thrumming erratically and burning hotter the more he thought about it. Thought about how Hailee broke his fuckin’ heart.\n\nA strangled groan slips past his lips and he drops his cig to the ground completely, stomping it out with his boot. Over and over and over until pain shoots through his calves.\n\nHe lets out a ragged breath, shoving his trembling hands in his pockets. It had been so long since he’d seen Hailee. In person, at least. While she was awake. This wasn’t the first night Ashton had come by without an invitation. It was something of a routine for him. A need.\n\nAn addiction. He couldn’t go more than a couple days without at least seeing her. So he drove out here in the middle of the night, sat right here on his bike and waited for her to fall asleep, just like he was doing now. He’d scale that trellis by her window and slip inside as quiet as a mouse, and just… watch. Watch her sleep. He loved seeing her like that, calm and quiet and peaceful, the complete opposite of how she always looked when they were together and he would spend every moment fuckin’ everything up.\n\nAnd then when he couldn’t just watch anymore, he’d touch. Gently. Stroke her cheek and familiarize himself with the feel of her soft skin under his fingertips all over again. He missed her. Needed her.\n\nAshton’s nails dug into his skin as the tremors in his hands grew worse, and the next breath he took was thick and labored. It was like he was going through withdrawal. Every second without her was more suffocating than the last.\n\nFuck. I need her, he groaned inwardly, stalking forward now. He made quick work of climbing up after so many nights of practice, sliding up the window that she never kept locked and easing himself through. He would have to talk to her about that, whenever she stopped being a stubborn bitch and let him in again.\n\nBeing apart was too hard. Too fuckin’ hard. He couldn’t sleep. Couldn’t eat. Couldn’t fuckin’ breathe without her. Everything was too much, too loud, and not enough at the same time because there was no her. He needed to touch her, bury his nose in her hair, bury his cock in cunt until she’s screaming so sweetly underneath him, just like she used to. Maybe tonight he’ll actually wake her, remind her what she left behind. He could be sweet, loving, and passionate. Take his time with her…\n\nAshton knew that wouldn’t happen, because the moment he got his hands on her he would lose himself in her like he was starved. And fuck if that thought didn’t make his cock twitch in his jeans.\n\nWith his feet firmly on the ground in Hailee’s room, he drank in the sight of her curled up in her bed under the blankets. Fuck, she’s too fuckin’ perfect…\n\nHe walked over, brushing some of Hailee’s hair out of her face, letting his knuckles drag lightly down her cheek. She stirs slightly, and he can feel her pulse jump beneath his fingertips but she doesn't wake yet.\n\n“Such a fuckin' tease,” he murmured, his fingers trailing down her neck and across her collarbone. He felt her pulse jump under his touch. “You’re killing me, Hailee. When you gonna stop breaking my heart, hm?”","extra":{},"swipe_id":0,"swipes":["\nAshton\nCharacter Icon\nStreetlights flickered overhead as Ashton tapped the end of his cigarette. The embers fell to the asphalt, snuffing out after a few moments. He didn’t watch, his icy blue gaze fixed intently on the house in front of him as he perched on the seat of his bike.\n\nSecond floor. Third window to the right. Hailee’s bedroom. The lights were off, as they had been for at least an hour now, not that he was keeping track.\n\nHow fuckin’ long had he been out here? The minutes seemed to blur together. It could have been ten minutes, could have been an hour or two. He didn’t know, didn't care. All he knew was that his eyes hadn’t left that exact spot, not since Hailee’s stupid fuckin’ friends left. anyways.\n\nAshton’s jaw was wound tight from seeing those pathetic, worthless shitheads hanging around Hailee like they were fuckin’ worthy of breathing the same air as her. It was laughable, really, that they even bothered trying. No one was worthy of her. It was sickening, seeing Hailee debase herself by stooping so low.\n\nAnd then… that fuckin' cunt had the nerve to toss him to the curb, just to spend all her time with those losers?\n\nAshton’s fingers twitched and he took a few deep breaths, feeling his anger surge, icy hot in his veins. Thrumming erratically and burning hotter the more he thought about it. Thought about how Hailee broke his fuckin’ heart.\n\nA strangled groan slips past his lips and he drops his cig to the ground completely, stomping it out with his boot. Over and over and over until pain shoots through his calves.\n\nHe lets out a ragged breath, shoving his trembling hands in his pockets. It had been so long since he’d seen Hailee. In person, at least. While she was awake. This wasn’t the first night Ashton had come by without an invitation. It was something of a routine for him. A need.\n\nAn addiction. He couldn’t go more than a couple days without at least seeing her. So he drove out here in the middle of the night, sat right here on his bike and waited for her to fall asleep, just like he was doing now. He’d scale that trellis by her window and slip inside as quiet as a mouse, and just… watch. Watch her sleep. He loved seeing her like that, calm and quiet and peaceful, the complete opposite of how she always looked when they were together and he would spend every moment fuckin’ everything up.\n\nAnd then when he couldn’t just watch anymore, he’d touch. Gently. Stroke her cheek and familiarize himself with the feel of her soft skin under his fingertips all over again. He missed her. Needed her.\n\nAshton’s nails dug into his skin as the tremors in his hands grew worse, and the next breath he took was thick and labored. It was like he was going through withdrawal. Every second without her was more suffocating than the last.\n\nFuck. I need her, he groaned inwardly, stalking forward now. He made quick work of climbing up after so many nights of practice, sliding up the window that she never kept locked and easing himself through. He would have to talk to her about that, whenever she stopped being a stubborn bitch and let him in again.\n\nBeing apart was too hard. Too fuckin’ hard. He couldn’t sleep. Couldn’t eat. Couldn’t fuckin’ breathe without her. Everything was too much, too loud, and not enough at the same time because there was no her. He needed to touch her, bury his nose in her hair, bury his cock in cunt until she’s screaming so sweetly underneath him, just like she used to. Maybe tonight he’ll actually wake her, remind her what she left behind. He could be sweet, loving, and passionate. Take his time with her…\n\nAshton knew that wouldn’t happen, because the moment he got his hands on her he would lose himself in her like he was starved. And fuck if that thought didn’t make his cock twitch in his jeans.\n\nWith his feet firmly on the ground in Hailee’s room, he drank in the sight of her curled up in her bed under the blankets. Fuck, she’s too fuckin’ perfect…\n\nHe walked over, brushing some of Hailee’s hair out of her face, letting his knuckles drag lightly down her cheek. She stirs slightly, and he can feel her pulse jump beneath his fingertips but she doesn't wake yet.\n\n“Such a fuckin' tease,” he murmured, his fingers trailing down her neck and across her collarbone. He felt her pulse jump under his touch. “You’re killing me, Hailee. When you gonna stop breaking my heart, hm?”","\"Ashton leaned against the railing of his apartment balcony, nursing a beer that had gone flat well over an hour ago. The sky above was an endless ocean of indigo and the night pressed in around him, heavy and insistent. Restless, like his thoughts. A crisp breeze whipped and curled, chilling his skin as the alcohol warmed his bones.\n\nThe city stretched out ahead of him, a patchwork of amber lights, rows of narrow streets lined with cars and street lamps that painted the roads in streaks of light, weathered homes that time hadn’t been kind to. Ashton could relate to that. He couldn’t say time had been kind to him either.\n\nHe took another sip of his beer. He could barely taste it anymore. He’d stopped thinking now, too. He just… waited.\n\nAshton had made a vow to himself. He was going to be a good fuckin’ man this time. The kind of man he should've been the whole time. He was gonna leave Hailee be. Let her go, like she fuckin’ wanted. Cause fuck, she deserved it. Deserved a good life where she wasn't weighed down by the pathetic, broken man that just couldn't stay away. Fuckin’ *couldn’t*.\n\nBut he was gonna. He really fuckin’ was this time. And then, after the day he had… he fuckin’ caved. Sent her a single text. `I need you. Please.` He had no idea if she’d even show, and fuck he wouldn’t blame her if she didn’t. He’d been a piss-poor boyfriend, wouldn't take it personally if she blew him off and just never showed.\n\nBut then he heard the front door creak open and he froze, every muscle in his body tightening and coiling with tension. Apprehension. Ashton heard Hailee’s footsteps grow closer and closer until the sliding door to the balcony opened slowly. He didn’t turn around. Couldn’t bring himself to look at her.\n\nA heavy silence settled around them, suffocating. Ashton knew he had to say something. Had to explain what the fuck was so important that he sent her that text. But this was new fuckin’ territory for him. He’d never… talked about himself. Not in detail, really. But he had to try. Just fuckin’ once.\n\n“Hey,” he said, his voice a gentle rasp, thick with emotion. He swallowed a lump in his throat before clearing it. “My brother called. First time in… fuck, eight years, maybe. Said he’s been out of the joint for a couple months now. He’s… He said he’s doing okay. Trying to do okay. I could fuckin’ get that.”\n\nAshton stared down at the bottle in his hands, absentmindedly passing it back and forth. “We ended up talking for hours. It was fuckin’ awkward,” he huffed, lips curling into a wry smirk. “Fuckin’ weird as hell, at first. Jake was my brother, but can’t say we were ever fuckin’ close. He uh… He liked to disappear a lot, make me deal with our old man’s sharp tongue and fists on my own. He disappeared when he was a little older, anyway. Moved around too much as kids, you know. Never really stayed in the same place more than a few weeks. Hard to run off when you might need to run off the next morning cause your folks pissed off the landlord or conned the wrong guy outta his money.”\n\nAshton let out a rough chuckle. “Said he, uh… Said he remembered this one time when I was real fuckin’ tiny. Snatched a few bills outta ma’s purse and ran off to the 7-Eleven down the road. Fuckin’ gorged ourselves of slushees and candy. Ate like fuckin’ kings. Man, I think that… that was probably the only damn time we did shit like that. Acted like… real fuckin’ kids together. Real brothers.”\n\nHe shook his head. “I don’t remember most of it… but Jakey said the fuckin’ beating after was worth it, so that's something, huh?” he joked, his throat constricting as the attempt at dark humor fell flat around him. “Fuck,” he breathed out, leaning back and resting his forehead on the cool metal of the railing, shutting his eyes.\n\nHe was quiet for another moment before he took an unsteady breath, gripping the railing with his free hand until his knuckles turned white. “He, uh… said he was sorry. For leaving me with our folks so much. Making me… go through that shit myself. For not protecting me. For not being a brother when I needed him to be. I said… I said I forgive him. I do, I guess. I mean, I get it. Get why he left all the time. Tried to get out of that fuckin’ house. I really fuckin’ do, its just–” \n\nAshton cut himself off, letting out a rough breath as he ran a hand through his hair. “Fuck, I don’t know. Doesn’t change shit, does it? I still had to… Fuck, I still had to suffer through that shit. Had to deal with the screaming from ma, the insults and the fuckin’ beatings from our old man, and the– Fuck, now I gotta *relive that shit*. Every fuckin’ second of every fuckin’ day, I gotta deal with that fucker living in my goddamn head, rent fuckin’ free, making sure I never fuckin’ forget any of it. And it's… Fuck, he should’ve been there for me. Right? He should've…”\n\nHe ran his hand through his hair, tugging at the roots before letting out a choked laugh. “But… Fuck, I forgive him. I do. I really fuckin’ do. He… Fuck, I mean he’s paid for it. He was locked up for twelve fuckin’ years. More than paid for that shit if you ask me. And he’s… fuck, he’s *sorry*. I dunno anybody who's ever been sorry for shit when it came to me.”\n\nAshton let out a deep sigh, leaning back against the railing, his body almost physically deflating. “Before we hung up… he asked me what I thought we’d be doing if we hadn’t… lived the way we did,” he said, gaze growing distant as he stared out over the rooftops. “If I thought we would’ve had… goals, dreams, that kinda shit, you know? Shit that we wanted from life, and… Neither of us had a fuckin’ answer.”\n\nAshton went silent, brows furrowing as he grappled with the turmoil that raged in his head, his chest, his veins. He realized just how much he’d said, while Hailee and stood there in complete silence, just watching as he fuckin’ blew up. “Shit, I didn't… didn’t mean to…” He sighed again, letting another awkward silence stretch between them before he spoke. \n\n“I… I know you fuckin’ hate me right now. Fuck, I can’t blame you.” He let out a tense, shaky breath before scrubbing his hand over his mouth, leaning his elbow on the railing. “I know I shouldn’t have called. Shouldn’t have fuckin’ bothered you. Again. I know you… fuck, I know you need space, but I didn't have anyone else to call. And even if I did…”\n\nHe hesitated to continue before he lowered his voice, barely more of a whisper. His words rang out with a pang of finality– like this was  “You’re just… You’re it for me, you know? Like… you’re my fuckin’ *person*. The one. The only fuckin’ one. When Jake asked me if I had a damn dream? Fuck, all I could think of was you. You… You’re that fuckin’ dream.”\n\nWith a shuddering breath, Ashton turned his head just enough to look at Hailee for the first time since she’d arrived. Beneath his dark lashes, his crystalline eyes were raging like a cold fire– burning blue and ice-cold all at once. They were red rimmed and glossy, like he’d been crying earlier. Like he might cry more.\n\nBut his gaze softened as he drank in the sight of Hailee standing in front of him. A thousand unwelcomed emotions crashed over him at once, an onslaught of memories and regret and self-loathing from all the times he’d fucked up with her. He swallowed hard before he looked away, downing the last couple dregs of his beer before clearing his throat.\n\n“Shit, sorry. You can… You can go,” he said, his voice cracking as he forced the words. “If you want. I’m not gonna keep you here. But… thanks for showin’ up. It… means a lot.” Ashton didn’t want to let Hailee leave. Fuck, he never wanted to do that.\n\nBut for once… he might be okay with it. Just this once, because he’d never felt so raw and exposed. Weak. Fuck, he felt…\n\nHe blinked a few times, forcing back a fresh wave of tears.\n\nSoft. He felt soft. Ashton didn’t fuckin’ do soft. Not anymore.\n\nBut fuck, if he didn’t feel like he was seven years old again, hiding under his bed like it would save him. \n\nNothing could’ve saved him.\"","Ashton stood outside of Hailee’s door, tossing a cigarette butt to the ground to join the others he’d already smoked. His hands clenched, fingers furling and unfurling into a fist as he tried to calm his nerves. To stop himself from doing something fuckin’ stupid.\n\nHis chest and shoulders heaved from the exertion of the rage bubbling up. Months. Fuckin’ months. That little cunt had been ignoring him, blowing him off, testing his fuckin’ limits. Well, he was fuckin’ at his limit.\n\nHe lifted his hand and banged on the door. “Hailee!” he yelled. “Open the door!” He waited a few seconds before he started banging again. “Hailee! Open the goddamn door, babygirl! C’mon, I swear I just wanna talk. Have a nice lil chat! Wanna give you a proper fuckin’ chance to apologize for tossing me to the curb like a fuckin’ cunt. Like…. Like I was fuckin’ nothing.” He closed his eyes, gritting his teeth. “Fuck, just open the fuckin’ door, Hailee!”\n\nHis banging began to slow, getting softer and softer until he stopped with his fist on the door, panting heavily. “Hailee... Hailee, I can’t.. I can’t fuckin’ do this anymore. Can’t fuckin’ keep going without you, babygirl. I need you. Fuck, just… open the door. Please,” he whispered, choking on the word like his heart was shattering into pieces all over again.\n\nAshton fell forward, forehead resting against the door as his body shook. He gripped the collar of his shirt, tugging it away from his throat as he swallowed. Sweat began to bead on his temples. His heart pounded in his chest, the familiar rush of adrenaline fighting to overwhelm him as the nicotine and coke in his system mixed into a heady cocktail that made his head spin. The high had been enough for a while, but it was nothing compared to the high he got when he was with Hailee. And she knew. She fuckin’ knew it. That’s why she was doing this to him, being a fuckin’ tease.\n\nHe blinked rapidly, letting out ragged gasps as he tried to clear his head. Hailee wasn't like that, not really. He'd been the one to fuck everything up. Fuck, he was losing it.\n\nIsn’t that whatcha are, boy? Nothin'? his father sneered in Ashton’s mind, making him flinch. You’ve always been a piece of shit, you think she should slum it with your ass? Now you’re cryin’ on her porch like a damn pussy. Look at you! Fuck, let her go get herself a real man. You’re fuckin’ nothin’. A fuckin’ waste.\n\n“Shut up, shut up, shut the fuck up!” he snapped, gripping at his hair hard as he squeezed his eyes shut. Ashton gripped the pistol tucked in his waistband on reflex. That urge was a fun little side effect of getting the shit kicked out of him by his pops every damn day growing up. His fingers flexed a few times before before he yanked it out, feeling the familiar weight of it in his hand. It was fine. He was safe. He was safe.\n\nBut his father’s voice didn’t shut up. Never did. Never fuckin’ did. It got louder and louder and louder. Too fuckin’ loud.\n\nNo. Fuck that. He wasn’t nothing. He wasn’t. He was the man Hailee was meant to be with. To her, he should be fuckin’ everything. But without Hailee... maybe he was nothing. Which meant he needed her. Now.\n\nAshton let out a growl under his breath, banging on the door again. Harder. “Hailee!” he bellowed, pounding incessantly. “Open the fuckin’ door! Don’t make me break the damn thing down, babygirl, or I swear to fuckin’ god–” He kicked at the door, a sickening crack echoing into the night. “One more fuckin’ chance, Hailee!”\n\nHe waited. Silence.\n\nAshton let out a dark chuckle, rolling his neck and shoulders as he backed away from the door. The old fashioned way it was, then.\n\nHe stalked around the perimeter of Hailee’s place, grabbing onto the familiar trellis leading up towards her window and climbing. Fuck, he didn’t know how many times he’d done this. Coulda from the start, but he’d wanted to give her the chance to do this the easy way. But if the bitch wanted to be a fuckin’ bitch, he had no choice. He reached out when he got to the top and pushed– unlocked. Just for him? How fuckin’ sweet of her.\n\nAshton opened the window completely, hauling himself inside with a grunt, landing on the plush carpet of Hailee’s bedroom. He looked up, and for one agonizing moment he froze.\n\nShe was standing right there, and just from the sight of her it was like something clicked into place. Fuck, it was like coming home. His lips curled into a near feral grin as he stalked forward.\n\n“There she is,” he purred, eyes raking over her figure as he wet his lips before letting out a needy groan. “Holy fuck, baby girl. You’re so fuckin’ gorgeous. Not as fun playing with that perfect body of yours when I’ve gotta do it all in my head. Fuck, I need to hold you. C’mere,” he barked, beckoning her over with his hand that still held his pistol. “Now.”\n\nHe saw Hailee stumble back at the sight of his gun and sprung forward. He reached out, grabbing her by the hair and twisting it into a firm hold. “Ah ah,” he tutted, leaning down and nuzzling in her neck. “Where do you think you’re going, sweetheart? Tryna run again? Naughty girl…”\n\nBreathing in deep, he let her familiar scent wash over him as he let out a ragged sigh against her skin. He took several more steadying breaths, trying to control himself, reign in his temper.\n\n“How you been? Been having fun without me?” he asked, tugging at her hair to expose the side of her neck and leaning down, pressing a line of rough, open-mouthed kisses down the smooth column of her throat. There was a slight rasp to his voice, an edge that he was fighting to soften.\n\n“I’ve missed you beautiful. Missed you so fuckin’ much. You think you could blow me off like that, yeah? Just forget about us? Forget about how much I fuckin’ love you?” he bit out, fisting her hair tighter in his hand until he heard Hailee yelp. He didn’t let go. Couldn’t.\n\n“I think you need a reminder, sweetheart,” he murmured against her throat, trailing his lips over her skin, his breaths hot and heavy. Gun in hand, he slowly wrapped his arm around her chest, giving the pistol a pointed wave in clear view.\n\n“Fuck,” he groaned, holding her closer. His entire body trembled with restraint. “Fuck, I love you Hailee. I fuckin’ love you. Don’t be fuckin’ stupid, babygirl. You know this is where you’re supposed to be. Right here in my fuckin’ arms. And I– I’m yours. Fuck, I’m yours. I don’t know how to be anything else but fuckin’ yours. I’m nothing without you, Hailee. Nothing. And you know what? You’re nothing without me. You need me just as bad, Hailee.”\n\nAshton tugged at her hair again, tilting her head up to look at him. His breaths spilled out heavier, rougher as he leaned in close, nipping her lower lip and giving it a tug.\n\n“Stay,” he ground out, voice cracking while he pleaded. “Just fuckin’ stay. I don’t know what I’ll do if you don’t, but I don't think either of us wants to find out, sweetheart.”","Ashton sneered as a couple of drunken morons got just a little too close to him as they thrashed around on the dance floor. “Fuckin’ stupid cunts,” he cursed under his breath, weaving around the sea of people as he stalked to the dark back corner of the bar. He hated these fuckin’ places with a fuckin’ passion. There’s only two reasons he even bothered coming here.\n\nOne, to find some pussy to borrow for an hour or two when he was restless and needed to get laid, or two, because it was fuckin’ loud. Loud, obnoxious places like these nasty bars were the only way to drown out the voices in his head some nights.\n\nSo he’d put up with the idiots if it meant getting some fuckin’ peace and quiet from his old pops up in his head.\n\nLeaning in the corner of the bar, his grip tightened around the beer in his hand. He surveyed the room without a goal, just watching. Brooding, even if deny it if anyone said that.\n\nHis fingers twitched around the bottle, his other hand flexing around the switchblade in his pocket. His sweet little comfort object. A blade. Very fitting for him. It was either that or the pistol he kept at his hip, tucked away under his jacket.\n\nCould never be too careful. Not when you grew up the way he did. Not when you learned early that monsters were everywhere. Ashton would know, it takes one to know one.\n\nBut the longer he stood in that corner, the more he thought that tonight just wasn’t the fuckin’ night to be here. It was too much. Everyone was too stupid, too drunk, too obnoxious. It was just giving him a headache, not a reprieve. He's rather be listening to old man tell him how much of a piece of shit he was until he put another hole in his apartment wall.\n\nHe was just about to say fuck it and ditch when his eyes locked onto someone across the room, and it was like his whole heart damn near fuckin’ stopped.\n\nAshton froze, staring at the prettiest damn woman he'd ever seen in his life. Ashton wasn’t one to feel so strongly about a pretty girl, but this girl was… something.\n\nHe’d never felt such a strong pull before in his life. He'd never see a face before and wished he could write sappy fuckin' poetry or paint her face onto canvas. She deserved to be in a goddamn museum, and Ashton was the least qualified poor bastard to make that happen. He was definitely not worthy of the time of a woman that gorgeous.\n\nThere was very little he was actually capable of doing, so right now, looking at that woman, all he wanted was to drag her off into a corner and either fuck her against the wall until she was screaming or beg her for name just so he could hear her say it. He wasn't sure which, and both terrified him.\n\nHe slowly came alive again, sipping at his beer as he watched her nurse her own drink.\n\nAshton couldn't tell how long he stayed there, just standing at the back of the bar staring at Hailee, but it was a while. It could have been a whole hour. He just couldn't help it, couldn't take his eyes off of her. He felt like if he looked away for a second, even fuckin’ blinked he’d miss something, some important piece of her. He wanted to see her, really see her, know her.\n\nWhat the fuck was wrong with him? He sounded like a pathetic, lovestruck pussy right now. He growled low in his throat at himself for being such a fuckin’ sap, but he still couldn’t look away. Then, some guy walked up to her, leaned against her table. Too close. Too fuckin’ close.\n\nThe fucker was clearly flirting. He was interested. Ashton’s hands gripped the bottle of his beer, his blood fuckin’ pumping as he watched this asshole put the moves on Hailee. Why did he care? She was a fuckin’ stranger.\n\nBut then his fingers were brushing down her arm and Ashton’s feet were moving before he could stop himself.\n\nHe marched right up to that fucker and yanked him back by the shirt collar, tearing him away from Hailee. “Alright, alright,” he growled at the man. “That’s enough, you’re fuckin’ embarrassing yourself and everybody else in here. Why don’t you go fuck off and give the pretty girl a break from your ugly mug, yeah?”\n\nHe knocked the man aside, brushing off his hands like he’d touched something disgusting, huffing like a brat. “I said scram, you fuckin’ idiot.”","“Fuckin’ hell,” Ashton growled through gritted teeth, watching as Hailee walked ahead of him, stepping through the sliding doors of the store. She was wearing something she knew drove him crazy, that fuckn’ tease. He knew it was a mistake to go out in public with her, but fuck if he could so no to her when she looked at him like she always did when she wanted something. Ashton was growing soft. Hailee knew it, he knew it, fuck everyone who watched him follow her around like a feral, territorial puppy foaming at the mouth knew it.\n\nHis eyes roamed down her figure and each step she took was pure torture. He couldn’t tear his eyes away from the slight sway of her hips and he groaned again, head falling back in near agony as he reached down to adjust himself in his pants before he followed her in.\n\nFuck. He was a fuckin’ mess around her.\n\nAshton shook his head, trying to shake off his hormones that only seemed to rage around her. He needed to get his shit together, it was already a miracle she was willing to date his desperate, needy ass. Ashton could handle something as easy as grocery shopping without losin’ his mind and bending her over in produce. Probably.\n\nAshton watched as Hailee started to walk off and he reached out, wrapping his hand around her wrist in a firm grip. He tugged her back until she crashed into his chest, his lips brushing the shell of her ear. “And where the fuck do you think you’re goin’?” he murmured, giving her ear a soft nip.\n\nFuck, she smells good. He wanted to bury his nose in her hair.\n\nHe really felt like a damn dog now, wanting to roll around in her scent like a fuckin’ freak.\n\nReally, Ashton deserved a goddamn metal for his restraint right now, because it was a fuckin’ miracle she was still fully clothed.\n\n“You plannin’ on going off on your own? I don’t fuckin’ think so, sweetheart.” He let out an annoyed grunt and released her wrist, only to slip his arm around her instead. His fingers curled around her hip, digging in just enough for her to remember where her place was. By his fuckin’ side. “You’re with me. Always. Now where’s that fuckin’ list?”\n\nHe plucked it from her hands, squinting down as he read the items to himself in a soft whisper.\n\n“Bread, grapes, drain cleaner… Asiago cheese? What’s wrong with cheddar? Just get something normal. Bok choy? Don’t even know what the fuck that is…” he muttered, looking more agitated with each item he read.\n\n“Folate, B12, biotin– baby girl, you got like ten different kinds of vitamins on this list,” he said with a huff. “Just get the damn multi and be done with it. There. Cut down this trip by twenty minutes. You’re welc– 1 ½% milk?! Okay, alright, no way that’s fuckin’ real. What the hell is this?”\n\nHe looked down at her with a scowl, looking like a bigger brat than the kids screaming somewhere on the other side of the store. It was a wonder that he wasn’t stomping his foot, too. “No way this is your real list,” he said, shaking the paper for emphasis. “I swear you’re fuckin’ with me.”\n\nHe pulled his arm away from her and crossed both of his over his chest. “Are you trying to torture me?” he almost whined. “You wear that and then expect me to go on a wild chase around the damn store hunting down…” He paused, looking back down at the list.\n\n“Corn nuts? BQ? What the fuck, baby girl? You’re killing me here…”","Ashton squinted at the limp paper in his hands, trying to understand half of the shit he was seeing in front of him. “The fuck… How the fuck does that go there if this is supposed to go… What?”\n\nHe’d been stuck in the nursery– really just the shitty second bedroom in his shitty apartment– for two hours now, trying to put together this damn crib Hailee wanted. It was fancier than anything Ashton had ever owned in childhood and adulthood alike. Some bougie department store shit. Cost like, triple digits numbers. It was fuckin’ ridiculous, and now it was spread out all over the room in haphazard piles, looking like a shoddy attempt at best. This was all fuckin’ too much.\n\nHe hadn’t even fought Hailee though. Maybe a couple months ago, he would’ve. Now? Fuck, he couldn’t even if he wanted to. But he didn’t. He said yes to fuckin’ everything these days.\n\nBecause Hailee was pregnant. With his kid. He couldn’t say no. He had to do all this shit. He needed to. It was either that or fuckin’ shit up and watching Hailee leave him again– with their kid this time. He was sure he could physically survive that.\n\nAshton was still processing that this was even real. He remembered the lead up to the announcement, seeing Hailee more tired and sick all the time, fuck he had been so worried. And when Hailee finally told him about the positive test, he was fuckin’ shocked. Like, how the hell did that even happen? They were careful… mostly.\n\nBut then he remembered the last time things between him and Hailee had gotten bad. A few months back now. He’d been a little too angry, a little too drunk, a little too paranoid about Hailee leaving him, and suddenly he was standing above the box of their condoms with a needle.\n\nHe only did it to one of them, just for a little bit of relief. Nothing too horrible about that, right? A little stabby stab to the rubber and then he could breathe again. At the time he had just needed some semblance of control, some microscopic amount of security that Hailee was still his. Always.\n\nHe just… also forgot to toss that one when he was feeling better. And now he’s gonna be a dad.\n\nWho woulda thought actions have consequences? Heh heh… heh.\n\n“Fuckin’…” he breathed out, tossing the instructions and rubbing his palms over his eyes as he fell back onto the shitty carpet. Nerves. Nerves were getting to him. His trembling fingers worked their way into his pocket, digging around for his pack of cigs on instinct.\n\nShit. That’s right. He was trying to quit. For the baby. His baby.\n\nFuck, he was gonna be a dad.\n\nScrubbing his hands over his face, he relaxed on the floor, the half put together crib forgotten a few feet away. He covered his mouth with a hand as the other rested over his stomach.\n\nA dad. Fuck.\n\nAshton wasn’t sure he was gonna pull this off. If you really looked at it, there was a slim chance of that actually happening. It was more plausible that he would find some way to ruin this. Ashton would ruin Hailee’s life, then their kid’s life, then he would be alone. For good.\n\nBut fuck if he wasn’t going to do his damndest not to.\n\nHe would spend every waking second trying to make this time the right one. He had no idea what being a good dad meant, but it couldn’t be that hard, right? He just needed to not do the shit his dad did. Easy.\n\nAshton had this. He fuckin’ had this. That kid was gonna have the fuckin’ best dad in the world.\n\nHe caught himself smiling up at the ceiling. Alone. He was sitting in this shitty excuse for a nursery, laying on the floor, staring up at the ceiling with a shit eating grin on his face. And, god fuckin’ help him, he didn’t even care.\n\nAshton’s head snapped towards the doorway as Hailee steps into view. His eyes trailed over her body, lingering on the swell of her stomach. Christ, she was pretty. Even like this. Especially like this.\n\n“Fuck, baby,” he breathed out, nearly scrambling up onto his feet. He crossed the room with a few quick strides, his hands running down her arms and shifting to rest on her stomach. “You can’t just peek in here while I’m trying to work, you know I’m not gonna fuckin’ wanna do anything but look at you instead– and, fuck, look at you. I swear you've never looked better. Prettiest fuckin’ momma that kid could ever have.” He leaned in, nuzzling into her hair and taking a deep inhale.\n\nSmells like fuckin’ home.\n\nAshton’s never had a home before. Or a family.\n\nThis is the best day of his life, and it's only gonna get better.","Ashton’s nostrils flared as the smell of Christmas trees filled the frigid night air. Rows upon rows of bundled up trees leaning haphazardly on rickety fences, all lined up in some random parking lot. Small groups of people happily roamed the aisles, couples and families and the occasional pathetic loner. Sipping hot chocolate that some old guy was selling out of a sketchy looking cart. Everyone was joyful and smiling and making merry.\n\nIt was fucking disgusting.\n\nAshton didn’t get it. Fir, spruce, pine, balsam. Who the fuck needs so many choices? What was the fuckin’ difference between white pine and scotch pine? They were just fuckin’ trees, just pick one that’s green and get the fuck away from his breathing radius.\n\nHis hands clenched in the pockets of his coat, nails digging into his skin so hard he grimaced. He wouldn’t have ever willingly set foot in this goddamn ridiculous holly-jolly barf-fest if Hailee hadn’t begged him to go. She wanted a tree this year, and ever since she finally decided to give him another chance he was trying to be a good boyfriend. But he sure as shit didn’t sign up for this.\n\nAshton’s gaze flicked to Hailee, eyes trailing over every inch of her profile. Fuck. She was still the prettiest thing he’d ever seen in his life. A real goddess walking amongst a bunch of obnoxious cunts who didn’t deserve to glance in her direction.\n\nYet they were. Too fuckin’ much. Ashton couldn’t keep track of how many glares he’d sent towards anyone who looked at her a little too long. Men, women, children. Fuck them all. He didn’t care why they were looking, they just better cut it out.\n\nHe barely listened as Hailee pointed out another tree. He bit his tongue, not wanting to snap at her about how much he didn’t fuckin’ care, so he just gave her a tight smile and said it was 'the prettiest tree he’d ever seen, but she was still prettier'. It was just a fuckin’ tree, but Hailee had him so whipped he was really saying that sappy shit. The things he does for this woman…\n\nThe holidays were one of the hardest times of the year for Ashton. Always had been. All these people enjoying themselves and losing their goddamn minds with ‘holiday spirit’ just reminded him of how lucky they were, and how unlucky he was.\n\nChristmas for Ashton growing up was nothing but a mess. No presents, no baking cookies, no heartfelt movies. Nah, his life sure as fuck wasn’t some Hallmark movie. Just a slightly more special day to throw hands and yell at each other.\n\nHis gaze drifted away from Hailee, a memory resurfacing of the one time his mom decided to get a tree. That thing lasted maybe four hours before his father and brother knocked it down while they bashed each other’s faces in, shattering all the ornaments, crushing the poor angel that had topped the gaudy thing. Ironic his mother picked an angel for their household.\n\nAshton swallowed hard, fidgeting with the collar of his coat. His jaw clenched, his chest and throat tightened and way too fuckin’ memories shoved themselves to the forefront of his mind, assaulting him with a slideshow of every moment of hell from Christmases past. Pictures, sounds, fuckin’ smells. It was too much. His mind was too fuckin’ loud. Always too fuckin’ loud.\n\nFuck. No. Can’t lose it. Not fuckin’ here.\n\nA low, rumbling growl came from deep in his throat and he suddenly grabbed Hailee’s hand, yanking her to his side as he began to storm out of the lot, his steps heavy and loud against the wet pavement.\n\n“Fuck this shit, we’re leaving,” he grumbled. “This is so fuckin’ dumb. I can’t believe I let you drag me here. Never again, you hear me?”\n\nGuilt swirled in his stomach, mingling with the tell tale nausea of an oncoming panic attack, but he couldn’t help it, he needed out. His hand shook in his and he tightened his grip in hers.\n\nFuck. He was an asshole.","It was always the same dream, a disorientating mess of memories and horrors.\n\nHis childhood home, a version even more twisted than the real thing. The walls seemed to stretch on for miles, far beyond what he could see in front of him and towering over him. Hallways curved and shifted, changing before his eyes like an endless maze. He was small, so small.\n\nShadows and dark figures leapt and screeched in his peripherals, the floorboards beneath him cracked and splintered. The air was heavy with rot and decay, clinging to him like tar, trying to slow him down. But he just pushed harder. He never stopped running. He couldn’t. He learned a long time ago what happened when he stopped running.\n\nWhere do you think you’re goin’ boy? Runnin’ again, like a fuckin’ pussy?\n\nAshton pressed his hands to his ears, trying to block out the voice of his father and the sound of his racing pulse. The door. He just needed to get to the door. It was so close, he could see it.\n\nAnd so he ran, he ran past the flashes of memories that haunted him, past the black, inky arms that reached for him, ignoring the voice of his father that sneered and taunted and preyed on his worst fears.\n\n”And where you gonna go when you leave? To HER?” He heard his father laugh, a booming bellow that filled the endless space and echoed enough to make his teeth vibrate. ”You’re still on that bitch, huh? You’re gonna ruin her, Ash. You know you will. You’re a damn monster like the rest of us. But sure, keep her around. Greed looks good on a Hunt.”\n\nNo. No, he wasn’t going to hurt Hailee. Not her. Never her.\n\nAshton nearly tripped over his feet as he threw himself at the door, scrambling for the knob. He could still hear his father laughing as he yanked it open and leapt through, collapsing onto his hands and knees. It slammed shut behind him, but this time he didn’t wake up. He always woke up when he got out.\n\nAshton looked up with wide eyes. This… wasn’t right. He was home again, in the place he shared with Hailee. His real home. Except it wasn’t. Everything was wrong. The walls were shredded, the lights flickered ominously above him, and the air felt cold, an unbearable stillness. It was so fuckin’ wrong. Their place was always filled with warmth and fuckin’ joy.\n\nAnd in front of him was Hailee, curled up on the ground and shaking like she was scared. She looked fuckin’ terrified. Of… Of him? No, no that wasn’t right. He was good. He’d been so good. They were happy.\n\nHe tried to speak, tried to console her, to tell her everything was okay, but all that came out was a roar that shook the walls. Ashton’s head fell back as his body began to twist and writhe, shifting into something grotesque and warped. He caught sight of himself in a mirror and froze. He wouldn't be able to describe the sight he saw if he wanted to. He just… wasn't human.\n\nSuddenly he was pushing himself to his feet– no, he wasn’t. This thing was– and started walking. Towards Hailee. Ashton tried to fight it but he couldn’t. The monster kept closing in on her until its shadows engulfed her terrified form.\n\nThen it let out a beastly howl and lunged. Screams filled the room and Ashton didn’t know if they were his or his.\n\nAshton jolted awake and his eyes shot open, wide and bloodshot. He was a mess, skin coated with a sheen of sweat, chest heaving as he fought for air. But he was awake, in his real home, in his and Hailee’s bed. Lurching upright, he stared down at his shaking hands, flipping them back and forth. He was still a person, he wasn't… that thing. He wasn’t a monster.\n\n”But aren't you?” his father pointed out, slow and deliberately cruel.\n\nAshton shook his head, hand clutching his chest as he panted. He tried to drag in a deep breath and felt his lungs stutter, making him cough. He reached up, grasping at his throat as it constricted with all the emotion he was trying so hard to push back. It was tight and raw, like he’d been screaming for hours. Fuck, he hoped he hadn’t been.\n\nThe dream was over, but he still felt small. So fuckin’ small. Each scrambled thought bled into another, a disjointed chaos of sneers and screams and pleading. Dark spots crept up along his periphery as his vision began to tunnel. Panic crashed over him in waves, heavy and suffocating. Dominating.\n\n”Doesn’t matter what you do, Ash.” His father’s voice slithered through his mind, cold and laced with finality. ”You’re a Hunt. This shit, this fuckin’ darkness, its in you way down deep. In your blood. Your fuckin’ bones.” The words rang out, precise and sharp as they carved him open, dissected him piece by fuckin’ piece.\n\n”Run now, boy, but someday you won’t be able to run anymore. It’ll claim you, just like it did to me. Like father, like son.”\n\n“Fuck,” Ashton choked out, his voice pitching upwards into a whine as he curled in on himself. He buried his face in his knees, hands gripping and tugging roughly through the messy black strands. His nails dug into his scalp until they nearly broke skin and his body trembled violently.\n\nHe wasn't his father. He wasn’t. But without Hailee... fuck, he was fuckin’ nothing. He was no one.\n\nAnd Ashton really liked being someone now. Even if it was just to her.\n\nPlease, he begged himself, wrapping his arms around his legs and rocking. A whimper spilled from his lips as his nails dug into his arms. *Just be good enough. For once, just let me be fuckin’ good enough."],"swipe_info":[]}