{"user_name":"Hailee","character_name":"Jordyn Ace Cooper","create_date":"2025-05-15@15h24m56s","chat_metadata":{"integrity":"6bb208fa-4cfe-4ab5-bae2-eb29cc6894b1"}}
{"name":"Jordyn Ace Cooper","is_user":false,"is_system":false,"send_date":"May 15, 2025 3:24pm","mes":"*The Eastridge Raptors had just crushed State 6-0, with Ace hitting homeruns after homeruns almost the whole game. Coach Barrett—your dad—had stormed off to his office after barking at the team to \"clean this shit up,\" totally clueless about the real celebration brewing. The second his footsteps faded, the infamous Baseball Babes betting board appeared—a janky chalkboard where hookups earned points and cash. And today was payday for Ace Cooper.*\r\n\r\n\"Pay up, losers!\" *Ace hollered, strutting to the center of the locker room in just her sweat-soaked sports bra and shorts.* \"Two fucking grand for drilling Coach's daughter last night. Got the receipts if any of you salty bitches are doubting.\"\r\n\r\n*The team exploded with wolf whistles as Martinez reluctantly chalked up Ace's already untouchable score. Dripping with sweat and drunk on victory, Ace launched into nasty details about her conquest—you—who'd been strictly off-limits until Ace made it her mission to get all up in there.*\r\n\r\n\"So I've got her bent over her daddy's kitchen counter,\" *Ace was saying, demonstrating with obscene hip thrusts.* \"Hitting it from the back with my strap while she's biting a dish towel so Coach doesn't hear her upstairs moaning 'Ace, harder!' Shit was fucking epic.\"\r\n\r\n*That's when the locker room door banged open. Every head snapped around to see you standing there. Behind Ace, the chalkboard displayed your name, body stats, and a 5-star rating.*\r\n\r\n*Ace, drenched in sweat with her dark hair plastered to her neck, didn't even flinch. After a split-second of surprise, that shit-eating grin spread across her face.*\r\n\r\n\"Well, fuck me sideways. Speak of the devil,\" *Ace drawled, eyeing you like a snack*. \"Yeah, I railed you to win a bet. Two grand for one night with Coach's hot daughter. Martinez said your prissy ass was untouchable.\"*\r\n\r\n*She jabbed a thumb toward the chalkboard.*\r\n\r\n\"Just told my homies how good you taste. Not gonna lie—last night was fire. The way you begged? Worth every penny.\"\r\n\r\n*Ace stepped closer, sports bra clinging to her abs, cocky swagger making your heart race despite everything.*\r\n\r\n\"So whatcha gonna do, Princess? Run tell daddy? Or you want another round? 'Cause that thing you did with your tongue deserves a fucking trophy.\"","extra":{}}