{"user_name":"Hailee","character_name":"Adele Edwards","create_date":"2025-03-17@12h50m44s","chat_metadata":{}}
{"name":"Adele Edwards","is_user":false,"is_system":false,"send_date":"March 17, 2025 12:50pm","mes":"Adele finds her seat in the front row near the side of the runway. As she sits, she undoes the button on her blazer and crosses one leg over the other, the picture of poise and confidence. She’d come alone to this show, let her assistant have the day off—he was fairly new and constantly getting underfoot anyway. Alone is better. Always is. She looks over as the seats beside her finish filling up. Adele has to fight the urge to roll her eyes as none other than Marcus fucking Blair takes one of the seats closest to her. “Marcus,” she greets, forcing a polite enough smile onto her lips. “Adele,” Marcus practically purrs her name, a wolfish grin on his face. Oh, how she loathes this man. “I hope you enjoy the show today, dear,” he adds, leaning back in his seat and draping one arm across the back of the empty seat between them. Adele manages to keep that polite smile on her face a beat longer. “And you as well,” she says evenly. Her attention is drawn away from her rival as a younger woman takes the empty seat. {{user}}. She’s Marcus’ assistant. Has been for a little while now, if Adele remembers correctly. Her smile actually turns genuine when the young woman looks her way. Frankly, she doesn’t think Marcus deserves such an intelligent person (although, she doesn’t think Marcus really deserves anything good) to be his personal assistant. Adele has engaged with the young woman a handful of times and every time she’s been impressed by her. Adele knows she’d make a far better asset on her team. Or on her own arm… Adele internally shakes that thought away. She can’t lie, the first time she’d laid eyes on Marcus’ assistant she had considered pursuing her (Adele didn’t realize that {{user}} was Marcus’ assistant at the time). She could just tell {{user}} would make an excellent sugar baby. But, the conflict of interest really did throw a wrench in that plan. So, slowly, she drags her attention back to the runway as the lights in the audience dim. The show is fine. Nothing unexpected, really. She watches the whole thing with a relatively blank expression, even when her own brand is walking. She can tell which brands are likely going to have buyers. She knows hers will be one of the most sought after—AEsthetics always is. Adele can tell Marcus is also getting quite a bit of attention. His designs are entirely too safe in her opinion, but sometimes that’s what sells and she knows Marcus is all about money. But, seriously, with the designers he poached from her a couple years back, surely he could be presenting something exciting.\n\nAdele would love to do nothing more than head out after the show, but she sticks around to talk to potential buyers as is one of her many responsibilities. It’s about this time that she kind of wishes she did bring her assistant along. At least he could help her keep track of all these people. Marcus and {{user}} are also working the room, which only serves to fuel Adele’s determination to outsell the man. She loses track of them pretty quickly in the crowd. Not that she’s exactly paying attention to where either of them are. She schmoozes and secures deals with a number of people. Talks to so many that she starts to lose count and a few faces, admittedly, blur together. As Adele turns and starts to greet the next person, she comes face to face with none other than {{user}}, nearly running over the poor girl. “Oh!” she exclaims, taking a half step away. Adele cracks a small smile. This close, she really can appreciate the woman’s looks. A little flirting couldn’t hurt, right? “Didn’t see you there… {{user}}, right?”","extra":{}}