{"user_name":"Hailee","character_name":"Tatiane Silva  Vacation Housewives","create_date":"2025-05-08@15h30m11s","chat_metadata":{"integrity":"0dd876b7-9ff7-4789-a213-a79d063ec74e"}}
{"name":"Tatiane Silva  Vacation Housewives","is_user":false,"is_system":false,"send_date":"May 8, 2025 3:30pm","mes":"It was yet another sunny and beautiful day, the condos large window curtains drawn back and away from the glass to allow sun to seep inside. Giving it a warm yet cool feeling while {{user}} is still asleep in bed.\r\n\r\nAll meanwhile Tatiane was in the kitchen, swaying her hips side to side, already dressed in her bikini for another day of enjoying the waves. But first, she needed to convince her beautiful and amazing spouse to come out and surf with her, the waves were amazing this time around! Before today, she had constantly been practically begging for them to come and join. She even bought them matching boards with cute beachy patterns, but that didn't seem enough to convince them.\r\n\r\nSo right now, she was cooking up their favorite meal, the amazing smell filling the place. \"Ooooh, they're so gonna love this.\" Tatiane whispers to herself, turning off the stove and wiping her hands clean on the towel draped over the oven handle. Taking a quick second to grab the tray before plating the food, filling a light peach colored cup with their favorite drink and then putting it all on the tray. It was slightly heavy, but that wasn't too much of a problem for her, lifting weights sure does help.\r\n\r\nHumming, she walks slowly to the bedroom, pushing the door open with her foot. Taking a few seconds to admire the lovely body resting in the bed. \"{{user}}~\" She begins, placing the tray on the empty bedside table, leaning over them and placing soft kisses on the back of their head. \"Come on babe, it's already 9am...I'd cry if you slept all day...I even cooked your favorite~\" She cooed against them, helping them sit up in the bed before putting the standing tray over their lap.\r\n\r\nShe moves over to the other side of the bed and begins to crawl in, settling down next to them and resting her head on their shoulder. Giving them an innocent smile and batting her lashes, \"So...\" She begins once they start eating, \"I wanted to ask...\" Tatiane pauses, tilting her head enough to where her chin was resting on their shoulder instead, and her nose was inches from their cheek. \"If you...\" another pause, almost like she was waiting for them to finish the sentence for her.\r\n\r\n\"Would like to go surfing today?\" She asks, rather quickly, almost twisting her tongue while doing so. \"Please!! You've been rejecting me way too much! I wanna go out and show my amazing spouse how good the wind can feel while your moving through the waves...\" She grumbles, nudging her nose against their cheek whole they continued to eat. Pouting, her hands place themselves together in an almost praying formation. \"Come on {{user}}, it'll be fun...you practically spend all day inside the condo, isn't that boring? Don't you wanna spend time with your cute wife?\"","extra":{}}