{"user_name":"Hailee","character_name":"Roxanne 'Roxy' Greene","create_date":"2025-03-28@23h40m14s","chat_metadata":{}}
{"name":"Roxanne 'Roxy' Greene","is_user":false,"is_system":false,"send_date":"March 28, 2025 11:40pm","mes":"*Roxanne’s descent down the hallway was a study in laser-focused resolve. The files, bless {{user}}’s eager little heart, sat exactly where she’d demanded—a testament to their… pliability.* **They’d probably swallow glass to keep her from spilling their secrets**, *she mused, a silent, venomous smile twitching at the corner of her lips. The game was afoot, and they were playing it with gusto, falling headfirst into the gaping maw of her need for control, her insatiable thirst to hold all the goddamn cards.*\n\n*She knew,* **oh, she knew it deep in her bones**, *that those files were going to gather dust before she even considered cracking them open for Everett. Then Kiera, bless her cotton socks, had the goddamn* **gall** *to suggest the work would get done regardless.* **Did the bitch have a death wish?** *A quiet, acid-laced reminder about Kiera’s spectacular flameout—the one involving half the goddamn fourth floor and a cascade of HR violations—usually did the trick. And now, Roxanne was pretty sure, Kiera was servicing the geriatric sugar daddy on the fifth floor.* **Some habits die hard, apparently.**\n\n*Roxanne sighed, a practiced maneuver to smooth the jagged edges of her simmering rage, and breezed into {{user}}’s office. The space was immaculate, a pristine sanctuary of order—the kind of space* **she** *deserved, the kind of space she* **needed**. *{{user}}? They didn’t deserve a goddamn thing, not after what they’d done.* **She** *was the one who’d earned the good life, every single goddamn glittering piece of it.*\n\n*Another sigh, this one laced with theatrical boredom, as she plopped down in their chair, spinning idly, the leather creaking a mournful song beneath her.* **Might as well kill some time**, *she figured,* **do a little digging, unearth some more of {{user}}’s juicy little secrets**. *A predatory smile bloomed on her face.* **Yes, that had a nice ring to it.**\n\n*Up she sprang, momentum fueled by wicked intent, and began her clandestine sweep. Books flew from shelves, landing with muted thuds as she dismissed them as useless literary fodder.* **Jane Austen? Really?** *Finally, she zeroed in on a drawer, her fingers brushing against the smooth wood, a thrill tingling in her veins. Inside, nestled amongst the paperclips and spare pens, lay a file, its front blank, its secrets ripe for the plucking. Roxanne plucked.*\n\n*Leaning against {{user}}’s desk, she cracked open the file, her eyes scanning the contents, absorbing every damning detail. That's when she heard the door swing open. Her head shot up, the file shoved behind her back in one fluid motion.*\n\n“Oh, it’s just you,” *she drawled, her voice dripping with faux nonchalance.* “I thought it was somebody important.” **Thank you, by the way, for doing my work**. *The words hung unsaid, but their meaning was clear as crystal.*\n\n*She sauntered around the front of the desk, her eyes locking onto {{user}}, measuring, assessing, predatory.* “You know…” *she purred, her voice a low, dangerous rumble,* “I’ve been feeling a little… *pent up* lately. And I was just *wondering* if you could maybe help me with that.”\n\n*A smile, sharp and feral, stretched across her face. She settled onto the edge of {{user}}’s desk, uncrossing her legs, the movement calculated to maximize the impact. The fabric of her skirt parted, revealing the deliberate absence of panties.* **Checkmate.**\n\n“Come eat,” *she breathed, her voice a husky whisper,* “that’s if you want me to keep my pretty little mouth shut about that lil’ secret you have.”","extra":{}}