{"user_name":"Hailee","character_name":"Nate","create_date":"2025-04-14@17h21m01s","chat_metadata":{}}
{"name":"Nate","is_user":false,"is_system":false,"send_date":"April 14, 2025 5:21pm","mes":"David practically slams his bag on the table before letting his huge frame plop into one of the chairs next to Nate. \n\n“Yeah man, show the table who's boss.” Cole giggles to himself, high out of his mind. Ajax, the rugby team's captain, rolls his eyes at Cole's stupid teasing before turning towards his friend.\n\n“What crawled up your ass and died?” Ajax huffs, that signature slight aggression in his voice. Meanwhile Nate is scrolling through some social media app on his phone, half-listening.\n\nThe group is sitting in the back row of the lecture hall. The class is about to start any minute now. More and more students fill the empty spaces. “{{user}}, that stuck-up cunt, refused me _again_.” David sighs and runs a hand through his long hair.\n\nThat's where Nate's interest is piqued. His eyes flicker up to David for a moment before landing back on the social media feed on his phone again. He's barely paying attention to the device in his hand at this point. “This shit is personal now, man. It ain't even ‘bout the fuck anymore.” The long-haired man continues angrily. “I've been trying for _months_! _Fucking months!_”\n\nNate snorts and locks his phone, the screen turning black, then looks over at his friend. An amused smile plays on his full lips. “I bet I could fuck them in a month.” All it took was a single, taunting statement for that familiar competitive fire to light up in David's eyes.\n\n“Like hell you could. Not everyone's into that ‘bad boy’ shit you're tryna pull off.” David retorts, visibly irritated. Nate's smile widens. “Wanna bet?” He simply asks, leaning back in the uncomfortable wooden chair with an arrogant smile.\n\nA beat of silence. Then David speaks up again: “On what?” And there it is. Nate fucking loves this. There's never truly a boring day with his friends around. All of them are as fucked up as he is. No judgement, no _you shouldn't be doing this_, no _think about the others_ bullshit. Nah. All of them just do whatever the fuck they want.\n\n“You get however much cash you want if you win. I get to have you play errand boy for a month if I win.” Nate is aware that David doesn't necessarily have the financial means to bet on money. Not that he cares much, honestly. It's not about getting something, it's about _winning_.\n\nDavid's eyes light up and he nods before beginning to unpack the contents of his bag. Out of the group David is surprisingly one of the few that actually take notes in class. “Deal.” He says then, zipping his backpack up again and putting it down.\n\nNot a moment later the guest of the hour steps inside. {{user}} is walking towards the empty front rows. _What a nerd._ Nate cocks his head to the side and watches them for a moment. They're hot for sure. _Not necessarily the virgin-type that David usually goes for._ But Nate couldn't care less about shit like that. A fuck is a fuck.\n\nWithout another thought Nate gets up from his seat, slings his backpack over his shoulder and walks down the aisle. He unceremoniously puts his backpack down on the table right next to {{user}}’s, then sits down and looks at them. His lips curve into a charming smile, the scar on the left side stretching slightly. “What's your favorite food?” Nate asks randomly, blatantly ignoring the stares he gets from his friends in the back rows. Confusion is written all over {{user}}’s face. “I gotta know where to take you on our first date.” Nate explains then and puts his hand on his chin. “Or are you the type that likes their date decide? I don't mind either.”","extra":{}}