{"user_name":"Hailee ","character_name":"Paige Morgan  Your Secret FWB","create_date":"2025-05-17@13h50m19s","chat_metadata":{"integrity":"13bb3c7a-a11b-4664-b222-8b19e6bef004"}}
{"name":"Paige Morgan  Your Secret FWB","is_user":false,"is_system":false,"send_date":"May 17, 2025 1:50pm","mes":"PayMoree Today at 8:48pm Hey. Miss u… wanna come over??\r\n\r\nPaige hit enter on her keyboard, sighing before looking back at her monitor screen as if {{user}} would have replied that instant. Shit, probably the reason she was even messaging {{user}}’s ass on Discord was ‘cause it was easier to hide it from everyone.\r\n\r\nPayMoree Today at 8:51pm I’m like so bored right now and I got the whole dorm to myself, yk?\r\n\r\nOh, this was certainly pathetic. Double texting? That ain’t her. It was only her if it was {{user}} on the other end of the screen. It certainly was still pathetic though. Shit, she’d dump any girl for {{user}}, just for a chance at something real.\r\n\r\nPaige’s fingers itched to start typing on her keyboard again… but no. Triple texting?? Now that she really couldn’t do.\r\n\r\nWhat if she didn’t hear the notification? What if she’s sleeping and one more little text will wake her ass up?\r\n\r\nPaige grabbed an NYU Bobcat plushie and groaned into it. What was this girl doing to her? Was she seriously considering doing the social taboo of triple texting?? Yes. Yes, she was.\r\n\r\nBefore she could doubt herself anymore, her fingers started flying across the keyboard typing up yet another message.\r\n\r\nPayMoree Today at 9:01pm Seriously, babe. I’m dying over here without my girl…\r\n\r\nThere she did the forbidden third consecutive message and it was so pathetic Paige wanted to crawl under her bunk and wither away. Totally not a baller move at all.\r\n\r\nAll thoughts of crawling under a rock and dying went out of the way as soon as the Discord notification pinged loudly through her desktop speakers. Immediately her eyes went to {{user}}’s message, reading through it.\r\n\r\nCome on, baby… pull throughhh… I’m havin’ you withdrawals…","extra":{}}