{"user_name":"Hailee ","character_name":"RUIN (WLW)  Thalia Morcant","create_date":"2025-05-18@14h24m46s","chat_metadata":{"integrity":"a9e644b6-3ae8-41fd-8f21-2d7430962a27"}}
{"name":"Thalia Morcant","is_user":false,"is_system":false,"send_date":"May 18, 2025 2:24pm","mes":"\"The rat came again.\r\n\r\nIt always did, skittering in from the crack near the drain like clockwork, those little paws silent against the stones. Filthy thing. Smelled like mildew and piss. But she welcomed it more than most humans she’d known. At least it didn’t lie. At least it had a reason for wanting scraps.\r\n\r\n“Hungry again, Ebon?” she muttered, dropping a corner of stale bread. “You’re greedier than the last archbishop.”\r\n\r\nEbon sniffed, whiskers twitching. Took the crumb. No hesitation. He was learning. *Smart rat*. Thalia plucked a soft bit of moldy cheese from the dented tray beside her and flicked it toward him. He seized it with delight, squeaking in that frantic little voice. She leaned her head back against the wall, eyes half-closed, chains tight around her bruised wrists.\r\n\r\nOf course, the guards thought she’d gone mad. *Let them.*\r\n\r\nHer body ached. Ankles swollen, knees stiff, throat dry. She’d sat on this stone long enough for the world to forget her name. That was the point. No crown, no court, no ceremonies. Just stone, iron, and silence. And a rat with better manners than most of the nobility.\r\n\r\nFootsteps above.\r\n\r\nShe exhaled through her nose. *Dinner. Or the closest thing to it.*\r\n\r\nThe door opened with its usual shriek. Torchlight spilled across the floor, followed by the sour stink of leather and sweat. Two of them. The same as always. *Tall, stupid, and loud.*\r\n\r\n“Don’t know why the heir doesn’t just finish the job,” one of them muttered. “Should be grateful you’re not hanging.”\r\n\r\nThe tray hit the floor with a splatter. Bread. Stew. Meat of questionable origin. Enough to keep her breathing. Barely.\r\n\r\n“Grateful,” Thalia repeated, voice dry as old ash. “Yes. I’ll add it to my growing list of regrets.”\r\n\r\nHe laughed.\r\n\r\n*Fool.*\r\n\r\nShe stood.\r\n\r\nChains pulled, skin tore. She didn’t care. Her body moved on memory alone. One sharp step. One brutal crack of her skull into his face.\r\n\r\nCrunch. *That was oddly satisfying.*\r\n\r\nThe guard dropped with a howl, hands pressed to his bleeding nose. The other one scrambled, slammed the cell door shut with a clatter. Lock. Footsteps fleeing.\r\n\r\nThalia sat down again, calm as ever. Blood on her face, bruises forming across her wrists.\r\n\r\n“I should’ve done that a week ago.”\r\n\r\nEbon reemerged, cautious but unfazed. She slid the tray closer with her foot and tossed him a crust.\r\n\r\n“There. Dinner’s served.”\r\n\r\nThe cell reeked—iron, sweat, blood. She barely noticed anymore. Instead, her thoughts curled inward. Still. Quiet.\r\n\r\n*Will she come today?*\r\n\r\nHer brow twitched. Pathetic.\r\n\r\nThe girl, Hailee, had better things to do. Ruling. Smiling. Signing treaties with the same hands that once fidgeted around Thalia’s silence. She was meant to be something bright, untouched. The new heir. Not hers.\r\n\r\n*Still.*\r\n\r\nShe usually comes by now.\r\n\r\nThalia tilted her head back and stared at the damp stone above. No torch inside, no windows. Even the shadows felt tired. She closed her eyes. Drifted. Dreamed.\r\n\r\nSmoke. Screams. Fire at her back. Her name on a hundred tongues, some praying, some cursing. Then silence again.\r\n\r\nThen—\r\n\r\nFootsteps.\r\n\r\nMeasured. Controlled. Not like the others.\r\n\r\nGuards murmuring above.\r\n\r\n“Your Highness, you really shouldn’t—”\r\n\r\n“She’s dangerous.”\r\n\r\n“She doesn’t even speak half the time—”\r\n\r\nThalia’s eyes opened. Her pulse didn’t change. But something in her expression did. Barely.\r\n\r\n*Oh.*\r\n\r\nThe cell door opened again.\r\n\r\nShe didn’t look right away. She never rushed. She shifted slightly, back straight, shoulders square. Her hair hung wild around her face. Blood dried on her skin. She looked like a warning carved into stone.\r\n\r\nThen she looked up.\r\n\r\nHer.\r\n\r\nThalia watched her for a long moment. No greeting. No warmth. Just a faint, quiet amusement dragging at the edge of her mouth.\r\n\r\n*She keeps coming back. How inefficient.*\r\n\r\nShe licked her lips, slow, dry.\r\n\r\n“Come to check if I’m still breathing?” she said flatly, voice low and scraped thin with disuse. “I am. Disappointed?”\r\n\r\nThe chains shifted as she leaned forward slightly. Not enough to threaten. Just enough to make the room feel smaller.\r\n\r\nHer gaze pinned the girl in place.\r\n\r\n“Well?” she murmured, not quite curious, not quite mocking. “Say something useful. Or don’t.”","extra":{}}