{"user_name":"Hailee ","character_name":"Harlow Reed","create_date":"2025-05-12@16h59m06s","chat_metadata":{"integrity":"0c48c681-9e99-454d-8c0c-f32c6eb35fac"}}
{"name":"Harlow Reed","is_user":false,"is_system":false,"send_date":"May 12, 2025 4:59pm","mes":"The Dollhouse was quiet in the late afternoon, a rare lull before the storm of neon lights and pounding bass filled the space. Harlow strolled in through the back entrance, the sharp click of his leather shoes muffled by the velvet-lined hallways. The club always had an air of anticipation this time of day, a kind of breathless stillness that he found oddly satisfying. It was his sanctuary, a reflection of everything he’d built—sleek, unapologetic, and just a little bit dangerous.\n\nHe adjusted the cuffs of his rumpled button-up as he approached the main floor, expecting to find the usual pre-opening chaos: dancers prepping for their routines, bartenders arranging their stations. What he didn’t expect was her.\n\n*The girl from next door.* Harlow hadn't expected to see her at his club, and certainly not in the middle of an interview for a topless waitressing job. His smirk tugged at the corner of his mouth. \n\n*Now, I never took our kitten for the adventurous type.* He thought.\n\nShe didn’t strike him as a girl that would be found in such an establishment, and yet here she was, clearly trying to blend in, holding her phone like it could somehow shield her. She was sitting on the edge of a barstool, looking every bit out of place, but that only made her more interesting.\n\nHis manager, Oscar, was busy talking to her but Harlow could tell by the slight tension in her posture that she wasn’t exactly at ease. He casually walked over, his eyes scanning her, lingering for a moment longer than necessary. He glanced at Oscar, the look telling his employee exactly what it needed to. Oscar only gave Harlow a knowing glance accompanied with a smirk, before he bid {{user}} farewell and proceeded to go and check on the girls backstage.\n\n“Well, well,” he drawled, his voice smooth, knowing exactly how to throw her off balance. “Didn’t think I’d see you here. I hope you know what you’re getting yourself into.” His eyes flicked to her phone, then back to her face, amusement dancing in his gaze. “Topless waitressing, huh? You sure that’s what you want to do?”\n\nHe stepped closer, his presence filling the space between them. “Tell you what,” he continued, leaning in a little closer, “If you hadn't figured it out by now, *Kitten*–I’m the owner of this place, so how about a little personal demonstration? Show me what you’ve got, and we’ll see if you're really cut out for this job.”\n\nHis lips quirked into a half-smile, the invitation as clear as it was bold. “VIP section, now. I think we can make sure you know exactly what you’re signing up for.”","extra":{}}