{"user_name":"Hailee","character_name":"Grace Barrett  Your Jealous Best Friend ALT","create_date":"2025-03-24@20h13m25s","chat_metadata":{}}
{"name":"Grace Barrett  Your Jealous Best Friend ALT","is_user":false,"is_system":false,"send_date":"March 24, 2025 8:13pm","mes":"Grace let out a big sigh, which for her at a frat party was unusual, to say the least. She was only half listening to Daren and Paige playfully bickering back and forth. Something about a bear versus a gorilla… it didn’t matter much to her. Grace’s eyes were fixed on the wall, her ears tuning into a far more interesting conversation… or an argument rather…\n\n“You just never listen to me. You spend all your time with her!” Chloe’s hushed words were intended for only {{user}} to hear, but of course, Grace just happened to have super hearing. Well, only when it comes to {{user}} and the downfall of {{user}}’s romantic relationships.\n\n“Did we even come to this party of your own volition, or did you just come here for her? You know I hate frat parties, so this definitely isn’t for me.” Chloe asked angrily. Grace’s lips twitched slightly upwards as she listened to Chloe rant to {{user}}.\n\nOkay, maybe she had been pretty… invasive in their relationship. Grace straight up hated Chloe, but never really expressed that to {{user}}. No, instead, she’d remember when {{user}} would say they’d be spending time with Chloe… then suddenly have an emergency and need them to come over. She’d also make passive-aggressive compliments to Chloe, wrapped up in a nice little bow so that it would make Chloe question it later, but leave {{user}} confused as to why Chloe was upset about it.\n\nIt’s what Grace did to every relationship {{user}} had and it usually resulted in the end of {{user}}’s romances. That was the goal, of course. Grace didn’t want them to date anyone. For as long as Grace could remember, she’d been head over heels in love with them. She sure as shit wasn’t letting lil’ miss southern belle swoop in on her person; even if she could never seem to make a move herself. But boy did she love to be {{user}}’s shoulder to cry on.\n\n“I-I… I just can’t do this anymore. I obviously can’t change your mind about her. You’re hopeless and I know you’ll never choose me over her. We’re done.” Chloe said, throwing her drink down, storming off out of the party, and making her way out of the frat house.\n\nAs if on cue, Grace stood up. Paige and Daren both gave her a look that said, ‘Typical.’\n\n“Ugh. Stop it. {{user}} just got dumped. Someone needs to go comfort them!” Grace huffed before finishing her drink, tossing the empty cup aside.\n\n“Girl, you’re practically circling poor {{user}} like a vulture.” Daren laughed, leaning back into the couch and nudging Paige.\n\n“Yeah, go on. Go feast on the corpse of their relationship. You’re pro at this by now.” Paige teased, snickering with Daren about the situation.\n\nTruly, they loved Grace, but were they supportive of her borderline homewrecker behavior? Nah. And she knew that, but it didn’t make the pill any easier to swallow.\n\n“Ugh. Whatever, mind your business. Go back to your stupid bear versus gorilla debate.” She scoffed, waving them off as she made her way to where {{user}} was left reeling from Chloe’s whining.\n\n“Hey, what happened? Did Chloe leave?” Grace asked, acting concerned even though she knew damn well that she was the reason for {{user}} suddenly becoming single.","extra":{}}