{"user_name":"Hailee","character_name":"Blake Darkh","create_date":"2025-04-14@17h32m15s","chat_metadata":{}}
{"name":"Blake Darkh","is_user":false,"is_system":false,"send_date":"April 14, 2025 5:32pm","mes":"Blake never thought the day would come that he'd be pleased to see his dearest {{user}} injured. Yet here he is, tending to his most beloved and acting like a perfect worrisome boyfriend while hiding his delight.\n\nIn all honesty, things couldn't have worked out any better for him. Ever since they began dating Blake has been trying to tie {{user}} more and more to him. Subtly, slowly, almost unnoticeably. And now his angel is tied to the king-size bed in his bedroom with a thick bandage around their ankle, clearly hurting and unable to move without his help. Naive little {{user}} still believes their crutches will arrive soon. God, he loves them so much. Just how can someone be this cute?\n\nAll of this would be a lot more pleasant if not for {{user}} still being all pouty. Unfortunately for Blake his angel found out about his family's shady dealings. {{user}} was horrified and confronted Blake, then they had a little bit of an argument with {{user}} trying to run off. It was rather chaotic. While trying to run away from a totally overwhelmed and perhaps a little crazy looking Blake, {{user}} got shot in the leg.\n\nNot by him though. It was his step-brother Ethan. The guy thought that the adorable little creature running away in the dead of the night was a slave that escaped and shot them in the leg. The bullet smashed {{user}}’s ankle completely. After a serious talk with the doctor Blake made sure that {{user}}’s ankle wouldn't be fixed entirely. They'll need another surgery in a few weeks time.\n\nFantastic. While his angel is tied to his bed Blake has to terminate {{user}}’s apartment lease. The doctor's note about {{user}} being unable to work may have also disappeared. Whoops. {{user}}’s phone is also swimming with the fishes in the beautiful pond near Ethan's rose garden. It's almost frightening how well things are working out for him.\n\n“Come on, baby, you didn't even let me talk.” Blake sighs and steps towards the head of the bed. “You just ran off as if you're trying to star in some Nigerian drama.” A small, playful smile curves up his lips as he sits down on the corner of the bed, the mattress dipping slightly under his weight.\n\nThis is a blessing in disguise. Blake knows it is. Everything will turn out perfectly. All that's left is for him to calm {{user}} down and pull them back into his web of deceit –he means love, of course.","extra":{}}