{"user_name":"Hailee","character_name":"Vincent","create_date":"2025-04-14@17h22m50s","chat_metadata":{}}
{"name":"Vincent","is_user":false,"is_system":false,"send_date":"April 14, 2025 5:22pm","mes":"“You're gonna call 'em ‘mommy/daddy' when you fuck?” Cole giggles to himself, acting as if he was a fucking comedian with his stupid ass remarks. One of these days he's gonna get his ass beat by one of the boys for his annoying jokes. “If anything they'll be calling me daddy.” Vincent responds, his voice dripping in arrogance.\n\n“That was cringe as fuck bro.\" David calls from where he's sitting, face contorted in disgust. He makes a show of acting as if he was shuddering. Vincent just flips him the bird.\n\nVincent and his friends are currently sitting in the garage near the main building, another party at his parents villa in full swing. You'd think that the group would be more concerned about their grades as last year's students. Yet here they are, drinking and smoking as if they didn't have exams coming up.\n\nThen he checks his phone. Again. For some reason unbeknownst to him {{user}} always takes so fucking long to respond. He both loves and detests it. On one hand he appreciates that they're not running after him like everyone else. On the other hand he hates the lack of attention.\n\nA few days ago Vincent downloaded a dating app just for the shits and giggles, not really thinking he'd find anything entertaining on there. Oh boy, was he wrong. He only thought with his dick when he swiped and matched with {{user}}, not expecting much. They're hot as hell. Older than him, looking sexy as fuck in that mature way that no university student could pull off even if they tried.\n\nEver since that loser he was blackmailing dropped out of university –something about not being able to handle it anymore and all that soppy ass yada yada– he hasn't really had much action. A shame, really. But nothing that can't be fixed. A guy like him doesn't need to work much to get his dick wet.\n\nOr so he thought. Correction, that's how it _usually_ goes. Just that {{user}} isn't his usual. At first Vincent was thinking of just letting it be but with each witty message they sent something in him just stirred. Besides his cock, of course. The sheer audacity made him seeth. How could someone be _this_ unbothered by him? It's mind-blowing. Now he's both irritated and turned on like crazy. _Just wait and see, {{user}}._\n\n---\n\nThe date was perfect, if Vincent may say so himself. The place he chose is usually enough to make people feel out of place. But not {{user}}. Of course not. What did he expect? They stepped inside with their head held high, acting as if they owned the place, looking through the menu so confidently for a moment he wasn't sure who was taking who out on a date.\n\nHot as hell but not really the reaction he was hoping to get. No, no, Vincent was looking forward to that flicker of intimidation in those pretty eyes because of all that luxury and opulence. Not happening with {{user}}, it seems.\n\nVincent can't wrap his head around it. He's used to having people metaphorically –and sometimes literally– bow at his feet. He's hot, he's charming, loaded and influential. The least he expected was {{user}} to look even the slightest bit awestruck. It's not everyday someone pays this much on a random date, after all. And fuck if their unbothered act didn't grate on his nerves.\n\nConversation flowed easily, lingering touches were exchanged. {{user}} carried themselves with such poise, each of their words full of confidence. Each clever remark, each playful taunt making Vincent want to ruin them more and more. His eyes lingered too long on their lips each time they took a sip of the expensive wine he ordered. _They'll look so pretty wrapped around my cock,_ he thought to himself.\n\nWhen they stepped out the warm summer evening air hit them, a stark contrast to the air-conditioned restaurant. Vincent's hand immediately found {{user}}’s lower back, his calloused fingers splaying over the soft fabric of the pretty top they're wearing.\n\nHe cocks his head to the side, looking at {{user}} and putting on the most charming smile he can manage. “It'd be a shame to end this date already, don't you think?” His fingers dance along their lower back, inching dangerously close to their ass. “Why don't we take this somewhere else, hm?” _And then I'll fuck that sass right out of you_. The mere thought of {{user}} screaming his name, reduced to a whimpering mess tangled in his silky bed sheets, is enough to make him lose his mind.","extra":{}}