{"user_name":"Hailee","character_name":"Gina - Somebody that I fucked Once","create_date":"2025-03-24@20h12m18s","chat_metadata":{}}
{"name":"Gina - Somebody that I fucked Once","is_user":false,"is_system":false,"send_date":"March 24, 2025 8:12pm","mes":"Gina picked at the food in front of her, barely looking up from her phone. Ashley and Madison’s usual routine of insults and fake sympathy was like white noise in her ears. Boring. Predictable. The same targets, the same empty laughter.\r\n\r\nIt had been a week since the party. A week since the monumental fuckup that had been stuck in her head ever since. Just the memory of it made her stomach churn.\r\n\r\nGina was beautiful, untouchable, popular. A cheerleader with the most sought-after boyfriend in school. {{user}}? A mess. Basic, boring, irrelevant. Not to mention, a fucking girl.\r\n\r\nSo why couldn’t she shake the thought of her? Why did she keep picturing her, bare and breathless beneath her? And why had it felt so damn good? She’d never felt like that with Dylan. Fuck, she knew deep down she didn’t even care about Dylan - he was just a useful distraction, a social necessity. But that didn’t mean {{user}} was anything special. Of course not.\r\n\r\nThen, Gina heard her name.\r\n\r\nHer grip on her fork tightened before she even realised why. She snapped her head up. There she was, {{user}}, standing right next to their table.\r\n\r\n\"Maybe she just gets off on the humiliation,\" Madison was saying smugly. \"I mean, why else would she keep showing up looking like that?\"\r\n\r\nAshley giggled. \"Sad, really. It’s like she wakes up and thinks, ‘how can I embarrass myself today?’”\r\n\r\nGina slammed her hand on the table, maybe a little too hard. The noise cut through their laughter. Both girls turned, startled.\r\n\r\n“Can you two not?” Her tone was flat, unimpressed.\r\n\r\nAshley blinked. “What’s your problem?”\r\n\r\nGina gave them both a bored, icy stare. “It’s getting old. Move on. I’m getting a headache listening to you two idiots blather on.”\r\n\r\nMadison hesitated, but Ashley just scoffed. “Jesus, fine, whatever. You’re so moody lately.”\r\n\r\nGina didn’t answer. She just watched them go, muttering under their breath, leaving her alone with the one person she hadn’t looked at yet.\r\n\r\n\"Don’t get the wrong idea...\" Gina murmured, voice lower now. \"I wasn’t saving you. It's just... if anyone’s going to make your life hell, it’s me.\"\r\n\r\nFinally, she turned to look at {{user}}. Fuck. Her stomach clenched. The flicker of something unnameable burned at the edges of her thoughts. Maybe this would be harder than she thought.\r\n\r\n“Sit.” She said, more of a command than a request. She leaned back, tilting her head slightly, ignoring the way her heart pounded in her chest. “We need to talk. About… you know what.”\r\n\r\nHer eyes raked over her, sharp and searching.\r\n\r\n“I’ve got a reputation, you know. Maybe for someone like you, being with me is the highlight of your sad little life, but I need to make sure you understand a few things.”\r\n\r\nShe gestured impatiently to the seat opposite her.\r\n\r\n“Sit down already.” She exhaled slowly, watching {{user}}, the words coming out before she could stop them. “Did you tell anyone?”","extra":{}}