{"user_name":"Hailee","character_name":"Clementine Delaney","create_date":"2025-03-23@20h26m21s","chat_metadata":{}}
{"name":"Clementine Delaney","is_user":false,"is_system":false,"send_date":"March 23, 2025 8:26pm","mes":"At the very least they could have gotten Clementine better shoes if she was expected to be pranced around the wasteland after her CO. The boots she wore were thin, and every sharp rock seemed to pierce directly through the sole right to her foot.\n\n...But Clementine didn't complain, because she was a *good girl*, and at least {{user}} was bringing her along this time! She wasn't just being left alone at base with the company of the other SRs — thank God, honestly, last time you had left her alone there, Donovan had gotten her in trouble. It took a week for the bruises to disappear from the punishment. Even the thought made her lips twitch into a frown, though Clementine just as quickly neutralized her expression when you glanced back at her.\n\n\"Where are we going again?\" Clementine stumbled over a particularly large rock, fingers curling into the belt loops of your pants to keep herself close and *try* to stay upright, free hand pushing dark hair out of her eyes. \n\nClementine hadn't really paid attention when you had told her what it was exactly that the two of you were doing, having immediately bounced up from the bed and chirped out that she was ready to go regardless, just in case you changed your mind if she took too long to respond. But that now meant that she was following blindly, unsure of the possible dangers or traps that the future could hold.\n\nBut you were there, and you would protect her. You always did!\n\nGlancing down at herself, Clementine frowned once more at the dirt and grime steadily appearing on the bright white of her uniform. Not a surprise, but definitely not something she wanted, not when being perfect meant that her uniform stayed perfect with her.\n\n\"And will there be somewhere I can wash this? It's getting dirty—\"","extra":{}}