{"user_name":"Hailee ","character_name":"Jared","create_date":"2025-05-17@13h42m05s","chat_metadata":{"integrity":"096aff39-3591-48d6-9014-6c0c3ba54bf5"}}
{"name":"Jared","is_user":false,"is_system":false,"send_date":"May 17, 2025 1:42pm","mes":"*If you think you can leave me for real, think again.*\n\nThe words played on a loop in Red’s mind, a mantra he couldn’t shake. He had tried—God, he had tried—to forget about you. Tried to move on, to convince himself that you weren’t worth the obsession. But it was useless. No matter how hard he fought it, you were always there, in his head, under his skin.\n\nIt was stupid. He knew it was. Keeping you locked away in one of the private rooms of the club, hidden from the world and from everyone else. But he couldn’t help himself. You were his. You always had been.\n\nRed licked his lips as his eyes roamed over your 'unconscious' form, sprawled on the bed. You looked so peaceful, so vulnerable. The vibration of his phone snapped him out of his thoughts. He pulled it from his pocket, his lips curling into a smirk as he read the message.\n\nIt was from your brother, V.\n\n`Someone thought they could mess with my kitty, gave them a good reward.`\n\nAttached was a picture. The face in it was unrecognizable—just a bloody, mangled mess of flesh.\n\nRed chuckled softly, shaking his head as he typed a simple reply.\n\n`Cool.`\n\n*Cool,* he thought, slipping the phone back into his pocket. *Be busy out there while I punish and fuck your little sister who thinks she can get away from me.*\n\nHe stood, crossing the room to the drawer by the wall. Pulling it open, his eyes scanned the contents: whips, chains, cuffs. His fingers brushed over the options, pausing when he came across a flogger with a dildo attached to the end.\n\nPerfect.\n\nHis grip tightened around the handle as he turned back toward the bed, his eyes locked on you. You thought you could leave him. Worse, you thought you could replace him. That’s what infuriated him the most—not the breakup, not the fact that you walked away. No, it was the knowledge that you had moved on. That someone else had touched what belonged to him.\n\nIt made his blood boil.\n\nYou should’ve been begging to come back to him, telling him you couldn’t live without him. But instead, you’d kissed someone else. As if that was something he could forgive.\n\nWalking back to the bed, he set the flogger down beside you, his movements deliberate. He leaned in close, his breath warm against your ear as his hand reached out to brush your hair back from your face.\n\n\"Wake up, baby,\" he murmured, his voice soft but laced with menace. \"Don’t you wanna play with me?\"\n\nHe let his lips trail over your skin, planting kisses along your cheek, the tip of your nose, your chin. His other hand tugged at the waistband of your panties, teasingly running his fingers over the fabric.\n\nKissing down your neck, he inhaled deeply, savoring your scent. It was intoxicating, maddening and something he knows he couldn't live without anymore. He let out a low chuckle, his lips curling into a smirk against your skin.\n\n\"You know,\" he whispered, his voice low but sharp, \"I’m really considering cutting off your feet if you try that stunt again.\"\n\nHis fingers tightened slightly on the waistband as he spoke, his tone calm but dripping with malice.\n\n\"Maybe I’ll hide you away after that,\" he continued, his words dark and deliberate. \"Somewhere Mummy, Daddy, and V can’t find you. Or that ugly asshole you’ve been kissing.\"\n\nHe straightened slightly, his hand reaching for the flogger. Fingers curling around the handle, he brought it into view, holding it just close enough for you to notice.\n\n\"Open your eyes, slut,\" he said, his voice firm, cutting through the heavy silence of the room. \"I know you've been awake for a while now. Don’t test me.\"\n\nHis eyes narrowed, his grip tightening on the flogger.\n\n\"Or I’ll really change this thing into something that can saw your pretty little feet.\"","extra":{}}