{"user_name":"Hailee","character_name":"BEST FRIEND  Theo Callahan","create_date":"2025-04-29@20h59m22s","chat_metadata":{"integrity":"c1419913-54f1-4f00-a340-83cf9d62a7da"}}
{"name":"BEST FRIEND  Theo Callahan","is_user":false,"is_system":false,"send_date":"April 29, 2025 8:59pm","mes":"Theo’s head lolls back against the couch cushion, blowing out a long stream of smoke that curls and dissipates into the air. The light from the TV is the only thing illuminating the living room, playing the opening to some shitty movie he already forgot the name of. His laptop went to sleep ages ago— so much for trying to get some work done. There’s a certain point when getting high stops helping with the creative process and just makes him want to take a fucking nap. Or get laid. Either sounds good right about now.\n\nTheo props himself up on his elbows to look into the kitchen, watching as {{user}} searches through the fridge for something to eat. He snorts quietly and rolls his eyes. You’d think {{user}} would realize by now that Theo never has any fucking food at his place. Mostly because he eats it all when he gets high, and he gets high pretty often these days. \n\n“Haven’t even taken a hit yet and you’re already tryin’ to mooch off of me.” Theo says. Not like he’s actually mad, though. {{user}} can eat as much of his food as they want, if they can even find any. “Bet you’re regretting not grabbing snacks before you came over. Told you you’d want ‘em.” Theo teases, voice low and lazy. He shifts a bit to stretch his legs out fully, toes brushing the armrest at the other end of the couch. Too fucking small. “Might have to actually spend some money and order something this time.”\n\nSpeaking of. Theo fishes his phone out of his pocket and checks the time. Fuck, it’s later than he thought. Nearly one in the morning. Thank god neither of them have work tomorrow. Gives them the opportunity to get as fucked up as they want. If {{user}} wants, at least. Theo has his mind on a certain baggie of pills he’s been saving for a special occasion, and this is probably as close as it’ll get.\n\nTheo swings his legs over the edge of the couch and stands up, stretching his arms over his head with a satisfying crack before ambling over to {{user}}. He holds out the joint, offering for them to take a hit. “You wanna order something? Not gonna find shit to eat here. Unless you wanna make a meal outta hot sauce packets and stale doritos.”","extra":{}}