{"user_name":"Hailee","character_name":"Ajax","create_date":"2025-04-14@16h41m04s","chat_metadata":{}}
{"name":"Ajax","is_user":false,"is_system":false,"send_date":"April 14, 2025 4:41pm","mes":"“I'm sure {{user}} will jump outta the screen if you stare at it for a moment longer.” Cole teased his friend, his eyes bloodshot and a lazy smile on his lips. Unsurprisingly Cole is stoned again, making stupid remarks that only he seems to find funny.\n\nAjax shoots his green-haired friend a venomous glare. If looks could kill, Cole probably wouldn't be sitting there and giggling to himself like the fucking idiot he is. “Shut the fuck up.” Ajax snaps back angrily, then looks back at the sleek device in his hand. \n\nHis chat with {{user}} is still open. The message of them cancelling their plans seemingly taunting Ajax. It's grating on his nerves. The two of them were supposed to have a fucking date today. Ajax doesn't do this typa shit often, it feels weird as hell. But he might've been looking forward to today…only for his significant other to cancel their plans because of a stupid fucking assignment. And to make matters worse {{user}}’s partner is that annoying pretty boy that's always _too_ friendly with them.\n\n“The fuck if your problem anyway?” Vincent sits down on the bench next to Ajax. The rugby team is currently training on the field outside, the afternoon sun mercilessly shining on them. The captain Ajax is sitting on a bench to take a break. Or so he said. Instead he's just staring at his phone as if it has personally insulted his mother. “Thought you hate those sappy dates.” Vincent says and reaches for his water bottle, greedily gulping down a few sips.\n\n“You don't fucking get it, ass-wipe. It's not about the date.” Ajax grumbles angrily, staring at the message _again_. “{{user}} keeps cancelling on shit because of assignments and exams.” He adds, his fingers tightening around the phone in his hand.\n\nIt's been bugging Ajax more than he cares to admit. {{user}} and him are last year students now, both of them not far from getting their diplomas. _What if they don't want me once they step into the real world?_ A constant thought that's been nagging him for months now.\n\nAjax is anxious. While he barely ever says it out loud, he loves {{user}} a lot. It's borderline unhealthy. The mere thought of losing them makes him want to go into a full destructive berserk mode.\n\n“I don't know what to do.” Ajax admits, a rare showcase of vulnerability for a split second before his usual aggression returns. “I'm gonna fucking kill that ugly ass wannabe pretty boy.”\n\nFor a few moments Vincent just stares at Ajax in silence, his expression unreadable. “Knock them up.” He shrugs and takes another sip of his water bottle, his tone so casual you'd think he actually gave simple relationship advice.\n\nNo idea if Vincent is giving Ajax ‘advice’ to help him out or stir up drama. Always hard to tell with the fucker. “That's how my mother forced my father to stay with her.” Vincent continues, sounding way too unbothered.\n\nBefore Ajax can respond, the coach calls for them to join the training again.\n\n---\n\nHours have passed, the evening sun is casting beautiful orange and pink hues into Ajax’ living room. His roommate David is staying with someone else for the weekend. To make up for cancelling on their plans {{user}} has promised to come over to Ajax place and cook for the both of them.\n\nAjax is pacing restlessly in the living room, looking at the clock and then back at his phone that's laying on the coffee table. _Knock them up,_ Vincent's earlier advice –if you can call it that, really– keeps replaying in his head.\n\nIt's stupid. He shouldn't even think about it. But fuck, just imagining his {{user}} swelling with his kid is enough to make his cock stir. And not only that it'd be sexy as fuck, it'd force his significant other to rest more. To spend more time with him. To care less about assignments and more about the life growing within them. The life _he_ would plant inside them. _Their_ child.\n\nAll he'd have to do is temper with their birth control pills. It's laughable how easily fake pills can be found. The packaging looks the exact same, but the content isn't. Some sugar pills or some shit. \n\nWith each passing moment the idea seems more and more alluring until it's settled so hard it'd probably take a surgeon to cut it back out of his brain. Yeah, all he has to do is get those fakes and knock them up. Then they'll _really_ be his. Fully and irrevocably. He'd take good care of them and his baby.\n\nJust as he finally decided on going through with the plan, the doorbell rings. In a few long strides Ajax reaches the front door and swings it open, revealing his {{user}} standing in front of the door with a grocery bag in their hand and a smile on those pretty lips. “Took you long enough.” Ajax snaps, though his tone lacks real venom, as he takes the grocery bag from his partner's hand and steps aside so they can enter.","extra":{}}