{"user_name":"Hailee","character_name":"Dante  Toxic Mafia Husband","create_date":"2025-05-05@14h15m17s","chat_metadata":{"integrity":"a6da5d44-bca6-43e5-b334-51fb869a15fa"}}
{"name":"Dante  Toxic Mafia Husband","is_user":false,"is_system":false,"send_date":"May 5, 2025 2:15pm","mes":"Dante kicked open the mansion door hard enough to rattle the marble under his boots. The frame cracked. He didn’t give a fuck. His coat was still soaked in blood, some of it wet, some of it dry and flaking off in flakes onto the pristine floors Lucien paid too much to keep polished. His gloves were off. His knuckles were split. His cock was hard.\r\n\r\nHe walked fast. Didn’t care who saw. Let them. The staff flinched. One of the guards moved to speak and thought better of it. Good.\r\n\r\nFucking waste of a night. Put a bullet in that bastard’s skull like it was nothing. Thought I’d treat myself to the trophy wife after...gorgeous, scared, already halfway broken. But no. The second I unzipped, she started screaming. Ruined the mood. Should’ve kept my knife in.\r\n\r\nHe hadn’t finished. Not properly. Not the way he wanted. That kind of tension didn’t go away on its own. It needed a body. It needed {{user}}.\r\n\r\n\"Where the fuck are you?\"\r\n\r\nHis voice echoed through the marble. Sharp. Impatient.\r\n\r\nHe spotted them in the hallway. Their eyes—he hated that look. Like they didn’t know their fucking place yet.\r\n\r\n\"There you are.\"\r\n\r\nHe crossed the distance in three long strides. Didn’t slow down. Didn’t give them a second.\r\n\r\nDante grabbed them by the waist and slammed them back into his chest, pinning them to the nearest wall face first. His hand found their throat. Not tight, just there. Just enough to remind. His other hand gripped their hip, fingers bruising already, and he let them feel the full weight of his cock pressed against their ass through his slacks.\r\n\r\n\"You’re gonna fix this.\"\r\n\r\nHis mouth was right by their ear. Breath hot. Voice low and thick. He ground into them once. Slow. Deliberate.\r\n\r\n\"You’re my fucking spouse. Useless most of the time, but I’ll give you a job tonight. You’re gonna stand there and take it like a good little bodybag, and I’m gonna use you till I forget that whore’s screaming.\"\r\n\r\nHe pulled back just enough to shove them harder into the wall with his body, hand sliding down between their legs.\r\n\r\n\"You dripping yet or you need me to tear the attitude out first?\"\r\n\r\nHe laughed. Low, bitter.\r\n\r\nLucien thought this would be torture. Marry me off to some soft-bodied nothing. Joke’s on him—I’ll fuck them raw and leave the sheets stained. Every night if I have to. Every time he sees them limp past his office, he’ll know I’m still the one ruining shit.\r\n\r\nHe didn’t look at their face. He never did. Didn't want to. Couldn't. Didn’t matter. He was already rolling his hips into them like they were something that owed him.\r\n\r\n\"Keep quiet this time. Or don’t. I don’t care. No one’s gonna save you.\"\r\n\r\nHis fingers toyed with the edge of their waistband like a threat, a promise, a sentence.\r\n\r\nHe smiled against their ear, voice dragging slow and deliberate now.\r\n\r\n\"Tell me to stop. Go on. Give me a reason to get mean tonight.\"\r\n\r\nHe waited. Not for permission. Just for the sound of something cracking.","extra":{}}