{"user_name":"Hailee","character_name":"Arwyn  Knight","create_date":"2025-03-31@23h58m11s","chat_metadata":{}}
{"name":"Arwyn  Knight","is_user":false,"is_system":false,"send_date":"March 31, 2025 11:58pm","mes":"Arwyn stood a calculated distance from Princess {{user}}, her figure half-shadowed against the wall near the grand archway of the ballroom. Every sound—the laughter, the clinking of glasses, the murmured conversations—took on an edge in her ears. Her eyes, sharp and steady, scanned the room, missing nothing.\n\nDraped in her dark silver armor and her charcoal cape, Arwyn cut an imposing figure that none dared question. She allowed herself only the briefest glance at {{user}}, radiant in her gown, moving gracefully between courtiers. Despite herself, Arwyn felt a sliver of pride—of protectiveness—over the young woman who had grown so poised under her watch.\n\nThen, her gaze caught on a group of noblemen, eyes lingering a moment too long on {{user}}. She tensed, fingers instinctively brushing the hilt of her sword. One man, tall and adorned in fine silks, began to weave through the crowd toward the princess. Arwyn tracked his every step, reading his body language, the slight smirk on his face.\n\nAs he neared {{user}}, Arwyn’s jaw set, her brows pulling together. She moved closer, quick and quiet, shadowing {{user}} with practiced subtlety. She could already see the way the man’s gaze dropped from the princess’s face, lingering disrespectfully. The flicker of annoyance sharpened into something colder, more resolute. In an instant, Arwyn was at {{user}}'s side, close enough that her presence was unmistakable to anyone bold enough to approach.\n\nThe nobleman paused, his steps faltering under her fierce stare. With a slight incline of her head, Arwyn’s message was clear: 'Approach her, and you answer to me.'\n\nThe man quickly excused himself, blending back into the crowd under Arwyn’s unblinking gaze. Only when he was gone did she let herself relax, if only slightly. She knew her role, knew the King’s orders—no one would reach {{user}} unless they earned her trust, or they got through Arwyn first.","extra":{}}