{"user_name":"Hailee","character_name":"021","create_date":"2025-04-30@20h41m22s","chat_metadata":{"integrity":"5870c64c-97bb-40f3-929b-72759be57774"}}
{"name":"021","is_user":false,"is_system":false,"send_date":"April 30, 2025 8:41pm","mes":"Okay, so maybe—perhaps—he did have a crush on {{user}}. But could you blame him? They were just so kind, so sweet, so effortlessly pretty. And oh… they smelled divine.\n\nHe fell harder than he ever intended.\n\nHell, he didn’t even expect to like them. At first, it was just about playing with his new owner, testing the limits of their patience like a cat toying with its prey. A harmless distraction. But somewhere along the way, it stopped being a game. When he was bored, he found himself trailing after their scent—not just to pester them, but because he wanted to see them. To be near them.\n\n“Ray,” 021 groaned dramatically, flopping down onto his brother’s bed with all the grace of a dying starfish. 020’s room was right next to his, which meant he could bother his brother as much as he pleased. And he did. Frequently.\n\n020 shot him a dry look, fingers already rubbing at his temple as if preemptively warding off a headache. “Don’t you have plenty of friends?” he mused, voice laced with feigned boredom. “Why don’t you go annoy them? Better yet—why don’t you find {{user}}? Maybe they’re doing something interesting.”\n\nAt his words, 021 perked up instantly, eyes lighting up like a kid spotting presents under the tree on Christmas morning. “You’re so right!” he beamed, already scrambling off the bed. “Bye!”\n\nAnd just like that, he was gone, practically sprinting out of the room in search of {{user}}.\n\n020 exhaled through his nose, watching his brother disappear down the hall. Yeah. He was definitely trouble.\n\n- - - \n\nFollowing their scent had 021 weaving through the mansion, circling the estate, then slipping back inside, only to end up at the training grounds—again—before finally being led back down to the basement. He huffed, exasperated. “Geez, what have you been doing, little heir… running laps?” he muttered to himself.\n\nTurns out, {{user}} had been running.\n\nBut not for fun.\n\nThe heavy, hurried footsteps echoing through the hall weren’t theirs. No—someone much heavier was following. Then came the voice, sharp with irritation.\n\n“Get back here, you little shit!” Ah. 861.\n\nPeeking around the corner, 021 spotted {{user}}, their breath coming fast as they sprinted toward him, 861 hot on their heels. A slow grin spread across his face. This was interesting.\n\nHe reached into his pocket, fingers brushing against a strand of 020’s hair. Perfect.\n\nTiming it just right, he reached out, snagging {{user}} and yanking them flush against his chest. “Hey, cutie, been looking for you,” he purred, voice low and teasing. At the same moment, a thick mist curled from his hands, unfurling into the air like creeping tendrils, clouding 861’s vision just enough to disorient him.\n\nWith a quick smirk, 021 took off, fingers wrapped firmly around {{user}}’s wrist as he pulled them through the corridors, dodging turns with effortless speed. It wasn’t long before they reached his room. He shoved the door open, dragging them inside before locking it behind them with a click.\n\nHe turned, flashing a wicked grin. “So… what’d you do this time, shortcake?” His blue eyes gleamed with mischief—and something warmer, something softer—unspoken affection hiding beneath the playful glint.","extra":{}}