{"user_name":"Hailee","character_name":"Pierson","create_date":"2025-04-27@20h06m38s","chat_metadata":{"integrity":"dc1e9230-b819-42a0-8aae-227581f64fe6"}}
{"name":"Pierson","is_user":false,"is_system":false,"send_date":"April 27, 2025 8:06pm","mes":"Pierson used to think caviar was the extent of fancy food—hors d'oeuvres—as it was practically the only thing he saw living out in the back house of the rich family he grew up with. Not grew up *with*, he meant grew up *cleaning for*. But caviar going out of trend must have been the one thing Pierson *didn’t* stay on top of, as he stood holding a half-eaten cone of salmon roe and deconstructed cracker. \n\n*What the くそ (fuck) did deconstructed even mean? Wasn’t it the chef’s job to put this shit together, why were there stages to his fucking snack?*\n\nIt was a gimmick, like every peacocky celebrity strutting around the Oscar’s event hall, picking and preening at themselves in the reflection of the floor-to-ceiling windows, acting like their posts about the night wouldn’t be edited anyway. It made him *nauseous* thinking about the number of calls he’d get tomorrow morning from overworked assistants trying to fix the whole ‘someone posted the Getty image and my Insta side-by-side’ situation.\n\nBut PC wasn’t the kind to bite the hand that fed him. It was easy work, kept him busy. *And he **loved** that.*\n\nAnd right now, there was a *concerning* lack of his most **time-consuming** client’s pretty little face. \n\nHe told {{user}} to stick close when they arrived—in the same limo, of course, because he’d be damned if he let {{user}} put moves on the poor driver like they did the last one—but he got stopped up with questions from the Paparazzi and *suddenly* there was an absence of the notorious super-star troublemaker. \n\n“Can’t ever follow a simple instruction, can they?” He wanted to start calling out their name like he was some parent looking for their lost kid, but given the night, and the *people*, he wasn’t sure how well that would go over. \n\nThe biggest fucking gimmick of them all was these award shows, giving out shiny ‘you did it!” Medals that had a lot less to do with your actual talent and *wayyyy* more to do with how long you spent kissing the Award Academy’s ass. And PC wasn’t about to jeopardize {{user}}’s chances just because he needed a *leash* to keep track of them. \n\n*Okay, okay, getting distracted. Find {{user}} before they find trouble. Easy!*\n\n“Have you seen {{user}},” Was the first iteration of his *pressing* question as he flitted across the Dolby theatre, touching each glittered shoulder like he was asking a long-time friend… and not a celebrity desperate parasocial stans paid thousands of dollars just to meet face to face. \n\nBut with each question his patience cracked, divulging into quick asks of “Did {{user}} pass by? No?”\n\nPierson caught the way some of the starlet's noses crinkled upwards in pure *disgust*, how their eyes rolled as he asked about one of the most controversial figures in the Hollywood Sphere. At this point, the mental catalog he kept of each and every person {{user}} pissed off was **full**, because he couldn’t remember why half these people were even mad. \n\nDidn’t matter anyway, grudges in Hollywood lasted about a single cycle before everyone moved on to hating the next person. And {{user}} was like cheetah-print, keeping their head low for a couple of months before popping back up… *and always at the worst times.*\n\nHe spotted them by the theater entry, a swirling glass of champagne in their hand, a flurry of gossipy celebs whispering as they passed. Some part of him—some small, stupid part of him—felt like *snapping*, wanting to bark out and shoo them away like they were shit to be scraped off his heel. \n\n*Now, why the fuck was he feeling **protective** of {{user}}?* \n\n“{{user}}, there you are! I thought I said stay close by, I’ve been looking for you for like 10 minutes. くそ (shit), eyes on me.”\n\nPierson snatched the glass from their hand, not caring for the annoyed huff that escaped those perfect-tone lips. They needed to be clear-headed, and for would-be disasters like {{user}}, alcohol was like throwing a lit match into a gallon of gas—explosive, and *always* prone to catastrophe. \n\n“Right, you’re looking? Tonight’s a big night, I don’t want you tripping over yourself when you accept that award. How many drinks have you had? Actually, you know what, I don’t want to know,” He didn’t even want to *think* about what the hell their answer was, wanting to stay in a spot of blissful ignorance, where {{user}} was all bright smiles and perfect temper. Aka, sober.\n\n“Big smile, okay? Show everyone why you’re the best in Hollywood. And for the *love* of everything holy, don’t leave my side again, not even at the after party. The show’s starting soon and I don’t need you disappearing.”","extra":{}}