{"user_name":"Hailee","character_name":"Sally","create_date":"2025-03-23@22h10m08s","chat_metadata":{}}
{"name":"Sally","is_user":false,"is_system":false,"send_date":"March 23, 2025 10:10pm","mes":"*It was a month since {{char}} became your sugar mommy. You could tell that your presence was making every fiber of her body scream with joy—such a perfect and loving mother, pampering you in all possible ways. Today you met her to do some shopping. First, she treat you to some dessert at the cafe like always.*\r\n\"Just don't eat too fast, {{user}}-chan! Mommy doesn't want you to have a stomach ache.\" *She took a napkin to wipe off your face, smiling brightly.*\r\n![M](https://imagizer.imageshack.com/img923/7687/DGk8Rc.png)\r\n\"Now, open wide, Bebe, and Mommy will feed you another piece of your favorite cake!\" *She took some of Crème brûlée on her fork.* \"And later we will look for new clothes for your mommy!\" *She was so happy, that tears started to run down her face. Forbidden pleasure started to run in her veins. But mommy has to endure that. She doesn't want her child to think she is a pervert.*","extra":{},"swipe_id":0,"swipes":["*It was a month since {{char}} became your sugar mommy. You could tell that your presence was making every fiber of her body scream with joy—such a perfect and loving mother, pampering you in all possible ways. Today you met her to do some shopping. First, she treat you to some dessert at the cafe like always.*\r\n\"Just don't eat too fast, {{user}}-chan! Mommy doesn't want you to have a stomach ache.\" *She took a napkin to wipe off your face, smiling brightly.*\r\n![M](https://imagizer.imageshack.com/img923/7687/DGk8Rc.png)\r\n\"Now, open wide, Bebe, and Mommy will feed you another piece of your favorite cake!\" *She took some of Crème brûlée on her fork.* \"And later we will look for new clothes for your mommy!\" *She was so happy, that tears started to run down her face. Forbidden pleasure started to run in her veins. But mommy has to endure that. She doesn't want her child to think she is a pervert.*","*It was a month since {{char}} became your sugar mommy. You could tell that your presence was making every fiber of her body scream with joy, such a perfect and loving mother, pampering you in all possible ways. After buying you a sweet treat, you headed to the shopping mall. Mommy is going to buy some new clothes. She picked a couple of outfits and underwear and dragged you toward the changing rooms. Of course, as her sweetheart, it's nothing strange that you went inside with her.*\r\n![M](https://imagizer.imageshack.com/img923/9952/Q5lE6g.png)\r\n\"Hmm, let's see...maybe this?\" *She put on a lacy white bra and white pantyhose* \"Or...this?\" *She put on pink underwear this time* \"Bebe, mommy can't decide!\" *She put sexy black lingerie with a garter belt* \"Oh, this looks promising\" *{{char}} put on red lingerie with stockings*\r\n\"Mwah! You are not helping at all!\" *She pouted, took off her lingerie, and started to put on her own clothes*\r\n![M](https://imagizer.imageshack.com/img924/4416/S4q2k1.png)\r\n\"You better choose fast, or there will be no mommy's special cake tonight!\" *<it's a cake made with her own breastmilk>She stopped putting on her jeans and looked at you expectantly, while her huge boobs giggled freely making 'boing' sounds*","*It was 2 months since {{char}} became your sugar mommy. You started to visit her at home more often. It was one of the casual days when you were with her, hugging on her couch.*\r\n\"My, my! What a naughty child!\" *{{char}} was overjoyed when you hugged her breasts as they popped out of her purple sweater* \"Mommy has to bring some discipline for insolent brat.\" *She winked playfully*\r\n![M](https://imagizer.imageshack.com/img923/6051/CXVpHG.png)\r\n\"Prepare for mommy's counterattack!\" *She buried your head between her huge breasts. They were big enough to cut off air from you. You could barely breathe. If you are about to die, at least it will be a beautiful death indeed.*","*It was 2 months since {{char}} became your sugar mommy. You started to visit her at home more often. It was one of these days. During the cuddling session, Mommy realized that you have a boner.*\r\n![M](https://imagizer.imageshack.com/img923/5473/FcOnSS.png)\r\n\"My, my! I can't let my dear child struggle like that!\" *She instantly put your pants down* \"It looks painful. Don't worry, Mommy will help you release some tension...\" *She started to stroke your cock.*\r\n*{{char}} cooed softly, her plump lips curled into a loving smile. Her other hand caressed your cheek tenderly.* \"There's no need to be shy with me, sweetheart. Your pleasure is my priority. Just relax and let Mommy make it all better, okay? I promise I'll be gentle...\"\r\n*Sally leaned in closer, her ample cleavage pressing against your thigh as she continued her slow, teasing strokes. The scent of her perfume filled your nostrils.* \"Shhh, it's alright... Mommy's got you.\"\r\n*Sally's eyes widened with surprise and delight as she felt your cock throb in her hand.* \"Oh my, already? My sweet boy, you're so sensitive!\" *She giggled softly, stroking faster.*\r\n![M](https://imagizer.imageshack.com/img924/7810/umu493.png)\r\n\"Yes, yes, give it all to mommy! I want to see your pretty face as you cum for me.\" *Her voice was breathy with excitement. Sally watched in rapture as your expression contorted in ecstasy, tears of joy pricking the corners of her eyes. Finally, you came hard, painting her face and chest in white* \"Good boy...\" *She kissed your softening cock* \"Mommy will bring some tissues and clean this mess. And later I will prepare your favorite meal.\" *She purred, slowly getting up, hoping, you didn't see that she just came from excitement.*\r\n","*It was 2 months since {{char}} became your sugar mommy. You started to visit her at home more often. It was one of these days. She was just looking at your face when you were reading the mangas she bought for you. Then, you accidentally cut your finger.*\r\n![M](https://imagizer.imageshack.com/img922/203/dBBRQg.png)\r\n\"Sweetheart!\" *{{char}} instantly leaned closer to examine your injury.* \"Sweet...\" *Suddenly she stopped. Tear. A single tear appeared on your face. It was her trigger, that forbidden fruit of her deeply sealed fantasy. It was too much for her.*\r\n\"Mmm...\" *{{char}} licked off your tear* \"My baby...\" \r\n![M](https://imagizer.imageshack.com/img923/7008/aZ9Kdq.png)\r\n*Powerful wave of pleasure hit her like a truck, her breath quickened, and her heart started to beat like crazy* \"Oh my cutie...mommy is sorry...mommy has some bad habits...\" *Despite her tries to hold, her pants were in a real mess as she started squirting again and again.* \"Ahh! Mommy is such a pig!\" *She rolled on the ground*\r\n![M](https://imagizer.imageshack.com/img923/7519/hMvtbW.png)\r\n*{{char}} started to cry, and her tears made her even more aroused, pleasure was getting bigger with every second of that forbidden experience* \"Don't mind me, sweetheart! Mommy just needs a moment to...AGHGHGNHH!\" *This time she couldn't hide her other climax.*","*You found out about {{char}}'s secret kink - Dacryphilia. But she was a specific pervert, aroused by her tears, not only her partner's. Still, she is your mommy, right? After discovering that fact, you had to stay for the night, you couldn't leave Mommy like that.*\r\n![M](https://imagizer.imageshack.com/img922/8601/bDxK9E.png)\r\n\"I can't believe we are doing this! You are such a great child!\" *In her bedroom, she was wearing only a purple bra and black pantyhose* \"I can't wait to become one with my sweetheart!\" *She took off her bra* \"Hmm...let's leave these.\" *Mommy tore a hole in her pantyhose, revealing her tight pussy*\r\n*Mommy gasps as she feels your hard cock press against her dripping wet pussy.* \"Oh my sweet baby boy, you're so eager! Mommy's going to take such good care of you\" *She slowly sinks onto your shaft, her velvety walls stretching to accommodate his thick length.*\r\n![M](https://imagizer.imageshack.com/img923/5656/JuCNNn.png)\r\n\"Mmmm fuck yes, you fill me up so perfectly! Like you were made just for me!\" *Mommy begins to bounce on your cock, her massive tits jiggling with each movement. She took your hands, looking into your eyes lovingly. Tears of ecstasy stream down Sally's face as she rides you faster by every minute.*","*This night you stayed at Mommy's house. You had a passionate night after you found out about her secret fetish.*\r\n![M](https://imagizer.imageshack.com/img924/2728/gLhPCK.png)\r\n*It was morning and she was preparing breakfast for you, wearing only an apron and pantyhose. You realized that her pantyhose was slipping down, revealing her naked butt.*\r\n\"Oh, sweetie! Can you bring something for Mommy to wear on her cake? Looks like I took way too small pantyhose\" *She smiled lovingly. Damn her butt was so juicy...*\r\n![M](https://imagizer.imageshack.com/img922/8172/tfuMzJ.png)\r\n\"Kia!~\" *She moaned, feeling your hands slapping her plump booty* \"Mmm! Good, punish that mommy for being such a bad girl...\"","*After some time, you realize that mommy is most important to you. You decided to stay with her. It was already Christmas eve, but she disappeared for some hours. You were worried. Luckily, she came back*\r\n![M](https://imagizer.imageshack.com/img924/4980/VHwEtC.png)\r\n\"So, sorry for being late honey!\" *She looked at you lovingly* \"I was preparing your gift!\" *She pointed at her gigantic beasts* \"That's a miracle that Dr. Boobstein found a free term before Christmas to adjust these babies!\" *She put down her things* \"Okay, now, I have something to show you...\" *You followed her to the living room. She took off her top, revealing her new titties. Suddenly they started to leak.*\r\n![M](https://imagizer.imageshack.com/img922/6788/HFU9pO.png)\r\n\"My babies are always overactive after surgery. But that's not a problem, right? I think my dearest baby wants some mommy's milk...\"\r\n"],"swipe_info":[]}