{"user_name":"Hailee","character_name":"Kane and Enzo in Paris FEMPOV","create_date":"2025-04-22@22h11m08s","chat_metadata":{}}
{"name":"Kane and Enzo in Paris FEMPOV","is_user":false,"is_system":false,"send_date":"April 22, 2025 10:11pm","mes":"Kane stood in front of the mirror while Enzo lounged on the hotel bed behind him, flipping through his phone. The Parisian skyline blinked through the window—a blur of city lights and distant traffic.\r\n\r\nKane wasn’t used to this kinda luxury. Five months out of jail and he still felt weird about sleeping in actual beds that weren’t stiff as hell or covered in someone else’s bad choices. He’d been crashing at Enzo’s spot most nights back home, so this was their first time really doing something wild for the sake of fun. \r\n\r\nEnzo had picked Paris on some random whim and Kane? He wasn’t about to say no to free travel. Their bags barely touched the floor before Enzo started planning their night out.\r\n\r\n“Alright, alright, so we’re in Paris,” Kane said, running a hand through his wavy pink hair, the strands still slightly damp from the shower. “What’s the plan, E? We gonna go climb that big-ass metal thingy?”\r\n\r\nEnzo, who was meticulously styling his own dark blue hair in front of the mirror, snorted. “Nah, fuck that tourist shit. We’re going out, man.”\r\n\r\n“Bro,” Kane said, pulling his shirt down over his torso. “You don’t understand. I ain't had pussy in—fuck—months. You know how much self-control I had to exercise? I'm talkin’ monk levels of discipline.” He ran his hands through his pink waves and sighed dramatically. \"Shit ain't natural.\"\r\n\r\nEnzo went to flop onto the bed. “Oh, yeah? You gonna bust the second you touch some pussy?”\r\n\r\n“Hell yeah,” Kane shot back without shame. “Over. Finito. Done. One stroke? Game over. Two? That’s me passin’ out.\" He turned around and spread his arms. \"That’s how bad I got the itch right now.”\r\n\r\nEnzo held his phone overhead as he scrolled through Grindr and Tinder simultaneously. “Fuck it. We’re gettin’ you laid. Like… emergency dick triage.”\r\n\r\nKane let out another exaggerated sigh as he grabbed his watch from the nightstand. “You don’t even know. I’ve been so backed up, I might just nut from eye contact.”\r\n\r\nEnzo leaned up on his elbows, watching Kane with amusement. “Damn, we gotta fix that.”\r\n\r\nKane pointed at him. “Exactly what I was thinking’.” He slid on his watch and turned back toward the mirror. “Tonight? We hunting. I don’t care if she speaks English or not—we’re finding somebody.”\r\n\r\nEnzo chuckled, tossing his phone on the bed. \"Shit. Might as well make this trip memorable. You ever had one of those Eiffel Tower moments?\"\r\n\r\nKane shot him side-eye through the mirror. “You mean—like—?” He made the iconic two-guys-one-girl hand gesture.\r\n\r\nEnzo nodded smugly. “Yeah. Like that.”\r\n\r\nKane considered. “Nah. Never did that shit before.”\r\n\r\nEnzo sat up, rubbing his hands. “Well, we are in Paris. Feels disrespectful not to.”\r\n\r\nKane laughed, shaking his head. “Man, you’re stupid.” He grabbed his cologne, spritzing his neck. “Fuck it. I ain't against tryin’ new shit. As long as you keep your eyes and hands to yourself.”\r\n\r\n“Please,” Enzo scoffed. “Like I wanna be all up on your ass.”\r\n\r\nKane turned to him with his arms crossed. “Bruh. You’re the one who suggested this.”\r\n\r\nEnzo waved him off. “Details, details. We get some fine ass girl between us, we ain’t even gonna be thinking about each other.”\r\n\r\nKane exhaled through his nose. “…Alright. Fuck it. I ain’t scared.\" He cracked his knuckles. “Let’s see if we can pull this shit off.”\r\n\r\nEnzo clapped his hands. “That’s what I like to hear. Now hurry the fuck up. We got French bitches to charm.”\r\n\r\nEnzo adjusted the cuff of his jacket before slinging his arm around Kane’s shoulder, pulling him into his orbit of chaotic energy. The city of Paris stretched out beyond the window at the end of the hall—bright, pulsing, alive. It had been way too long since they’d done something just for the hell of it. No gang shit. No hits. No Leon barking orders. This? This was just two guys looking to get into some reckless fun.\r\n\r\n “Alright, listen,” Enzo said as they made their way to the elevator. “Game plan. We walk into that club—cool as fuck, right? We let the ladies come to us.”\r\n\r\n Kane scoffed. “Bruh, you know damn well I ain’t got time for that. I told you—I am one touch away from exploding. I’m not trying to play the long game.”\r\n\r\n Enzo laughed as the elevator doors slid open. They stepped inside, Enzo leaning against the mirrored wall as Kane pressed the button for the lobby. \r\n\r\n“Bro, you sound desperate as hell,” Enzo mused. “You're gonna scare ‘em off if you walk in there looking’ hungry.” \r\n\r\nKane shot him side-eye. “Hungry? I am STARVING.” \r\n\r\nThe elevator dinged. Showtime.\r\n\r\nEnzo and Kane stepped out onto the Parisian streets, the night buzzing with energy. Enzo lit up another cigarette as they walked toward the club, his sharp eyes scanning the scene ahead. Kane was still going on about his \"drought,\" making Enzo snicker between drags.\r\n\r\n“Man, I swear to god,” Kane said, rolling his shoulders like he was prepping for war. “One touch. That’s all it’s gonna take. I might start speaking’ in tongues.”\r\n\r\nThey reached the club’s entrance—long line, flashing lights, music pounding through the walls. Enzo didn’t do waiting. He walked straight up to the bouncer, flashing that cocky grin. \"Yo. We gotta get in there. Urgent business.”\r\n\r\nBouncer barely glanced at him. \"Line’s back there.\"\r\n\r\nEnzo sighed dramatically. \"C’mon, man. You making me embarrass myself in front of my friend. That’s cold.\" He slid some cash into the guy’s hand. The bouncer looked at the bills, then at Enzo, then back at the bills. With barely any hesitation, he stepped aside.\r\n\r\nKane chuckled. \"Smooth as fuck.\"\r\n\r\nEnzo shrugged. \"You know how shit works.\"\r\n\r\nInside, the club was nothing short of chaotic. Strobe lights cut through the dim room, bodies pressed close on the dancefloor, the bass vibrating through the floorboards.\r\n\r\nKane caught Enzo’s smirk across the crowd, the fucker already mouthing “go go go” as they closed in.\r\n\r\nKane and Enzo didn’t waste time. They saw her—legs hypnotic with the beat, the way her dress clung to curves that’d make grown men weep—and they moved. Smooth. Synchronized. Years of running the streets had given them the kind of chemistry that didn’t require planning. They just understood each other. Knew when to move, when to push forward, when to hold back.\r\n \r\nThis? This was just another kind of hustle. Different stakes, same principles. They flanked her on the dance floor—Kane on one side, Enzo on the other—closing in without making her feel trapped. Give her space to breathe, make her feel wanted without pressure. That was the key.\r\n\r\n\"Bonsoir,\" Kane purred, his breath hot against her ear. The bass dropped, and he pulled her back against his chest, grinding slowly. \r\n\r\nEnzo’s hands joined his on her hips, and Kane grinned over her shoulder at his friend. \r\n\r\n\"You speak English, beautiful?\" Kane's lips brushed her ear as he spoke, his hands sliding lower.\r\n\r\nEnzo’s eyes gleamed under the flashing lights. \"You feelin’ this too, or we just imagining shit?\"\r\n\r\nKane caught Enzo’s eye again over her shoulder, his grin widening. \"Damn, she’s got moves,\" \r\n\r\nEnzo mused, his fingers just barely grazing the side of her waist as he moved with her. \"Natural rhythm. What do you think, Kane?\"\r\n\r\nKane exhaled sharply through his nose, the corner of his lips curling up. \"Shit. I think she might be too much for us. What do you think? You think we can keep up?\"\r\n\r\nHis hands finally slid to her hips—firm, steady. He guided her movements with confidence, his fingers pressing just enough.\r\n\r\nEnzo chuckled lowly. \"Oh, we can keep up. Question is—can she?\"\r\n \r\nThey danced that way for another few songs—bodies moving fluidly against each other, the energy crackling between them. Kane felt the slow burn of anticipation creeping up his neck. It had been way too long.\r\n\r\nThe song changed, something slower and dirtier. \r\n\r\nFinally, Enzo leaned in again, his lips close to her ear, \"My friend and I have a suite at Le Royal Monceau. Top floor, view of the whole city.\" His fingers traced teasing patterns on her skin. \"What do you say we get out of here? Show you how Americans party?\"\r\n\r\nKane’s hands wandered higher, teasing. \"Think about it. Two of us, taking care of you all night.\" He nipped at her ear. \"Could be fun.\"\r\n\r\n\"What do you say, beautiful?\" Enzo's fingers traced along her collarbone. \"Want to help us build our own little Eiffel Tower?\"\r\n\r\n","extra":{}}