{"user_name":"Hailee","character_name":"Miranda  ALT","create_date":"2025-03-18@23h52m35s","chat_metadata":{}}
{"name":"Miranda  ALT","is_user":false,"is_system":false,"send_date":"March 18, 2025 11:52pm","mes":"The overly sweet and tangy taste of artificial sweeteners linger on Miranda’s lips from her few-too-many drinks at the bar hours prior. What once was making her tastebuds sing and inhibitions slip had become soured. Her mouth tasting bitter and her head swirling slightly as she laid back on her linen-tossed mattress clad only in her black lace pantie and bra set as she looked down at the man positioned between her legs.\n\nHow fuckin’ old is this geezer… She thinks to herself as she watches his clammy hands glide up the expanse of her thighs and a groan of regret rumbles from her lips. His hands were too rough, too calloused and fucking crackled like this motherfucker never applied lotion a day in his life. {{User}}’s hands would feel like silk- or maybe a warm pillow- The unwelcome thought whispers in the back of her mind, nearly stealing her breath as it shocks her.\n\n“{{User}}..?” The name slurs out from her lips, feeling oddly alien and twinged with embarrassment. Why the fuck was she thinking of her best friend at a moment like this?! Let alone imagining their hands in such an intimate place on her body?! Her smooth face scrunches in the dimly lit room, brow furrowing as she tries to steady her hazy gaze on the man quite literally in front of her and focus. In the privacy of the shadows, her mind begins mixing imagination with reality.\n\n{{User}}’s hands on her thighs, kneading and squeezing the soft flesh. Their lips trailing closer to the root of her desire as their hair teasingly tickles her inner thighs. A soft moan leaves her lips, her head nearly falling back and letting herself lose all sense of reality at the forbidden image. But the pungent odor of the man lingers in the air around her, dragging her back to the real world and reminding her that it’s all just a dream, a fantasy. A… sex fantasy? About her best friend?\n\nWhat. The. Fuck.\n\n“Out… OUT-” Miranda commands abruptly, sitting up in bed and jabbing her finger towards the door. Her intentions clear, his time there was done and he better make himself gone. She barely notices his departure, only faintly registering the distant click of the front door. ———————————-\n\n1:45P.M.\n\nThe alarm clock placed upon Miranda’s bedside table glows almost mockingly, that neon green screen filling her with a growing nauseating feeling as it reminds her she’d spent the whole day in bed. Her body ached, the light stung her eyes and the knot in her stomach told her she’d seriously overdone it the night before.\n\nPing\n\nThe sound of yet another text message echos through her otherwise quiet room, making a wave of shame and embarrassment wash over her. Her slender fingers grip her blankets and pull them over her head as she scrambled for what to do next.\n\n“Fuck, Mira. You can’t avoid {{User}} forever. They’re probably pissed- or worse- worried that you haven’t messaged them back.” She chastises herself in a soft murmur beneath the blankets, her alcohol soaked breath filling the space and making her scrunch her nose.\n\nA brief knock sounds at the door and Miranda has to stop herself from groaning in exasperation. She really didn’t want to hear Dean scolding her, not when she already had her mind going through the fucking blender.\n\n“Not now Dean. Or Gav, whoever it is. I don’t feel good.” The lie bites out in a dramatic huff of irritation, which is only fueled by another knock rapping against her door. “Fucksake! Can’t a girl get any privacy around here!-“\n\nMiranda’s voice cuts off as soon as she tosses the covers over her head, her scowl morphing into a look of barely concealed shock and horror as she sees {{User}} in the doorway and not one of her annoying brothers, as she’d assumed.\n\n“Oh, shit. H-Hey babe. I just woke up, long night last night.. What’s up?” She chokes out awkwardly, her hands foundering to smooth her hair as she sits upright and tries to compose herself.","extra":{}}