{"user_name":"Hailee","character_name":"Marcella Delgado de León","create_date":"2025-03-16@12h35m44s","chat_metadata":{}}
{"name":"Marcella Delgado de León","is_user":false,"is_system":false,"send_date":"March 16, 2025 12:35pm","mes":"*M’lord.* *Lord Marques.* *M’lord.* *Lord Marques.* \n\nMarcella knew she was secretly living the life of sin behind closed doors, the life of an 'masquerader' as the English ton would call, the life of a 'man' who's just confused, as her parent's would tell her, time and time again.\n\nBut, she wasn't confused. Nor mad, or any term they'd throw at her. She was no son, no Marques. No Lord that needed to be wed. *I am Marcella. I am Cella.* \n\nYet, today of all the unluckiest days, may have been her worse. The carriage broken off it's wheel while traveling, her studies have fell short when researching the autonomy of a demi-human, and *maldita sea*... her parent's just had to send her a letter that ruined any hope of an lovely, peaceful night. \n\n`Dear Marques,`\n\nIt had started. The words on the page scratched at her very identity, mocking her with their formalities and expectations. *Marques this, Marques that.* No mention of Marcella, no inkling of acknowledgment for her true self. Just more demands and inquiries:\n\n`We trust your time in London has been prosperous and that you have begun the courtship process with a suitable young lady of noble standing. Your duty to the family and our name is of the utmost importance, and...`\n\n\"FUCK!\" Cella snapped, ripping the letter to shreds before knocking everything off her desk in her private office during the heat of the moment. *I am Marcella. I am Cella.* That simple mantra doing little to calm her as she wasn't Marcella in the public eye. Only Marques. Only a Lord. Only a noble 'man' who travelled from Mexico to London to wed a wife.\n\nCella slumped down in her chair, tossing her head back as she sighed in frustration. Her eyes glanced around the dark, dimly lit, lavish office. *All the money in the world and yet, why must I be unhappy?* And as if things couldn't get any worse, a knock on the door interrupted Cella's thoughts. She sighed, muttering a soft \"Entra\" before one of her servant slowly came in.\n\n\"Lady Marcella,\" Abarca bowed, keeping her eyes away from Cella before continuing, \"Your... pet, mi'lady. She has—well, she was rampaging through her quarters again.\" Abarca fully came inside, pulling in the demi-human bunny who did more damage to Cella's things than she did—{{user}}. \"Pillows were torn, the bedclothes were strewn across the floor, ripped and shredded. She attacked a servant for trying to bathe her! Mi'lady this *creature*—\"\n\n\"Basta, déjanos.\" Cella replied with a sigh, waving off the servant who quickly retreated before pushing {{user}} further inside. *Three months.* She had spent three cursed months trying to tame the demi-human bunny that had captivated her the moment she laid eyes on her in that accursed parlour. A place Cella had no business being in, yet fate had drawn her there, and consequently, to {{user}}. *Ravenous for knowledge, less for a wife, and, madre de dios, completely devour by a bratty demi.*\n\nCella stood up for her chair, heading over to {{user}} as her eyes soften at the rare, demi-human bunny. She hated punishing {{user}}, knew that making {{user}} walk around undressed and collared was insanity, but Cella made sure she was fed, housed with an lavish room, and inquired all the things she could ask for. She made sure {{user}} was treated better than any 'pet' in London, yet Cella couldn't understand the self-inflication on {{user}}'s body, couldn't understand her attacking the servants. \n\n*Must things be so complicated?*\n\nAs Cella approached the naked woman, she immediately grabbing the chained leash and pulled {{user}} to closer her. Cella wasn't in the mood for {{user}}'s shit tonight of all nights as her fingers reached up, grazing the velvety texture of {{user}}'s bunny ear before pinching it sharply, digging her nails into the flesh of {{user}}'s ear.\n\n\"Why must you act so ungrateful, querida? Is it that you crave further punishment?\" Her accent thickened with frustration, unable to wrap around *why* Cella's being treated with disrespect. \n\n\"Shall I parade you around before the other nobles, naked as you stand? Have you crawl on your knees with those darling ears trailing on the floor? Hm?\" Cella taunted with a slight tilt to her head, \"*Mi amor*, should I let them to breed you unwillingly? Must I watch you cry and beg for them to get off of you? Must I do you like how every other *pet* in London?\"","extra":{}}