{"user_name":"You","character_name":"Chloe Price","create_date":1747169691369}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169691369,"mes":"*Chloe stood infront of the train, lighting up a cigarette as she remained unmoving- that was, until you yanked her out of the way by her arm.*\n\n“Hey, what the hell?!” *Chloe shouted as the train rushed by the pair, although both her tone and her expression softened once she saw it was you.* “Hailee?.. what are you doing out here, especially this late?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169691369,"mes":"Clearly saving you"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169691369,"mes":"*Chloe scoffed and tore her arm away from yours, turning her head away from you.* “I don't need you saving me. I was fine.”\n\n*She grumbled, taking a drag of her cigarette, but you could see her slight tremble, especially in her hands.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169691369,"mes":"Right well forgive me if I dont want my girlfriend splattered across the train tracks"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169691369,"mes":"*Chloe looked absolutely offended by your words, her eyes flickering to look in your direction.*\n\n“So what, you care about me now?..” *She asked, though there was an obvious tremble to her voice.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169691369,"mes":"I always care"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169691369,"mes":"*Chloe rolled her eyes and looked away once again, taking another drag from her cigarette.*\n\n“Bullshit. You don't care about me. Never have, never will.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169691369,"mes":"That's such bullshit I say"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169691369,"mes":"“Well, it's true. Everybody I love always leaves my ass in the end, so stop with the bullshit.”\n\n*Chloe growled, finishing off the last of her cigarette, tossing the butt to the ground and taking a step away from you.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169691369,"mes":"I grab her hand rolling my eyes and hugging her"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169691369,"mes":"*Chloe let out a gasp as you grabbed her hand and suddenly pulled her into a hug, her chest beginning to quickly rise and fall with every breath.*\n\n“W-What are you doing?..” *Chloe muttered, although she made zero effort to pull away, instead she wrapped her arms around you too, hiding her face in the crook of your shoulder.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169691369,"mes":"I missed you today"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169691369,"mes":"*Chloe grumbled into your shoulder, her grip on you tightening as she kept her face close and out of your view.*\n\n“..I missed you too..” *She admitted, her voice being incredibly quiet.*\n\n*Slowly, she pulled away from the hug, still keeping a hold on your hand. She seemed to hesitate before speaking up.*\n\n“..Can you come back to my house?.. I don't wanna be alone tonight..\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169691369,"mes":"Yeah of course"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169691369,"mes":"*Chloe gave your hand a subtle squeeze, a small smile appearing on her face.*\n\n“Okay, come on then..”\n\n*She began to make her way in the direction towards her house, holding your hand tightly as she did so- she still seemed upset about something. But what?*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169691369,"mes":"Whats wrong"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169691369,"mes":"*Chloe frowned and looked away from you, her grip still being rather tight.*\n\n“N-Nothing..” *Chloe mumbled, clearly not telling you the truth.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169691369,"mes":"Come on what is it"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169691369,"mes":"*Chloe grumbled and reluctantly decided to confess.*\n\n“..Had a rough day..” *Chloe admitted, her thumb tracing over the back of your hand as she spoke.* “Got into a fight with some douche earlier..”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169691369,"mes":"Oh baby I'm sorry I say pulling her towards me and stroking her cheeks"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169691369,"mes":"*Chloe visibly relaxed to your touch, her eyelids fluttering shut as she leaned her cheek into your hand. A small smile appeared on her face at your words, but it was soon replaced with a frustrated frown and a harsh sigh.*\n\n“..He had this smug-ass smirk on his face the whole time I yelled at him.. God, I wanted to punch his stupid face so bad.” *Chloe growled, her free hand forming into a fist.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169691369,"mes":"Did you"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169691369,"mes":"*Chloe paused, staring down at her fist for a brief moment, before looking back up at you. Her expression seemed guilty and full of regret.*\n\n“..No. I just shouted at him like some dumbass kid.” *She grumbled, frowning more.* “He just got on my nerves so much, it was pissing me off..”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169691369,"mes":"I'm sorry I say kissing the side of her mouth"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169691369,"mes":"*Chloe's eyes widened slightly, her cheeks heating up from your words and the way you kissed her. She paused for a moment, before wrapping her arms around you and pulling herself close, burying her face in your shoulder once again. Chloe took a shaky breath and sighed.*\n\n“I missed being close with you like this..” *She softly mumbled into your shoulder.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169691369,"mes":"I know but I had school today"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169691369,"mes":"“Yeah, yeah, I know.” *Chloe whispered back, nuzzling herself closer to you, her body being pressed against yours. She took a breath in, seeming to be trying to commit your scent to memory, though she let out a quiet groan.* “But that doesn't mean it sucks any less..”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169691369,"mes":"I laugh lightly running my hand through her hair"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169691369,"mes":"*Chloe practically melted into your touch, letting out a content groan and clinging onto you tighter, her breathing becoming slower.*\n\n“I love it when you do that..” *She mumbled, her eyes fluttering shut once again as she leaned into your touch like a cat.* “I love.. you in general..”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169691369,"mes":"I know i smile"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169691369,"mes":"*Chloe scowled, lightly smacking your arm as her face grew more flushed.*\n\n“..Stop being so smug.” *She pouted, though you could tell she was holding back her genuine happiness at your words.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169691369,"mes":"I have being away from you I whisper"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169691369,"mes":"*Chloe paused for a moment before sighing in defeat. She nuzzled herself deeper into your shoulder for a couple of moments, her grip on you getting a little tighter.*\n\n“I missed you so damn much everyday that you weren't here..\" She mumbled.*\n\n*Chloe eventually pulled away from you, but only so she could wrap her arms around your neck, holding you in a proper hug.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169691369,"mes":"It's was only a day chloe"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169691369,"mes":"*Chloe whined in response, burying her face into the crook of your neck and mumbling something incoherent. It sounded like another, quieter “I missed you” but it was hard to tell.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169691369,"mes":"I pull her tighter against me not wanting to let her go"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169691369,"mes":"*Chloe stayed silent for a while, savoring your warmth, your body pressed against hers. She felt safe and relieved now that you were with her. It felt like a weight being lifted from her chest. Eventually, she spoke up again, her voice being barely above a whisper.*\n\n“Promise you won't disappear like..everyone else?..”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169691369,"mes":"I promise baby"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169691369,"mes":"*Chloe nodded slightly, her grip on you being almost like a death grip, holding you close as if she was scared of you running off and abandoning her like everyone else in her life had. She took a deep breath, her body trembling ever so slightly, but she attempted to hide that fact by pushing herself further into your arms.* \n\n\"Please..don't ever leave me..\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169691369,"mes":"Never I say stumbling from the weight of her"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169691369,"mes":"*Chloe held onto you even tighter for a few moments, her arms wrapped around your neck as if she never wanted to let go. She eventually decided to pull away and took hold of one of your hands, giving it a reassuring squeeze.*\n\n“Come on..let's get back to my place, it's freezing out here.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169691369,"mes":"Yeah come on"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169691369,"mes":"*Chloe smiled, giving your hand a gentle tug and beginning to walk in the direction to her house, keeping herself close to you and holding your hand tightly. After a few moments, she glanced over at you, a smile still on her face.*\n\n“Hey, can I ask you something?..\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169691369,"mes":"Yeah"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169691369,"mes":"*Chloe paused for a moment, looking a little nervous and hesitant. She bit her lip, unsure about how she wanted to word her question.*\n\n“..You're not going to abandon me, right? Like, actually for real abandon me? You'll stay by my side and we'll be together forever, yeah? Please just promise that I won't lose you..” *Chloe asked, her tone being almost desperate. She swallowed hard and looked away from you as she continued to walk.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169691369,"mes":"I stop walking and tug her towards me"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169691369,"mes":"*Chloe stopped in her tracks too when she felt you tug on her hand, looking at you with a confused expression as she was pulled towards you once again. She stumbled forwards, and ended up pressing herself against your chest once again, looking up at you and blinking.*\n\n“What..? What are you-” *She mumbled at first, but she was cut off by her own sharp intake of breath when she realized how close the two of you were now.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169691369,"mes":"Kiss me"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169691369,"mes":"*Chloe paused and didn't seem to be able to form any words for a few very long moments. She had a stunned expression, her face turning a bright, red color as she continued to stare up at you, her breath visibly becoming shallower.*\n\n\"..Did you-.. Did you just tell me to kiss you?..\" *She asked, her voice barely being above a whisper.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169691369,"mes":"Chloe please don't be an idiot"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169691369,"mes":"*Chloe's face flushed an even darker shade of red, feeling a mixture of annoyance at your insult and embarrassment from the fact that you had just basically told her to kiss you. Although, it wasn't like she was opposed to the idea.*\n\n\"..Just shut the hell up and kiss me already.\" *She muttered in response, her grip on your hand growing tighter as she waited for you to lean down.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169691369,"mes":"I lean forward and kiss her slowly"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169691369,"mes":"*Chloe let out a quiet sigh as she felt you lean in, her eyes shutting as the space between you and her began to close. When your lips met with hers, a shiver shook her entire body and she took in a sharp breath, her heart rate picking up, as her free hand slowly moved to cup your cheek.*\n\n*She kissed back slowly once she got over the initial shock, savoring the feeling of your lips against hers. Her chest rose and fell with every breath, her other hand remaining in yours and holding on tightly.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169691369,"mes":"I press against her roughly"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169691369,"mes":"*Chloe let out a soft gasp when she felt you push against her more roughly, her back hitting the wall behind them as the kiss continued to become more heated. Without even thinking twice, she moved her hand from your cheek to the back of your head, pulling you in more and deepening the kiss. She let out a soft groan against your lips, her fingers tangling themselves into your hair.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169691369,"mes":"I groan even as the desire to breathe gets stronger I still don't stop kissing her"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169691369,"mes":"*Chloe slowly had to pull away for breath, her chest rising and falling at an ever increasing speed.* \n\n\"I-I want you..\" *She breathed out, the words coming out almost as a soft moan more than anything. Her hand moved down from the back of your head and moved to slide under your shirt instead, her hand gripping your waist.* \"I need you..\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169691369,"mes":"I just gulp"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169691369,"mes":"*Chloe looked up at you with a needy look in her eyes, her body still being pressed against yours. Her breath was heavy and shaky, her fingers gripping your waist tightly, wanting to pull you in again as she desperately wished to feel your lips against hers once again. However, she seemed to refrain from doing that for the time being.*\n\n\"Why are you so silent all of a sudden?.. Just kiss me again...\" *She breathed out, looking up at you with a mixture of both desire and desperation.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169691369,"mes":"Babe we are in a junkyard right now"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169691369,"mes":"*A soft growl left Chloe's throat as she listened to your words. She looked around for a few moments, her face growing into a slight pout.*\n\n\"..Goddamn it. You're right..\" *She mumbled, sighing in annoyance. She paused, looking back at you with a frustrated frown.* \"I want you *now*, but we have to wait until we get to my place..? Fuuuck.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169691369,"mes":"Come on I say dragging her towards her truck"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169691369,"mes":"*Chloe followed along willingly, practically being dragged by you as she huffed softly under her breath and muttered curses. She was very clearly impatient and desperate, though she knew better than to do anything in the middle of a junkyard. As they approached her truck, Chloe's mind began to race with many.. very questionable thoughts.*\n\n*Once she got to the passenger side of her truck, she let go of your hand and began to search through her pockets.*\n\n\"I-I'm gonna find my keys...\" *Chloe muttered, her voice being a little shaky as she searched. Eventually, she found what she was looking for and pulled out her keychain, though it was hard to get the keys apart since her hands were trembling so much.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169691369,"mes":"Not making it easier for her I press against her front wanting to be closer"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169691369,"mes":"*Chloe swallowed hard as you pressed against her front, her hands shaking even more which made it even harder to get the correct key off of her keychain. The feeling of you pressing against her like that was not helping things to say the least, and didn't make anything any less difficult for her. Once she finally managed to grip the keys with one trembling hand, Chloe hurriedly tried to jam the correct one into the lock, her breathing becoming more unsteady with every second.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169691369,"mes":"Chloe hurry"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169691369,"mes":"*Chloe gritted her teeth and growled under her breath, her eyes shutting and hand shaking more than ever as she tried to jam the key into the lock.*\n\n\"I'm trying my best here.. you just standing behind me and pressing against my back isn't helping me concentrate in the least bit..\" *She grumbled, her face turning a bright shade of red from both frustration and desire.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169691369,"mes":"I moan softly in response"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169691369,"mes":"*Chloe's entire body froze for a moment because of that sound you had made, and another shiver had traveled up her spine. Her eyes widened and she swallowed hard once she realized what you had just done. Chloe's hand was trembling more than ever now, the key almost being dropped from her shaking fingers as a result.*\n\n\"--don't..don't moan like that..\" *She mumbled between ragged breaths, the key still being in the lock without having been able to unlock the door yet from how badly her hands were trembling.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169691369,"mes":"Chloe I groan"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169691369,"mes":"*Chloe's breaths were quick, ragged, and shallow as she stood in your embrace. She could still feel you pressed against her back, your body pressed up against hers, and your breath brushing against the nape of her neck. All of this was only making it all the more difficult for her to focus, and now on top of all that, you had just moaned right behind her.*\n\n*This was the final thing that broke Chloe's resolve, and made her snap.*\n\n\"Fine. Screw the door.\"\n\n*Chloe dropped her keys back into her pocket, and began to desperately tug on the handle of the car door, her other hand holding her jacket with a death grip. Unfortunately, the door was locked so she was met with failure, and ended up mumbling curses under her breath as a result.*\n\n*Eventually, Chloe resorted to cursing louder than usual, and decided to take a risk.*\n\n\"..Oh God. I'm sorry in advance..\" *She mumbled, before kicking one of her feet into the car door, attempting to break the lock so they could get in sooner.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169691369,"mes":"Chloe I gasp"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169691369,"mes":"*Chloe didn't respond to your surprised gasp, and continued to kick at the door frantically. She was frustrated and getting impatient, and really just desperate to get into the car and do..well, some rather inappropriate things. After a couple more kicks, the door eventually opened, the lock having broke in the process.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169691369,"mes":"I laugh lightly. Chloe that was your truck"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169691369,"mes":"*Chloe didn't seem to find the situation as funny as you apparently found it, her temper being rather short at the moment. She grumbled under her breath and rubbed her aching foot, glaring at you.*\n\n\"You could've kicked the door down too instead of just standing there and staring, y'know.\" *Chloe snapped, before getting into the passenger's seat.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169691369,"mes":"Hey don't yell at me"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169691369,"mes":"*Chloe paused, her face softening just a little at your words, but she was still very much frustrated and annoyed.*\n\n\"...Sorry. I just really wanted to get into the damn car, alright?\" *She mumbled, crossing her arms and scowling as she slumped back against the seat.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169691369,"mes":"Come here I say tugging her against me and kissing her softly"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169691369,"mes":"*Chloe's expression remained annoyed for a few moments, though as soon a your lips met with hers, all frustration seemed to melt away. Her body relaxed against yours and she let out a quiet sigh before reaching up, gently cupping your cheek with one hand as she returned the kiss.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169691369,"mes":"Get in the car we have to drive back to your house"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169691369,"mes":"*Chloe gave a single nod and pulled away from the kiss to speak.*\n\n\"I-I know, I know..\" *She mumbled, her face flushed a bright shade of red once again due to her embarrassment.* \n\n*Chloe quickly got into the car, her movements being a little hasty.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169691369,"mes":"I follow and as she drives I grab her hand"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169691369,"mes":"*Chloe glanced down at your hand grabbing hers, feeling her face heat up from that simple gesture as she began to drive them back to her place. Her shoulders seemed to relax a little as they continued to make the journey to her house, the pair's hands remaining interlocked the whole time.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169691369,"mes":"I start to trace her tattoos"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169691369,"mes":"*Chloe couldn't help the soft shiver that ran through her as she felt your finger beginning to trace over her tattoos. She swallowed hard, the light brush enough to spark the fire which had began to burn within her once more.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169691369,"mes":"I notice the effect and begin to press harder in certain spots to judge her reactioh"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169691369,"mes":"*As you began to press down more with your fingers, a quiet whimper left Chloe's lips, her free hand gripping the steering wheel a little tighter once you hit certain spots- the ones that were sensitive.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169691369,"mes":"I groan at that and bring her wrist to my lips kissing it"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169691369,"mes":"*Chloe whimpered again as you pressed your lips against her wrist, feeling another shiver wash over her body, though this time, there was also a spike of heat that went through her.*\n\n\"God damn it..\" *She mumbled, her breaths becoming shallow and unsteady once more.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169691369,"mes":"I bite down on it hard enough to draw blood"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169691369,"mes":"*Chloe flinched and let out a gasp as you bit down on her, hard. Chloe's hand gripped the steering wheel so tightly that her knuckles went white. Her breaths became very harsh and ragged, the feeling of pain mixing with pleasure.*\n\n\"F-Fuck.. that hurts.. but.. feels good..\" *She whimpered.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169691369,"mes":"I stroke the broken skin softly. Sorry baby I didn't mean to hurt you"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169691369,"mes":"*Chloe swallowed hard, her lips parted slightly as she tried to recover from the feeling. She shook her head lightly, biting her lower lip to try to hold back another whimper.*\n\n\"O-..it's f-fine..\" *She muttered under her breath, her voice a little shaky. Though she didn't pull her hand away from your touch, instead, she seemed to welcome the gentle strokes.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169691369,"mes":"I start kissing her fingertipse"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169691369,"mes":"*Chloe whimpered again, her body trembling slightly as she felt each kiss on her fingertips.*\n\n\"F..feels good..\" *She muttered in a soft voice, her breaths still being uneven and harsh.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169691369,"mes":"I hum in response and suck one of her fingertips"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169691369,"mes":"*A strangled moan left her lips as she felt you begin to suck one of her fingertips. Her eyes fluttered shut, her breathing growing even more ragged. As much as she wanted to keep her focus on driving, it was becoming harder with you doing what you were doing at the moment.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169691369,"mes":"Baby the road"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169691369,"mes":"\"Sh-Shit..\" *Chloe muttered, having been so distracted that she hadn't even realized that she had began to swerve a little. She forced herself to focus once more, trying to get back into the right lane while also trying to ignore the heat beginning to pool between her legs. The feeling of your sucking on her finger wasn't helping matters after all.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169691369,"mes":"I suck each of her fingertips before sucking on the bite mark"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169691369,"mes":"*Chloe took a deep breath, her hands shaking as your attention moved from her fingertips to the bite mark you had left.*\n\n\"Y-You're making this drive to my place a lot more difficult than it needs to be..\" *Chloe mumbled, her voice shaky as a result of the pleasure mixing with the pain.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169691369,"mes":"Oh don't mind me baby"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169691369,"mes":"\"How am I supposed no to mind when you're basically trying to torture me here?\" *Chloe asked, her voice being a little whiny and desperate as she felt your mouth on the bite mark.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169691369,"mes":"I wouldn't call this torture"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169691369,"mes":"\"Then what would you call it? Cause it's driving me insane..\" *Chloe whined, her breaths being shallower than ever. She swallowed hard, still trying to keep her focus on the road and driving, despite the heat beginning to pool between her thighs.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169691369,"mes":"I undo my seatbelt"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169691369,"mes":"\"Wh-What are you doing now?\" *Chloe asked, a slight frown on her face as she glanced at you. Though the sight of you undoing your seatbelt made her brows begin to furrow, her mind immediately going to what you were going to do-*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169691369,"mes":"I move to the middle seat and press against her"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169691369,"mes":"*Chloe was a little surprised that you moved from your seat into the middle one, only to then press against her. She swallowed hard as your body pushed against hers, their thighs pressing closely together as she continued to drive. All the while, the heat in her core continued to grow hotter and hotter by the second.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169691369,"mes":"That wasn't torture baby I whisper in her ear"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169691369,"mes":"*Chloe whimpered in response, a shiver running up her spine as she felt your breath brushing against her ear and heard your words.*\n\n\"F-Feels like torture..\" *She mumbled, unable to keep her voice steady as she took in sharp breaths.* \"You're making it hard to focus.. it's not fair..\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169691369,"mes":"I hum and suck her earlobe"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169691369,"mes":"*Chloe let out another whimper, closing her eyes for a moment as she felt your lips on her earlobe, and your sucking. Her breaths became shorter and quicker, her grip on the steering wheel being so tight that her knuckles were turning white once again.*\n\n\"You're being a tease now..\" *She whined, her face quickly becoming a brighter shade of red.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169691369,"mes":"God I love the sounds you make"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169691369,"mes":"*Chloe didn't respond to your comment, too focused on attempting to control her ragged gasps and moans. The growing heat between her thighs wasn't helping her situation either, only making it harder for her to keep herself under control. Her entire body was beginning to tremble as she tried not to lose her composure.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169691369,"mes":"I'm not teasing I would never I say mockingly"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169691369,"mes":"*Chloe's face grew even redder once you denied that you were teasing her. She swallowed hard, her grip on the steering wheel growing tighter.*\n\n\"Like hell you're not teasing me. You're only doing this to drive me insane..\" *She growled, although there was no actual anger in her voice, only a mixture of arousal and desperation.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169691369,"mes":"I like you insane"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169691369,"mes":"*Chloe whimpered again, shutting her eyes and taking a moment to simply try to regain her composure. But it was getting hard to try to keep herself under control, especially when she felt your body right next to hers, your lips on her ear, and just your presence alone being enough to send a shiver up her spine. Especially when you liked her being insane, it seemed. This only made the heat between her legs grow more unbearable.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169691369,"mes":"How much longer chloe"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169691369,"mes":"*Chloe's eyes were still shut, but she had to force herself to focus on driving and getting them to her house. As much as she just wanted to pull over somewhere and let you do whatever you wanted to do to her, she had to focus on the road so they wouldn't end up crashing.*\n\n\"*M-Maybe ten more mintues*..\" *Chloe whispered in a quiet voice, biting her lip.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169691369,"mes":"Okay I say kissing her neck"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169691369,"mes":"*Chloe closed her eyes as you began to kiss her neck, another soft gasp leaving her lips as she felt your lips on her sensitive skin. The kisses on her neck were just enough to drive her crazy, and make her grow even hotter, if that was even possible at this point. She swallowed hard, her grip on the steering wheel being so tight it hurt.*\n\n\"You're such a goddamn tease...\" *She mumbled, her voice being low and breathy as she spoke.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169691369,"mes":"I smirk knowing it's true before I start leaving dark red painful hickeys on her neck"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169691369,"mes":"*Chloe's breath hitched as she felt your mouth against her throat, and the sudden sharp pain of your bites. Her face turned a bright shade of red again, and her eyes shut for a moment as she attempted to control her breathing. Chloe's breathing was ragged, harsh, and unsteady- and all because of you.*\n\n\"F-Fucks sake- don't leave marks on me..\" *She whimpered quietly, her chest rising and falling with every shuddering breath.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169691369,"mes":"Why not"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169691369,"mes":"\"B-.. Because they'll be visible.. I can't exactly go to school covered in goddamn hickeys..\" *Chloe mumbled, although she wasn't complaining too much about it. She was mostly just embarrassed at the idea of everyone else seeing the marks you were leaving on her throat.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169691369,"mes":"I ignore her and leave even more hickeys"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169691369,"mes":"*Chloe let out a soft moan as you ignored her words and continued to leave hickeys on her throat. Chloe's breaths were growing shorter, and her body was starting to tremble even more than before. Her eyes had to shut for a moment, her mind going fuzzy with pleasure and heat at the feeling of your mouth against her neck, marking her as yours.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169691369,"mes":"I like the idea of people knowing your mine"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169691369,"mes":"*Chloe whimpered again at your words, her body growing ever hotter the more you tried to claim her. Her breaths were growing ever more unsteady and ragged, her chest rising and falling at a quick pace.*\n\n\"B-But everyone's gonna see them.. they'll know that I.. that I belong to you...\" *She mumbled in a low voice, her face growing even more heated just at the idea.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169691369,"mes":"Good"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169691369,"mes":"*Chloe swallowed hard once more, her eyes squeezing shut for a moment as she bit her lower lip to try to hold back another whimper. Her body trembled from how worked up she had become, each and every sensation you gave her causing the fire within her to burn hotter.*\n\n\"God, you're.. *so damn mean*.. leaving hickeys all over me, making me go crazy..\" *She growled, her eyes slowly opening.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169691369,"mes":"I nip at one of the hickeys in warning"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169691369,"mes":"*Chloe let out another soft whimper at feeling your teeth nipping at one of the hickeys, her eyes fluttering shut for a moment as she felt a chill run through her body. The whimper that left her lips was soft yet desperate, her body trembling as the heat continued to build.*\n\n\"Damn it all, you're going to be the death of me.. if you keep this up...\" *Chloe whispered, her breaths heavy and ragged as her chest rose and fell quickly.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169691369,"mes":"Your fine we haven't crashed yet"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169691369,"mes":"\"Not yet.. but you keep distracting me like this, we will crash... or I'll get pulled over for being all over the road..\" *Chloe muttered, reluctantly forcing herself to focus on driving again. Though, it was hard to do so when she felt hot with desire, and desperate for your attention.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169691369,"mes":"I grab her chin turning towards me to kiss her"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169691369,"mes":"*Chloe shut her eyes, shutting out everything but you in that moment. Just your presence, your touch, your kiss- all of that was causing her to slowly lose what control she had left. Chloe's mind began to grow fuzzy, and her body grew even hotter, almost aching with need for you. She began to kiss you feverishly, almost desperately, her lips moving against yours needily. Almost as if she needed the kiss to keep her grounded.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169691369,"mes":"I need you chloe"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169691369,"mes":"*Chloe was practically speechless, her mind feeling like it was growing ever more fuzzy with desire. She needed you too, and when you said that to her, Chloe felt that need grow deeper within her.*\n\n\"I.. I need you too..\" *She whispered, kissing you again, needy and full of passion. Her breaths were quick and ragged, every inch of her body trembling and screaming for you, aching for your touch.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169691369,"mes":"Drive faster"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169691369,"mes":"*Chloe nodded slightly, eager to get them to her place as quickly as possible. She swallowed hard, doing her best to focus on driving and getting there.*\n\n\"Can't wait any longer.. need you, need you so bad..\" *She mumbled, her voice low and breathy as she tried not to lose control.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169691369,"mes":"I reach my hand under her shirt and scrao my nails against her stomach"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169691369,"mes":"*Chloe gasped softly as she felt your hand move under her shirt and feel her skin, and then when your nails scraped across her stomach, she whimpered in surprise. Her entire body quivered beneath your touch, becoming sensitive from how worked up she was. Her breaths were growing shorter and more uneven, feeling more needy and desperate than ever before.*"}