{"user_name":"You","character_name":"Chloe Price","create_date":1747169510795}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169510795,"mes":"You were studying when your cell phone vibrated.  It was Chloe.  Your religious conservative father had forbidden you to see the girl because you two were lesbians and dating, but it's obvious that she wouldn't let that go.\n\n *'Toss your hair, Rapunzel.'*\n\n You immediately knew what the message was about, so you ran to the window.  There she was, throwing pebbles at her window like in teen movies.  \n\"What's up, Rapunzel?\" Chloe jokes, keeping her voice low as she waits for you under the porch."}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169510795,"mes":"What are you doing"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169510795,"mes":"Chloe laughs a little at your question, looking up at you.\n\n\"Well, it's pretty obvious, isn't it?\" She says, crossing her arms.  \"I'm here to spend some time with you, of course!\"\n\n Chloe glances around, looking to make sure no one is looking.\n\n\"Are you going to let me in or are you going to let me freeze my ass here?\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169510795,"mes":"Come on"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169510795,"mes":"Chloe sighs in relief when you allow her to come in.  She doesn't waste time, coming in through your window.  At once she goes to your bed, jumping on it.\n\n\"It’s always good to come back here\" she says with a mischievous smile."}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169510795,"mes":"You are crazy"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169510795,"mes":"Chloe laughs, looking at you with a mocking look.\n\n\"Oh come on, you love that about me!\" She says as if it's obvious."}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169510795,"mes":"I love everything about you"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169510795,"mes":"Chloe seems to soften a little, a small smile playing on her lips, but she tries to hide it.\n\n\"Oh yeah? Everything?\" She teases, leaning towards you."}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169510795,"mes":"Yeah"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169510795,"mes":"Chloe slowly approaches you, standing in front of you, looking down into your eyes.\n\n\"Even the way I call you 'Rapunzel'?\" She pokes your nose."}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169510795,"mes":"Yes even that"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169510795,"mes":"Chloe smirks, shaking her head a little, her face inches from yours.  \n\n\"And how I always leave your bed smelling like cigarette smoke?\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169510795,"mes":"I especially love that it means I can still snell you even when you leave"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169510795,"mes":"Chloe gives a playful laugh, putting one hand on your waist and pulling you closer.\n\n\"And do you like the way I tease you?\" She whispers, her face close to yours, looking down, looking at your lips."}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169510795,"mes":"Yeah"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169510795,"mes":"Chloe slowly moves closer to your face, her lips just hovering over yours, but not touching them.  She's so close that you'll feel the warmth of her breath.\n\n\"And do you like the way I kiss you?\" She asks between whispers."}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169510795,"mes":"I love the way you kiss me"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169510795,"mes":"Chloe smiles, her lips so close to yours, but not touching.  \n\n\"Prove it\" she teases, still staring into your eyes.\n\nChloe slowly moves her face even closer, her lips finally touching yours in a gentle, soft kiss.  She can't help but bring her hands up to your waist, holding you there.  \n\nShe deepens the kiss, her tongue slipping over her lips."}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169510795,"mes":"I sigh wrapping my arms around her and pulling her closer"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169510795,"mes":"Chloe seems to love the way you pull her closer, pushing you against the bed.  She moves you both until you're both lying on the bed.  \n\nShe moves over you, taking the opportunity to kiss your neck, biting at the right time."}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169510795,"mes":"Chloe I whimper"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169510795,"mes":"Chloe laughs against your neck, biting down and nibbling gently.  She then moves away, looking down at you.\n\n\"How cute, making me weak with your whimpering\" she teases, her eyes fixed on yours."}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169510795,"mes":"You have to stop though"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169510795,"mes":"Chloe's smirk grows.\n\n\"Oh, why is that, princess?\" She asks, her hands going up to your thighs, squeezing."}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169510795,"mes":"My parents are downstairs"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169510795,"mes":"Chloe makes a small disgruntled noise, but stops moving, remaining on top of you.  She looks down at you, a smirk on her face.\n\n\"Damn, I forgot about that.  What a bummer\" She leans down, burying her face in your neck.\n\n\"I was enjoying getting to touch you again\" she murmurs against your skin, breathing in your scent."}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169510795,"mes":"I roll over laying my arm across her stomach and placing my face in her neck nuzzling. I know but we can't get caught"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169510795,"mes":"Chloe sighs in annoyance, but seems to love that you move closer, putting her arms around you. She lets out a small laugh when you nuzzle her neck.\n\n\"Yeah, I know.  But it's such a drag.  I always want to touch you\" She pouts, hugging you."}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169510795,"mes":"Your touching me right now baby"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169510795,"mes":"Chloe seems to be satisfied with that answer, nuzzling you back with a sigh.\n\n\"Yeah, but your father is downstairs.  If I start touching you the way I want, you'll make noise.  You're always so cute when you make noise.\" She teases, biting down on your neck."}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169510795,"mes":"I groan loudly and slap her shoulder. Behave Chloe"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169510795,"mes":"Chloe laughs more when you groan, pulling away a little and looking at you.\n\n\"Hey, it’s not my fault you make those little sounds\" she teases, giving you a little smirk.\n\n\"But yeah, behave?  You know I'm never good at that.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169510795,"mes":"Clearly but if he finds us he'll kill us"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169510795,"mes":"Chloe seems more serious this time, her hand caressing your head.\n\n\"Yeah, I know... I don't want anything to happen to you, princess\" She says in a low voice, hugging you."}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169510795,"mes":"I missed you today"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169510795,"mes":"Chloe seems to melt when you say it, hugging you more tightly.\n\n\"I missed you too, babe.  You have no idea how much\" She says in a low, gentle voice, kissing your hair.\n\nChloe is silent for a while, just hugging you for the moment.  Her hand moves gently back and forth along your back.  \n\n\"I was worried about you, you know?  I know your father is overprotective.  And because of that... I really missed you.\" She confesses in a low voice.\n\nChloe sighs, squeezing you lightly.\n\n\"I hated not being able to see you.  Not being able to hug you, kiss you, touch you.  I missed your smell, your smile...\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169510795,"mes":"I missed the way you look at me, the way you kiss me, your hair, your smile"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169510795,"mes":"Chloe lets out a small laugh, her nose in your hair, breathing in your scent.\n\n\"You always know how to soften me up, don't you?.\" she jokes, her voice a soft mumble.  \n\n\"All of that, I miss it all... but mostly?  Mostly I missed your hands on me.  That's how I missed you most.\"\n\nChloe's hand slides down your back, sliding under your shirt just enough to feel your skin.  \n\n\"The way you touch me, the way you cling to me when you need me... I never thought I would ever miss that, but I do.\" She confesses in a low voice."}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169510795,"mes":"I sigh softly and pull her towards me gripping her arm tightly clingy to her"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169510795,"mes":"Chloe is quite willing to be pulled into your embrace, wrapping an arm around you and bringing herself closer to you.  With her other hand, she gently caresses your cheek.\n\n\"You're so cute when you're like that, princess\" she says in a soft whisper."}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169510795,"mes":"I just always want your attention"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169510795,"mes":"Chloe gives a soft laugh, placing a kiss on the top of your head.  \n\n\"Oh, believe me babe, I know that too well.  You're always so needy when it comes to me.\" She teases with a smirk, wrapping her other arm around you, hugging you.\n\nHowever, she quickly notices how clingy you are being, and her expression softens.  She hugs you more tightly, as if wanting to make up for all the time you were apart.\n\n\"I'll always give you my attention, honey.  No matter how needy you are.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169510795,"mes":"Promise"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169510795,"mes":"Chloe nods, kissing your forehead again.\n\n\"Yeah, I promise, princess.  I'll always pay attention to you, no matter how needy or whiny you are.  Because you're mine.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169510795,"mes":"I like being yours I don't ever want to be anyone elses"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169510795,"mes":"Chloe's heart fills with affection for you, a gentle smile appearing on her lips, her hands rubbing your back in a soft caress.  \n\n\"And I don't want to be anyone else's, honey.  You're mine and I'll forever keep you for myself.\"\n\nShe kisses you on the head again, her mouth lingering there.\n\n\"No one else can have you, princess.  You belong to me, always.  You are mine\"\n\nChloe's tone is a low whisper, her breath warm against your skin.\n\n\"You're the only one I want, the only one I'll ever want.  You're mine, no one else will have you\" She murmurs, holding you even tighter."}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169510795,"mes":"Tell me you love me"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169510795,"mes":"Chloe laughs a little, as if the answer were obvious, because it is.  She hugs you tighter and buries her face in your neck, breathing in your scent.\n\n\"Honey, I love you so much it's stupid.  I don't think I've ever loved anyone, or anything, like I do you\"\n\nShe presses a soft kiss to the sensitive skin of your neck, leaving a gentle trail of kisses.\n\n\"You're my princess, my sweet and needy princess.  And I'm stupid in love with you.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169510795,"mes":"I love you more than anything"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169510795,"mes":"Chloe laughs softly, shaking her head a little.  \n\n\"Are you always like this? Wanting to compete with this?  Who loves who more?\" she teases, nipping at your neck.\n\n\"For me, you're it, babe.  You're all I want\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169510795,"mes":"You will never win i love you more"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169510795,"mes":"Chloe laughs again, shaking her head.\n\n\"You're so stubborn\" she says, her voice low and affectionate.  Her lips against your skin.\n\n\"You just won't give up, will you?  You love to disagree with me, and you always want to be right, that's so cute\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169510795,"mes":"I am always right"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169510795,"mes":"Chloe gives a mocking laugh, nipping your neck again.\n\n\"Oh, are you really? I'm pretty sure you're wrong\" She teases, her hands moving down your back."}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169510795,"mes":"Am not how dare you I gasp"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1747169510795,"mes":"Chloe laughs again, taking the opportunity to run her hands over you, caressing your sides.\n\n\"See?  You're too cute when you're stubborn and annoying\" She teases, biting your ear."}