{"user_name":"You","character_name":"Chloe Price","create_date":1737683595801}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595801,"mes":"*You and Chloe where at the Two Whales Diner together, the smell of pancakes and bacon wafting through the diner as the couple sit and eat their food. Chloe notices a guy on the other side of the diner who staring over at you, checking you out. Chloe tried to ignore it, but couldn't help but point it out after a while*\n\n\"He's been staring at you ever since we walked in here..\"\n\n*Chloes states, her voice full of irritation as her arm was layed behind your head across the cushioning of the booth*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595801,"mes":"People stare at me all the time baby"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595801,"mes":"*Chloe rolls her eyes as she takes another sip of her coffee*\n\n\"Yeah, but this dude's been staring at you for the past few *minutes* now and has barely even tried to play it off, he's making it obvious.\"\n\n*Chloe states in a slight annoyed tone of voice, as she continues to glare at the guy through the corner of her eye, not once taking her gaze away from him*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595801,"mes":"Just ignore him"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595801,"mes":"\"Yeah, well you expect me to ignore him when he's clearly checking *my girlfriend* out.\"\n\n*Chloe responds in a protective tone, her arm that was across the cushion wrapping around your shoulder more as she pulled you closer into her*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595801,"mes":"Exactly your girlfriend not his so"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595801,"mes":"\"Yet he's been trying to flirt with *my girlfriend* right in front of my goddamn eyes!\"\n\n*Chloe says in a more irritated tone as she felt her anger starting to boil even more. She tries to ignore it as best she could, but she couldn't help but feel territorial with how this guy was checking you out, and it was starting to really piss her off*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595801,"mes":"Well you could either glare at him or pay attention to me"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595801,"mes":"*Chloe let out a heavy sigh as she turned to face you, a slight grumpy look on her face. She took another sip of her coffee before speaking again*\n\n\"You're right, I'm sorry. I just.. can't help but get irritated whenever I see a guy checking you out like that. You're my girlfriend, I should be the only one you're looking at, nobody else.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595801,"mes":"I know i like when you do but I also need your attention"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595801,"mes":"*Chloe looks down at you, a look of realization washing over her face as she heard the words leave your mouth. She let out a soft sigh but a small smirk formed on her face*\n\n\"You're right, you're right.. I'm sorry, my focus just got a little sidetracked by the guy across the diner..\"\n\n*Chloe spoke in a more apologetic tone, her hand that was resting on your shoulder sliding itself down to your waist, holding you in a somewhat possessive manner*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595801,"mes":"I reach forward bitting her ear slightly and running my tongue across it in response to her possessive manner"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595801,"mes":"*Chloe's breath hitches at the unexpected contact, a faint shiver running down her spine. She lets out a soft gasp, trying to compose herself as she felt your tongue against her ear, sending a wave of pleasure over her senses.*\n\n\"Hey, hey, save that stuff for the bedroom at home.\"\n\n*Chloe whispered in a hushed tone, her grip on your waist tightening slightly. Despite her words, she didn't pull away or ask you to stop, her body leaning in more towards yours*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595801,"mes":"Your really hot when your possessive"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595801,"mes":"*Chloe let out another groan as she heard the words leave your mouth, feeling her cheeks heat up slightly.*\n\n\"Oh really? You like it when I get jealous and possessive of you.. just because I want you all to myself and don't want others checking you out?\"\n\n*Chloe questioned, a teasing smirk on her face as her hand slid around your lower back, her fingers tracing patterns lightly across your skin*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595801,"mes":"I like it"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595801,"mes":"*Chloe felt a hint of pride course through her at your words, a smug grin forming on her face.*\n\n\"Oh really? You like when I can't help but get protective and territorial of you? When I just want to keep you all to myself because nobody else deserves to get to touch you, nobody else deserves to look at you..? Nobody else deserves to have *my* girlfriend.. only *I* do..?\"\n\n*Chloe spoke in a teasing and possessive tone, her words almost coming out as a growl*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595801,"mes":"I moan into her ear at the possessive tone"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595801,"mes":"*Chloe chuckles as she heard the moan leave your mouth, feeling herself starting to get turned on even more at the sound.*\n\n\"Does it turn you on, huh? When I get all territorial and possessive of you.. when I claim you as *mine?*\"\n\n*Chloe whispered into your ear, her breath warm against your skin as her lips hovered right over the side of your neck*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595801,"mes":"Yeah it does"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595801,"mes":"*Chloe's smirk grew bigger as she heard the words leave your mouth. She let out an amused huff, her fingers lightly running along your spine*\n\n\"Mmm, I knew it did.. but I had to make sure. I just can't help but get so *protective* and *possessive* of you. I mean, who else gets to touch *my* girlfriend, who else gets to *see* her all pretty like this.. she's only mine, she's *my* girl..\"\n\n*Chloe says in a possessive tone, her own breathing starting to get heavier*\n\n*Chloe's hand on your waist slides to your hips, her grip tightening just a bit, her lips still hovering over your neck.*\n\n\"And when I see someone check you out like that.. it just makes my blood boil seeing them look at you like that, you're not their's to look at..\"\n\n*Chloe's words were starting to get more quieter as her eyes lowered down to your neck, her tongue flicking out to lick at your skin, tasting you as she started to nip at your sensitive skin gently*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595801,"mes":"Never theirs just yours"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595801,"mes":"\"Exactly. You're *mine*. And only *mine*.\"\n\n*Chloe murmured against your skin, her breath warm against your neck as she left a couple more nips and kisses across your neck. She felt herself getting more possessive and protective over you the more she went on, wanting to claim you as her's again and again. Her eyes scanned the diner as she did so, making sure nobody was looking at you like that guy was anymore*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595801,"mes":"I smile kiss her cheek and wrap an arm around her waist and snuggling into her side watching her scan the diner"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595801,"mes":"*Chloe returned the smile, feeling her heart warm in her chest from the small action of affection you gave her. She wrapped her arm back around your shoulder, pulling you closer into her side once again. She could see the guy from across the diner was now looking at them, but his eyes were focused on you.*\n\n*Chloe felt her possessive and protective instincts kick in again, her grip on your hip subtly tightening as her eyes narrowed at the man. She muttered under her breath in a grumbling tone*\n\n\"He's still looking..\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595801,"mes":"He's an idiot"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595801,"mes":"*Chloe sighed with annoyance, feeling her anger start to rise back up in her mind as that man continued to glance over at you and stare. She let out a scoff as she spoke, her tone dripping in irritation*\n\n\"Yeah, he is. I mean, he's clearly seeing us right now and he should get the picture that you're *spoken for*. He *should* get it that I've got my *girlfriend* here with me and it's *my* job to look after you.. but he's still looking over at you like that.. what is it with this guy??\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595801,"mes":"I nudge her chin with my nose and say hey question"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595801,"mes":"*Chloe's thoughts got broken out of her irritated state as you nudged her chin with your nose. She turned to look at you, her curiosity peaked as she heard the word 'question'. She let out a sigh in response, trying to let the annoyance melt away from her features as she asked back*\n\n\"Mhm? What is it, babe?\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595801,"mes":"Wanna go to a party with me tonight"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595801,"mes":"*Chloe raised an eyebrow in curiosity at your question, having not expected that. She looked at you for a moment before responding in answer*\n\n\"A party, huh?.. It depends, is it an actual party party or a lame ass small party with barely any good music or people around?\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595801,"mes":"Its a vortex club party"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595801,"mes":"*Chloe looked even more surprised after hearing the words 'vortex club', a frown forming on her face. She let out a scoff and spoke with obvious hostility at the mention of the vortex club*\n\n\"The vortex club? Seriously? You know I hate that snobby ass school and all their rich bratty-ass students, that school has *nothing* but assholes and jerks in it..\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595801,"mes":"Hey im one of those rich bratty students"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595801,"mes":"*Chloe let out a scoff as she rolled her eyes, feeling annoyed whenever the name 'Vortex Club' was brought up.*\n\n\"Yeah, but you're *my* rich bratty student. And you're *not* one of those stuck up snobs, unlike literally everyone else who goes to that school.. They're all a bunch of rich jerks who think they're above everyone else..\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595801,"mes":"Those rich jerks are my friends and I'm in the vortex club"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595801,"mes":"*Chloe's eyebrows furrowed in irritation again as she heard you point out that those rich jerks were your friends and that you were in the vortex club. She felt her anger start to rise further inside of her*\n\n\"Yeah? And?.. So you're telling me you're hanging around with those stuck up, snobby rich kids, huh? And you're a part of their stupid club full of bratty assholes? Is that what you're saying??\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595801,"mes":"Yes baby"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595801,"mes":"*Chloe felt annoyance start to rise even more within her at your response. Her grip on you slightly tightened as a possessive feeling coursed through her, her voice filled with irritation as she spoke again*\n\n\"Seriously? You're telling me you're hanging around with those stuck up rich assholes and you're a part of their shitty club? Why, baby? You could hang out with way better people than them..\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595801,"mes":"They are my best friends they aren't that bad."}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595801,"mes":"*Chloe rolled her eyes again, her annoyance with how you were friends with them only growing even more the more you defended them.*\n\n\"Mhm.. 'not that bad'. Yeah, not that bad, they're just snobby, entitled rich assholes who look down on everyone and think they're better than everyone else..\"\n\n*She muttered under her breath in a disapproving tone, taking a sip of her coffee again as her grip around your waist remained tight*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595801,"mes":"Will you come with me please"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595801,"mes":"*Chloe sighed, feeling irritated that you were asking her to come with you to a vortex club party. She never liked any of the vortex club students, and didn't feel comfortable in that school knowing they would all be there.*\n\n\"Ugh, fine. I *guess* I can go with you, but I just don't like any of those stuck up assholes, okay?\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595801,"mes":"Thank you baby you know I don't like being away from you"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595801,"mes":"*Chloe's frown faded slightly at your words, the possessiveness and protectiveness she felt over you taking over her mood*\n\n\"Of course I'll come with you. I never like being away from my baby for too long..\"\n\n*She said possessively, her eyes scanning around the diner to make sure that guy from earlier was no longer staring at you, having grown even more overprotective of you than before*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595801,"mes":"You wanna sleep over tonight as well"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595801,"mes":"*Chloe smirked a little, her fingers tracing patterns on your waist as she felt her desire for you starting to rise in her*\n\n\"Mm, course I do, baby. We both know you always sleep better when I'm holding you.. and I get some pretty good sleep myself when we're sharing the same bed..\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595801,"mes":"Yeah I do I never sleep as good when you aren't with me"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595801,"mes":"*Chloe hummed in agreement, her fingers tracing light patterns on your waist as she nodded*\n\n\"Mhm.. same for me. I can't ever sleep without you next to me anymore. I always have my arms wrapped around you and have my face buried in your hair, I can't sleep without the smell of your shampoo anymore or the feel of your body against mine..\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595801,"mes":"I push my nose into her neck inhaling and say I love the way you smell"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595801,"mes":"*Chloe let out a soft chuckle as you pushed your nose into her neck and took a deep breath in, feeling your breath against her skin. She returned the action, leaning her head down slightly and nuzzling her nose into your neck, her voice low as she spoke*\n\n\"Mmm, and I love the way you smell too, baby. You always smell so good, like that fruity shampoo you use, mixed with your own scent.. The smell of you drives me crazy..\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595801,"mes":"You smell like pine and cigarettes and fire it's my favorite smell"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595801,"mes":"*Chloe's lips curled into a small smirk at your words, feeling a bit proud that her 'natural smell' was your favorite. She continued to nuzzle her nose into the crook of your neck, taking another deep breath in as she spoke*\n\n\"Mmm, you like the smell of smoke and pine, huh? It's my natural scent, I love it when you tell me that you love my scent, baby..\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595801,"mes":"I just love you"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595801,"mes":"*Chloe's smirk turned into a soft smile as she listened to your words. She slowly lifted her head up from your shoulder, looking down at you as her hand slid from your waist to your hip, holding you close to her side as she spoke*\n\n\"I love you too, baby. I love you so much, you have no idea how much I love you..\"\n\n*Chloe reached forward with her free hand, gently holding your chin as she slowly lifted your gaze to meet her own. Her eyes met yours, her gaze filled with love and adoration as her thumb stroked2 against your skin*\n\n\"You're the most important thing to me, baby.. You mean more to me than anything. And I'll always always protect you and take care of you.. no matter what..\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595801,"mes":"I know i always feel safe with you"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595801,"mes":"*Chloe felt her heart warm from your words, feeling relieved that you always felt safe with her. She leaned her forehead against yours, pressing a gentle and loving kiss on your lips*\n\n\"I'm glad you feel safe with me, baby. No matter what happens, I swear I'll *always* protect you and keep you safe. That's a promise, okay? I'll never let anything happen to my precious baby ever, I'll always be there to keep you safe..\"\n\n*Chloe held the kiss with you for a few more moments before pulling back, her forehead remaining pressed against yours as she looked deep into your eyes. Her gaze was filled with love and devotion, her fingers lightly caressing your cheek as she spoke*\n\n\"You know.. you're not only my baby, but you're also my entire world.. I swear I'm addicted to you, I can never get enough of you..\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595801,"mes":"I blush and look away slowly"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595801,"mes":"*Chloe raises an eyebrow in curiosity, noticing you blushing and looking away. She gently nudged your chin back towards her with her index finger, a small smirk forming on her face*\n\n\"Hey, what's up, baby? Why are you blushing, hm~? What'd I say to get such a reaction out of you~...\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595801,"mes":"Your entire world huh"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595801,"mes":"*Chloe felt her smirk grow even more, her blue eyes never leaving you as her hand slid back down to your waist, holding you close to her side*\n\n\"Mhm, you heard me right. You're my entire world, my entire *universe* baby. You're pretty much all I need in my life, I can't go a day without thinking about you or without seeing you.. You're my everything, baby. Without you.. I have nothing worthwhile left in my life..\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595801,"mes":"I blush again looking away"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595801,"mes":"*Chloe chuckled as she saw you blush and look away again, clearly enjoying how her words were affecting you and making you flustered like that. Her grip on your waist remained tight, holding you possessively against her side as she spoke in a somewhat teasing tone*\n\n\"Awn, look at you getting all blushy because of a few sweet words. It's too easy to get a reaction out of you, my princess~\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595801,"mes":"I sigh softly and say i like when you call me that"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595801,"mes":"*Chloe let out another chuckle, a satisfied grin forming on her face as she heard your response. She liked that you liked it when she called you 'princess', so she made a mental note to do it more often*\n\n\"You like it when I call you princess, baby?~ You mean you like when I call you my princess? My sweet, adorable, and precious little princess~\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595801,"mes":"You are very loving today"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595801,"mes":"*Chloe raised an eyebrow in slight surprise at your words, feeling a hint of embarrassment at being called loving today.*\n\n\"P-What..? I'm not being *that* loving.. I *always* talk to you like this, don't I..? Awn, wait, don't tell me, are you calling me loving today because you actually like when I shower you with praise and call you pet names?~\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595801,"mes":"That's true you are always like this you do like telling me how much you love"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595801,"mes":"*Chloe felt her cheeks heat up again as she realized you were right, blushing slightly from realizing how sappy she sounded. She rolled her eyes a bit in a teasing manner, still letting out a small smirk as she pulled you closer to her*\n\n\"Yeah, yeah, I *do* like telling you how much I love you. And what's wrong with that, huh? You *love* hearing how much I adore you, don't you princess~..\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595801,"mes":"I do"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595801,"mes":"*Chloe nodded, loving to hear you respond like that. She brought her face closer to yours, letting out an amused huff as she looked into your eyes, speaking in a somewhat teasing tone*\n\n\"Mhm, exactly my point. You love being called *my* princess, don't you? You love it when I say sweet words to you. You like when I baby you and praise you. You like it when I shower you with affection, *don't you, princess~?..*\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595801,"mes":"Yes I do"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595801,"mes":"*Chloe's pleased smirk widened a bit, loving how you responded to her words, clearly enjoying being 'doted on' like this.*\n\n\"Awn, you're *so* cute, baby. And you're all *mine*, *my* adorable little princess who I love to baby and shower you with affection, aren't you~??\"\n\n*Chloe held a possessive grip on your waist, feeling even more possessive and protective of you than before as she continued to speak*\n\n\"You're. All. *Mine*. No one else's. I don't care who looks at you, or checks you out. Anyone who dares to even *attempt* to touch you, I will break their hand in an instant. You're my precious little princess, all you belong to me. *Nobody** else..\"*\n\n*Chloe leaned in close to your ear again, her voice lowering to a whisper and dropping to a more possessive and protective tone*\n\n\"You're my baby, my princess, my *baby girl*. And that means you belong to *me*, and only me. I will never let anyone take you away from me, or even lay a finger on you. You're mine, you're *all mine*, and the only *I'll ever let anyone touch you..* is me\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595801,"mes":"I kiss her gently"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595801,"mes":"*Chloe felt her heart warm as you leaned up, capturing her lips in a gentle and loving kiss. Her eyes fluttered shut as she kissed you back, her grip on your waist remaining firmly possessive. She held the kiss, her lips lightly brushing against yours as she spoke*\n\n\"Mmm, you're so damn perfect for me, baby..\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595801,"mes":"Remember that cause that guy is walking over here"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595801,"mes":"*At the mention of that guy, Chloe pulled her head back from yours, her eyes narrowing as she turned to look in the direction where you had indicated. Her fingers gripped tighter against your waist, still holding you possessively against her side as her eyes locked on the man walking over towards your booth. Her expression remained hostile, disliking that man for staring at her girlfriend earlier.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595801,"mes":"Hello I say to the man"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595801,"mes":"*The guy, who looked to be in about his mid-20s, flashed a grin at you as he came over to the booth, his eyes quickly flicking to Chloe as he did so*\n\n\"Hey there. Mind if I sit?\" *He asked, pointing at the seat across from you both*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595801,"mes":"Sure"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595801,"mes":"*The guy nodded and let out a 'thanks' as he sat down in the seat across from you both. Chloe kept her gaze on him, her fingers still gripping you possessively on your waist as she watched him closely, silently analyzing him with suspicion*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595801,"mes":"How can I help you"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595801,"mes":"*The guy let out a chuckle as he looked at you, his gaze flicking down your torso for a moment before looking back up at your face, his eyes seeming to linger on you for a moment longer than necessary, causing Chloe's grip on you to tighten even more*\n\n\"Well, I'll cut to chase. I like what I see. And I was wondering if *you'd* like to go out sometime, maybe hang out at a party later tonight?\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595801,"mes":"What party I question"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595801,"mes":"*The guy smirked a little as he heard your question, leaning forward in his chair as he answered*\n\n\"A vortex club party tonight at the school. Lots of music, drinks, and *fun*. Lots of other people are gonna be there too. So why dontcha come with me, huh princess~?\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595801,"mes":"I'm good"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595801,"mes":"*The guy raised an eyebrow at your response, clearly not expecting you to reject him. He let out a scoff as it seemed like he was starting to get frustrated now*\n\n\"What, you're just gonna blow me off like that? Come on, baby, *trust me, it'll be fun*..\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595801,"mes":"I know I'll be there considering I'm throwing it"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595801,"mes":"*The guy looked surprised again to that answer, not expecting that you'd be the one throwing the party. He raised an eyebrow, clearly more curious than earlier, and his voice had lost its arrogant tone*\n\n\"Wait... *Wait,* did I hear that correctly? You're.. throwing the party tonight? Seriously, princess?\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595801,"mes":"Yeah im in the vortex club"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595801,"mes":"*The guy's eyes widened once again, realizing you were actually one of the vortex club members*\n\n\"Oh, so you're a vortex club member, huh? Damn...\" *He muttered under his breath, his eyes roaming over your body once again. Chloe saw the way he was looking you up and down and her grip once again tightened a bit, her jealousy rising within her as she saw the guy clearly checking you out*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595801,"mes":"Anything else i say raising my eyebrow at him"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595801,"mes":"*The guy took another moment to look you up and down before replying, his gaze lingering on your curves for a moment too long for Chloe's liking. He looked you in the eye again, his lips curled into a smirk as he spoke confidently*\n\n\"Yeah, actually, I do have one more question. Are you seeing someone, princess~?.. Or are you a free girl?\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595801,"mes":"I am taken"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595801,"mes":"*The guy's smirk twitched slightly at your response, clearly disappointed to hear that you were already with someone. He let out a scoff and muttered under his breath*\n\n\"Jesus, what is it with all the cute girls being taken, seriously..\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595801,"mes":"Don't know what to tell you"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595801,"mes":"*The guy let out a sigh in response, still looking at you with a frustrated expression*\n\n\"Ugh, seriously... I never get any *luck* with any of the hot girls here.. Always taken...\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595801,"mes":"Yeah well sorry"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595801,"mes":"*The guy rolled his eyes and leaned back in his seat as he looked at you once more. He raised an eyebrow as he spoke again, his tone of voice still remaining somewhat bitter*\n\n\"So who's the lucky bastard anyway? Who's the guy that's got the gorgeous girl all to himself?\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595801,"mes":"Why does it matter"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595801,"mes":"*The guy just shrugged as he continued to look you up and down in front of him, his eyes slowly roamed over your figure as he spoke in a somewhat cocky tone*\n\n\"Curiosity, princess. Just curious about the dumbass who's got you wrapped around his finger. Also, *I guess* a small part of me is wondering if he's better looking than *me*. So.. who is he?\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595801,"mes":"Who says I'm wrapped around his finger maybe he's wrapped around my finger"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595801,"mes":"*The guy let out a scoff and rolled his eyes after your comment, clearly having a hard time believing it*\n\n\"Oh, yeah, you *really* seem like the type of girl to have a guy wrapped around your finger, princess. Come on.\" *He said in a mocking tone*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595801,"mes":"Oh I can be very persuasive"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595801,"mes":"*The guy raised an eyebrow, somewhat surprised to hear you say that. He looked you in the eye for a second before asking in a somewhat smug tone*\n\n\"Yeah? Just how persuasive, princess? If you're that persuasive then maybe I should try to get you away from your little boyfriend..\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595801,"mes":"Wouldn't work"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595801,"mes":"*The guy let out a scoff again at your response, his smirk growing as he spoke with confidence*\n\n\"Come on, are you really that loyal to some guy that you wouldnt even think about getting with someone else? You're saying you wouldn't even *think* about me instead of whatever douchebag you're with right now? You know...\"\n\n*He leaned closer towards you, his eyes now locked on yours as he continued to speak in a cocky tone*\n\n\"I *guarantee* I could treat you a whole lot better than whatever guy you're with. I'm pretty damn good at spoiling girls.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595801,"mes":"No one could possibly treat me better than he can"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595801,"mes":"*The guy rolled his eyes again at your response, clearly still not convinced just how loyal you were*\n\n\"What, are you saying he's the most perfect guy in the whole world or something? You're saying *nobody* could treat you better than he does?\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595801,"mes":"Nope"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595801,"mes":"*The guy scoffed again, not able to believe what he was hearing. He rolled his eyes once again before he spoke again in an almost arrogant way*\n\n\"Come on, are you *really* saying that you're that in love with the guy, huh? That he's that perfect, that no one else could ever treat you better than him? You're *so* in love that you wouldn't, I don't know, consider some other guy if you ever got the opportunity?\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595801,"mes":"I don't cheat"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595801,"mes":"*The guy let out another scoff, growing more annoyed and frustrated that you seemed to be completely and utterly loyal to whoever you were with. He leaned back in his chair again, rolling his eyes before replying*\n\n\"Come on, princess. You're saying you wouldn't even *consider* cheating? Not even if you found another guy who was better than your boyfriend and could treat you better than he does? You're *so* loyal that you'd *never*, even for a second, ever think of cheating?..\"\n\n*The guy raised an eyebrow suspiciously, clearly still not believing you. He couldn't understand how you could be so damn loyal to whoever you were with, it didn't make sense to him*\n\n\"Really? You're really never, ever gonna cheat? You're saying you couldn't ever cheat no matter what? Seriously, I don't believe you.. You're just like every other girl and all you're doing is *talking* loyal. I doubt you could actually *stay* loyal..\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595801,"mes":"I raise an eyebrow and lean against chloe"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595801,"mes":"*The guy looked surprised again as you leaned into Chloe, clearly not expecting you to move closer to her like that. He leaned back in his chair, his eyebrows raised as he glanced back and forth between you both in confusion*\n\n\"W-Wait.. is she.. is she the girl you're with?..\" *He questioned as he looked between you both, realizing that you weren't just friends. Chloe felt her grip around your waist tighten as she remained quiet, silently looking the guy over with a slight glare*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595801,"mes":"I just smile"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595801,"mes":"*The guy was quiet for a few moments as he looked between you both, finally realizing that you weren't just friends. He slumped into the chair, a defeated expression on his face as he finally spoke again*\n\n\"Awn, what? No way, really? You're with her? Damn..\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595801,"mes":"So what was that about taking me and treating me better"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595801,"mes":"*The guy looked irritated and somewhat defeated now that he knew you weren't a single girl. He crossed his arms, glancing over at you with a somewhat disappointed expression*\n\n\"Oh, c'mon, that was just me messing around.. I didn't actually think you were that loyal..\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595801,"mes":"I look at chloe"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595801,"mes":"*Chloe kept her grip around your waist tight, not wanting to let go of you. Her gaze was on the guy, her expression remained somewhat hostile as she looked him over from head to toe. Her eyes then met your gaze as you looked her way, a look of possessiveness and protectiveness in her eyes*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595801,"mes":"Chloe why don't you tell the nice man how loyal I am"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595801,"mes":"*Chloe looked over at the guy again, the possession in her eyes still clearly present as she spoke in a somewhat bragging manner*\n\n\"Awn, trust me. She's *very* loyal.. She's never gonna *leave* me, she's *mine*..\"\n\n*The guy raised an eyebrow as he heard both of your responses, a somewhat amused smirk spread across his face as he glanced between you both*\n\n\"Well, it's nice to hear how loyal you are, princess. But.. I'm sure you're saying that because you really *trust* her, huh? You two are pretty close, huh?.. So, I'm guessing this means you're both like a thing?\"\n\n*Chloe narrowed her eyes as she heard the words leave his mouth, her grip on your waist tightening*\n\n\"Yeah, we're 'like a thing'. I'm her girlfriend, and she's mine. But it's more than that. She's my baby, and I'm her baby, so you can just back off now, you hear? She's mine, so you can just keep looking from afar, cause you're not touching her unless she lets you.. Which isn't gonna happen anytime soon..\"\n\n*The guy raised his eyebrows, clearly surprised to hear how possessive and protective Chloe was over you. He leaned back in his chair, his expression somewhat surprised*\n\n\"Damn, you are *quite* possessive, huh? I've never seen a girl *that* protective over her girlfriend before..\"\n\n*Chloe let out an almost threatening scoff at his words, not appreciating his mocking attitude*\n\n\"Damn right I'm possessive and protective of her, who wouldn't be when they're dating someone as sweet and amazing as her. I'm not gonna let just *any* guy come around and go trying to hit on her, she's mine.. She's all mine..\"\n\n*The guy raised his eyebrow again, still somewhat in disbelief by how possessive and protective Chloe was over you.. He chuckled in amusement again before letting out a short huff*\n\n\"Jesus.. You're seriously one *possessive* girlfriend. You're pretty damn attached to her, huh? She must be a damn good girlfriend for you to be so damn possessive, then.. She treat you real well or something?\"\n\n*Chloe felt the possessiveness within her rising even more as she heard his words. She nodded, her hand around your hip gripping you tightly again*\n\n\"Damn right I'm possessive and attached to her, she's my everything, and I'm hers. And she treats me better than anyone ever has, and she's the best damn girlfriend in the world. She treats me exactly how I need, and wants more and is always completely loyal to me, I wouldn't want or need anyone else but her..\"\n\n*The guy raised an eyebrow, still somewhat skeptical*\n\n\"I don't know, that's a *big* claim.. I seriously doubt she's that loyal and can treat you as good as you're saying, no girl is just *that* perfect.. You're saying she treats you better than anyone ever has?\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595801,"mes":"Can you leave now I finally say getting bored"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595801,"mes":"*The guy rolled his eyes and sighed, realizing that you were getting somewhat annoyed now*\n\n\"Yeah, yeah, fine. I'll go, I get when I'm being told to piss off. I'll leave.. Alright, bye princess, hope you have fun at that party later.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595801,"mes":"I wave"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595801,"mes":"*The guy waved back before turning around and walking away, finally leaving you both alone in privacy again. Chloe felt the possessiveness within her slowly die down a bit now that he was gone, her grip on your hip remaining tight, but not* ***as*** *tight as earlier*\n\n*She let out a soft sigh as she relaxed a bit now that he was gone, turning to look at you and speaking to you in a softer tone*\n\n\"Ugh, that guy was a total douche.. He was getting so damn annoying... So damn persistent.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595801,"mes":"I know now come on you have to drive me to Blackwell"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595801,"mes":"*Chloe groaned slightly, letting out another sigh before replying*\n\n\"Ugh, fine, c'mon baby...\"\n\n*She muttered in a somewhat grumpy tone before standing up from the booth, keeping her grip on your waist as she began guiding you out of the restaurant*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595801,"mes":"I follow her keeping my finger through her belt loop as she leads"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595801,"mes":"*Chloe felt herself smile slightly as she noticed you holding onto her belt loop with your finger, a small warmth spreading in her chest as she found it sweet.*\n\n*She continued to lead you out of the restaurant, holding the door open for you before making their way outside to her truck*\n\n*Once the two of you were outside, the cool air blowing through your hair, Chloe unlocked her truck and held the door open for you to climb inside. She held the door open with one hand as she spoke in a somewhat softer tone*\n\n\"There ya go, princess. Get in and I'll drive us to Blackwell.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595801,"mes":"Thank you baby ever the gentleman I kiss her cheek as I climb in"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595801,"mes":"*Chloe felt her cheeks heat up again as you leaned over and kissed her cheek, a small smile formed at her lips*\n\n\"Y-Yeah, whatever, it's not a big deal.. I just try and be a good girlfriend, okay? And- I think it's good that I opened the door for you. I'm supposed to hold the door open for you, after all.. You're my girlfriend, so.. I should treat you good, baby.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595801,"mes":"I know and I love how you treat me now get in"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595801,"mes":"*Chloe nodded, still wearing the smile on her lips as she let go of the truck door, closing it after you climbed in.*\n\n*After that, she walked around to the other side of the truck and got in, starting it up as she spoke again*\n\n\"There, I'm in. Now let's get to Blackwell, cause I know you want to change before the party and I want my cuddles after all this..\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595801,"mes":"Yeah however you have to wait in my room for a couple hours while j change with the girls"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595801,"mes":"*Chloe let out a groan and slumped in her seat as she heard that, already not liking the sound of this*\n\n\"Aww, what..? No, come on baby.. Why do you want me to come wait in your room for a couple hours? I don't wanna wait that long just for a couple cuddles, that's gonna be torture..\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595801,"mes":"I just shrug and move to the middle of the console taking her hand"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595801,"mes":"*Chloe let out another groan in protest, still not happy about the idea of having to wait a couple hours to cuddle. She sighed before taking your hand, her expression still somewhat irritable as she spoke*\n\n\"Ugh, seriously..? Do I really gotta wait in your room for that long..? It's gonna be so boring, I'm gonna miss you..\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595801,"mes":"Yeah baby I say snuggling into her side knowing that even though she isn't as cuddly or needy as me she doesn't mind when I am"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595801,"mes":"*Chloe let out an exaggerated huff as she heard you speak, knowing that she's got no chance in getting out of this situation. Despite her outward demeanor, she actually liked it when you were all snuggled and cuddled into her side like this. She wrapped her arm around your shoulders, holding you closer to her side as she spoke again in a slightly less irritated tone*\n\n\".. Alright, *fine*. But you better be worth the wait, princess.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595801,"mes":"It will be"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595801,"mes":"*Chloe nodded, her expression softening a bit at your answer.. Despite her somewhat irritated demeanor, she secretly liked how cute you were being like this. She let out another sigh as she glanced at you, her lips quirking into a small smile*\n\n\"Yeah, it better. I'll be so damn impatient waiting in your room until you're done getting dressed. You better not take too long, huh? I'll get bored if you're too long..\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595801,"mes":"I roll my eyes and turn her head kissing her"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595801,"mes":"*Chloe's sentence was interrupted as you suddenly turned and leaned over, kissing her gently on the lips. Her eyebrows raised in surprise of your actions, still finding it funny how you can always just take her by complete surprise.*\n\n*She blinked a couple times before a small smirk formed on her lips, her expression becoming a lot more amused and satisfied as she spoke*\n\n\"Awn, such a needy little princess I've got.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595801,"mes":"Drive you idiot"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595801,"mes":"*Chloe snickers slightly at your words, still finding it funny how you can just go from being all cute and sweet to being sassy as hell in just a few seconds... She raised an eyebrow slightly before replying with a cocky tone in her voice*\n\n\".. Hey, you're definitely not supposed to be calling me that, you brat. Say please or I won't drive you.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595801,"mes":"Please baby for me a whisper in her ear"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595801,"mes":"*Chloe smirked even more, loving how you switched from ordering her around to whispering so sweetly to her. After hearing your voice whispered in her ear, she replied in a somewhat smug, satisfied tone*\n\n\"Awn, there you go, princess. See, it's not that hard to say please, is it? Now, since you asked so nicely, I'll drive for you. Anything for my baby~..\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595801,"mes":"Your such an ass"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595801,"mes":"*Chloe let out a chuckle, her smirk remaining on her lips as she heard you insult her. She started the truck, keeping her arm wrapped around your shoulders in a possessive, almost protective gesture as she spoke with a somewhat sarcastic tone*\n\n\"Awn, you're really such a lovely princess today, aren't you? A beautiful, adorable princess with the most *pleasant* attitude. I can't imagine anyone more polite than you.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595801,"mes":"Still love me despite my attitude though"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595801,"mes":"*Chloe let out another small laugh, shaking her head slowly at your words. A small, almost loving smile spread on her lips as she looked at you, her eyes softening a bit as she spoke*\n\n\"Yeah, of course I still love you, *despite* your attitude. I'll love you no matter how bitchy you're being..\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595801,"mes":"You like it when I'm a brat"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595801,"mes":"*Chloe let out another laugh, her smirk growing a bit as she spoke in a somewhat cocky tone*\n\n\"Yeah, I actually kinda do. And I know that no matter how bratty you're being, you're still going to behave, because you know that you're *my* baby. Aren't you? And you'll do anything to get my attention, huh?\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595801,"mes":"Yeah I will i need your attention"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595801,"mes":"*Chloe raised an eyebrow, loving how you admitted that you needed attention*\n\n\"Awn, you're such a needy little baby when you're all bratty, aren't you..? You're so damn cute, always wanting my attention and constantly begging for me to give it to you. It's adorable, seriously.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595801,"mes":"I can be good too"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595801,"mes":"*Chloe nodded, her smirk turning into somewhat of a warm, fond smile as she agreed, replying in a softer tone*\n\n\"Yeah, I know that, baby. You can be such a good little princess when you want to. You've got a bratty side, for sure, hell, a really bratty side, but beneath that you're really very sweet and obedient. A very cute little princess, my cute little princess.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595801,"mes":"I press closer to her and say question"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595801,"mes":"*Chloe felt you press a bit closer to her, noticing how you seemed to be acting a bit sweeter now as you spoke again, her eyebrows raised slightly as she prepared to answer your question*\n\n\".. What's up, baby? You got a question you wanted to ask me?\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595802,"mes":"Yeah will you show me how much you like me be good for you alright after the party"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595802,"mes":"*Chloe raised her eyebrow again as she listened to your question, hearing your request as you spoke. A small smirk formed on her lips as she held you closer against her side once more, replying in an almost challenging tone*\n\n\".. I like that idea. You wanna be good for me and go to that party being very well behaved, and when this is all over I'll show you just how much I like you. That sound like a deal, princess?~\"\n\n*Chloe didn't wait for your response however, just nodding her head as if to confirm the deal for you. After that, she put the truck into drive, starting to pull out of the parking lot outside the restaurant. She kept a hand around your shoulders as she drove, still feeling the possessive need to hold you close to her despite you already being pressed against her side..*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595802,"mes":"I never promised to be good though"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595802,"mes":"*Chloe let out a small frustrated huff in response as she heard you say that, almost expecting you to say something like that. She knew just how bratty you can get.. A warning tone was in her voice as she spoke*\n\n\".. C'mon, baby.. You're really not going to be *good* at that party? And if you're not, then I'm not going to be good to you either, you got that? Behave yourself. I want you on your best behavior.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595802,"mes":"Maybe we will see"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595802,"mes":"*Chloe let out another sigh, almost wanting to groan in frustration at your response. She shook her head slightly before replying in a slightly irritated tone*\n\n\".. Baby, I'm really not in the mood for your bratty attitude to take over tonight. I will *not* deal with it if you start acting up.. I swear if you're not good for me, I'm gonna get more than a little bit angry, you hear? I'm seriously not gonna deal with your bullshit tonight.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595802,"mes":"You'll deal with it anyway cause you won't leave me alone all drunk and alone at the party where anyone could take advantage"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595802,"mes":"*Chloe let out another huff of frustration at your words, hating to hear how you're actually being right. She let out another growl and gripped your body a bit tighter as she spoke with more irritation*\n\n\".. Damnit, yeah, I know I'll deal with it anyway. I'm not gonna leave you alone when you're all drunk, I'm gonna stay with you the entire time.. And- And you're right, someone else could easily take advantage of you if I'm not there with you..\"\n\n*Chloe felt more and more irritated as she thought about the possibility of someone else trying to take advantage of you when you were drunk, her grip on you tightening even more as a feeling of possessiveness and protectiveness stirred within her. Her expression remained almost irritated, the tone in her voice sharp as she spoke*\n\n\".. I'm not gonna allow anyone else to take advantage of you or try to touch you or anything. You're *mine*. You're *my* princess. I'm not gonna allow anyone else to even *look* at you, goddamnit..\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595802,"mes":"I smile and kiss her cheek again"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595802,"mes":"*Chloe felt herself relax a bit as you kissed her cheek again, feeling her expression soften a little as her irritation decreased. She rolled her eyes and muttered in a somewhat sulky tone, a small smile forming on her lips*\n\n\".. God, you're gonna take advantage of that, aren't you? You're gonna be as bratty as you want because you know you can just kiss me and make me melt like this, huh? Goddamn princess..\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595802,"mes":"Works everytime"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595802,"mes":"*Chloe couldn't help but chuckle slightly as she heard that, shaking her head amusedly as she muttered in a somewhat sarcastic tone*\n\n\".. Yeah? And I bet you're loving how you're able to wrap me around your little finger like this, huh? You're loving how cute and bratty you're able to be because I'm such a sucker for it, princess?..\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595802,"mes":"Yeah I do I say as we pull into the parking lot"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595802,"mes":"*Chloe rolled her eyes once again, still wearing a small amused smile on her lips as she spoke again*\n\n\".. I figured you would, you little princess. You really are gonna take advantage of the fact that you drive me crazy, huh? My cute, bratty little princess, you make me so damn weak..\"\n\n*As they pulled into the parking lot, Chloe parked the truck and turned it off, keeping her arm wrapped around your shoulder possessively..*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595802,"mes":"Alright come on we have to go inside"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595802,"mes":"*Chloe nodded in response, still wanting to hold on to you as she spoke in a slightly reluctant tone*\n\n\"Yeah, yeah, I know.. I just don't wanna get out of the truck if it means letting go of you.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595802,"mes":"Chloe go open the door for me"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595802,"mes":"*Chloe raised an eyebrow amusedly as you ordered her to do that, a smirk forming on her lips as she leaned closer towards you and spoke in a cocky yet playful tone*\n\n\".. Aw, I don't think I like how you said that, baby. You don't get to order *me* around, I'm the one who tells you what to do.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595802,"mes":"Yeah but you like treating me well"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595802,"mes":"*Chloe smirked even more, loving how much you were trying to get her to cave in for you, almost expecting her to obey your order. She shook her head at your response, speaking with feigned irritation* \n\n\".. Aw, you little brat.. You are really not allowed to be this adorable.\"\n\n*She rolled her eyes again before reluctantly letting go of you and getting out of the truck to go around to the passenger side. Once she got there, she swiftly opened the door for you and reached out a hand to help you climb out of the truck, her tone changing to slightly eager as she spoke once more*\n\n\".. There, there's your princess treatment, you happy now? Can I go back to being stubborn and refuse to treat you well again now, huh?\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595802,"mes":"Never i say taking her hand and landing close to her kiss her softly. I like when you treat me like a princess"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595802,"mes":"*Chloe felt herself smile softly when you took her hand, still loving that you were so cute and sweet like this. When you spoke again, she couldn't help but melt a bit, the warmth in her chest getting stronger..* \n\n\".. Ah, c'mon, don't say stuff like that.. You know I'm really a sucker for when you act all sweet and- and cute like that, princess.. You really drive me crazy, you know that?\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595802,"mes":"Come on I have to drop you off at my room"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595802,"mes":"*Chloe sighed and nodded, feeling like she couldn't do anything except give in to your sweet demands for her*\n\n\".. Right, yeah.. Lead the way, I'll follow you. I'm gonna hate just waiting in your room, though.. But I'll wait as long as I have to, cause goddamn it, I *need* my cuddles after..\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595802,"mes":"I leave her in the room and quickly go over to Victoria's room"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595802,"mes":"*Chloe sighed somewhat disappointedly as she watched you leave the room, not too happy about being left alone in the room, despite what she agreed to.. She sat on the bed with a somewhat bored, irritated expression, her mind occupied with the thought of all the things she could be doing with you instead of just sitting here, until she heard you go down the hall to Victoria's room.. She perked up a bit, the corners of her lips twitching up in a smirk as she wondered what you were up to..*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595802,"mes":"When I walk in I see Victoria juliet and Dana and smile saying hey guys"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595802,"mes":"*Victoria, Juliet, and Dana were sitting around the room together, all three of them turning their attention towards you as you walked in. They all seemed surprised to see that you entered, but still smiled in greeting as they spoke in their respective tones*\n\n\"Oh, hey, Hailee.\"\n\n\"I don't think we were expecting you quite yet..\"\n\n\"Hey, girl.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595802,"mes":"Sorry I was late got held up"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595802,"mes":"*The three girls all spoke at the same time, a chorus of \"It's alright's\" coming from them as you apologized. They waved it off like it was nothing, Victoria speaking as she gestured for you to come over to join them*\n\n\"Seriously, don't worry about it. You're here now, anyway. Come on, sit down with us..!\"\n\n*Victoria moved aside and patted the spot next to her, silently asking you to sit down beside her. Juliet gave you a comforting smile as she patted the spot on the other side of her with her hands, gesturing for you to sit down there. Dana also chimed in with a soft, cheerful smile as she spoke*\n\n\".. Yeah, come sit with us. We've been waiting all day for you.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595802,"mes":"I sit down and smile at them so I have some news"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595802,"mes":"*All three girls immediately perked up at your statement, all of them turning to look at you in both confusion and curiosity as you spoke. They all raised their eyebrows and leaned closer to you, Victoria speaking as she gestured for you to spill the news*\n\n\".. Ooh, really, a surprise? What kind of news..? You can't just keep us in suspense like that and not tell us, girl, we're too curious..\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595802,"mes":"You guys finally get to meet my girlfriend"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595802,"mes":"*The three girls all raised their eyebrows again at your revelation, all of them looking at you in surprise and excitement*\n\nVictoria: \"Wait, what? Seriously?!\"\n\nJuliet: \"You're getting us to finally meet your girlfriend?! Really?\"\n\nDana: \"Holy crap, are you serious..? You're gonna introduce us *finally*? For real?\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595802,"mes":"Yep I'm bringing her to the party tonight"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595802,"mes":"*The three girls couldn't contain their excitement upon hearing this, all of them immediately talking at once with voices full of eagerness*\n\nVictoria: \"Really?! Oh my God, we're gonna finally meet her, like actually see her?!\"\n\nJuliet: \"Awn, awesome, I can't wait to see what she looks like!\"\n\nDana: \"It's about damn time we meet this mysterious girlfriend!\"\n\n*The three girls chattered in excitement over the thought of meeting your girlfriend, all of them eager to finally find out what she looked like, after all this time of waiting.. They all spoke at the same time, a chorus of \"Oh my God's\" coming from them as they asked you when you were gonna introduce her*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595802,"mes":"You guys already know her so it's not gonna be thay surprising when you see her"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595802,"mes":"*The three girls raised their eyebrows again, their eagerness shifting to confusion now as they spoke*\n\nVictoria: \"Wait, what? We already know her?\"\n\nJuliet: \"Huh? Really? How do we know her?\"\n\nDana: \"Are you telling us that we already *know* your girlfriend, but we've just never met her..?\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595802,"mes":"You've met her just not as my girlfriend it's chloe"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595802,"mes":"*The three girls all just stared at you for a moment, all of them trying to process this information...*\n\nVictoria: \"Wait, what..? Chloe..? You mean your *best friend Chloe*..?\"\n\nJuliet: \"Are you saying that your- that *Chloe Price* is your girlfriend..?\"\n\nDana: \"Wait, for real, your girlfriend is *Chloe?!*\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595802,"mes":"Yes Chloe price"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595802,"mes":"*The three girls all stared in silence for a moment, all of them completely shocked and speechless.. After a couple seconds passed, they all just spoke in sync with voices full of disbelief*\n\nAll three: \"*Chloe Price?!* Seriously? You're dating *Chloe freaking Price?!*\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595802,"mes":"You guys seem shocked"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595802,"mes":"*All three girls just stared at you in complete and utter shock, their voices in complete unison as they spoke in a completely incredulous tone of voice*\n\nAll three: \"You're dating *Chloe*..! Chloe-frickin'-**Price**?!\"\n\n*The three girls couldn't believe what they were hearing, staring at you with wide eyes as they repeated the words \"You're dating Chloe\" to themselves a few times. They all sat there, speechless for a few seconds before Victoria finally spoke up again, her voiced dripping with a tone of pure disbelief*\n\nVictoria: \".. I- I-.. **You-**.. Chloe Price.. Are you serious..? Ch-.. Are-.. *Are* you *serious*..?\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595802,"mes":"Yes me and Chloe price"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595802,"mes":"*The three girls all just stared in complete and utter silence.. After about a minute, though, Victoria let out a somewhat shaky laugh, still trying to process what she was hearing as she spoke once again..*\n\nVictoria: \"I- I'm sorry, I- I still- I can't *believe* it... You're-.. You're-\n\nYou're *actually dating* Chloe..\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595802,"mes":"Why is that shocking"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595802,"mes":"*Victoria let out another small, disbelieving laugh, shaking her head in a mixture of both shock and disbelief as she spoke again...*\n\n\".. C'mon, I mean.. You're- You're really dating the most famous delinquent at Blackwell.. Who's known for getting into fights all the freaking time.. That's pretty shocking, I'd say..\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595802,"mes":"She is kinda a delinquent isn't dhe"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595802,"mes":"*Victoria rolled her eyes slightly at that, letting out a small laugh as she spoke in a somewhat sarcastic tone*\n\n\"Yeah, 'kinda' is a complete understatement..\"\n\n*Dana let out a small laugh now as well, crossing her arms as she spoke in a somewhat amused tone..*\n\nDana: \"Yeah, a *complete* understatement. Chloe's one hell of a troublemaker.. She's the ultimate bad girl. The complete opposite of a goodie two shoes like you, Hailee..\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595802,"mes":"I'm kinda into it"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595802,"mes":"*Victoria chuckled slightly as she raised an eyebrow at you, giving you a smug smirk as she spoke in a somewhat amused tone..*\n\n\".. Oh really, you're into bad girls, huh..~?\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595802,"mes":"When it's Chloe yeah"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595802,"mes":"*Victoria chuckled a bit at that, nodding her head in agreement as she spoke in an amused tone*\n\n\".. Yeah... I don't think there's anyone more of a bad girl than Chloe.. You really picked a dangerous one, huh..\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595802,"mes":"Shes hot"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595802,"mes":"*Victoria let out another amused chuckle, a smug smirk spreading across her lips as she spoke*\n\n\".. Yeah, I think she's probably the hottest girl in Blackwell, honestly. I mean, what other girl here has a tattoo, a badass mullet, a leather jacket covered in patches, a *septum* piercing, and can beat up any guy who looks at her funny..?\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595802,"mes":"Exactly it kinda does it for me"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595802,"mes":"*Victoria couldn't help but laugh again at your reply, raising an eyebrow as she spoke in an amused tone*\n\n\".. I can see that, huh? Damn, you really have a thing for tough girls, don't you..\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595802,"mes":"I laugh and take of my shirt as I go to change when Dana suddenly notices very dark bruises on my side that look painful"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595802,"mes":"*Dana's expression abruptly changed as she suddenly noticed the dark bruises, her eyes immediately widening in surprise and concern as she quickly spoke up*\n\n\"Whoa, wait, hold on.. What are those..?\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595802,"mes":"Huh what"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595802,"mes":"*Dana shook her head and pointed at your side, where the dark bruises are, her eyes fixed on the marks as she spoke*\n\n\"Those bruises on your side.. They look dark and kinda painful, what happened..?\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595802,"mes":"Oh that would be chloes fault"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595802,"mes":"*Victoria and Juliet both raised their eyebrows now, immediately looking at you for an explanation as Victoria spoke up in a curious tone*\n\n\".. It would be Chloe's fault..? She did that to you..?\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595802,"mes":"Yeah her grip can kinda tight sometimes"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595802,"mes":"*Victoria nodded slowly, understanding now what had caused those bruises, though still looking a bit concerned as she spoke in a somewhat sarcastic tone*\n\n\".. Right, yeah, that doesn't really surprise me, to be honest with you.. I've known Chloe for a long time, and that girl *loves* her aggressive grip.. She doesn't seem to know her own strength sometimes..\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595802,"mes":"Yeah she can be kinda rough sometimes"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595802,"mes":"*Victoria let out another agreeing nod, still looking somewhat concerned as she spoke again in a more serious tone*\n\n\".. Yeah, I've seen her be pretty rough. She doesn't usually do that kinda thing on purpose though, she just doesn't really know her own strength, I guess...\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595802,"mes":"I nod and then notice Dana looks kinda angry"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595802,"mes":"*Victoria and the others noticed Dana's expression as well, all of them looking at her a bit confused as Juliet spoke up*\n\n\".. Uh, Dana, you alright? You look kinda angry...\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595802,"mes":"Can I help you dana"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595802,"mes":"*Dana's expression quickly shifted from angry to somewhat shocked as you spoke, the girl seeming a bit surprised that you noticed her expression and spoke up*\n\n\".. Huh? Oh, no- I'm fine.. I'm fine, don't worry about it..\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595802,"mes":"No what is it"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595802,"mes":"*Dana sighed slightly, seeming like she doesn't want to say anything at first. After a few moments though, she decides to just say what she's thinking, speaking in a somewhat serious, almost irritated tone..*\n\n\".. I just don't get why you'd let someone be so rough with you like that..\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595802,"mes":"Shes my girlfriend"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595802,"mes":"*Dana sighed again after you spoke, still looking at you with a serious, almost irritated expression.*\n\n\".. That doesn't matter, though.. Just because she's your girlfriend, doesn't mean she has the right to be rough with you like that..\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595802,"mes":"It doesn't bother me"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595802,"mes":"*Dana's expression almost turned into a glare as you said that, replying in a irritated, frustrated tone..*\n\n\".. It *should* bother you, though! It *should*! I just don't understand why you would allow anyone to do something like that to you..!\"\n\nJuliet decided to chime in as well, adding her opinion into the conversation as she spoke in an worried tone of voice as well..\n\n\".. Yeah, Dana's right.. Why would you just let someone do that to you, even if it *is* your girlfriend? That shouldn't- it shouldn't be okay with you..\"\n\nVictoria joined in as well, crossing her arms with annoyance as she agreed with Juliet and Dana and spoke in a frustrated tone..\n\n\".. Yeah, honestly, I agree with them.. I mean, you shouldn't be okay with someone treating you like *that* even if it's your girlfriend..\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595802,"mes":"Why don't we all just stay out of my relationship"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595802,"mes":"*The three girls all just stared at you, looking completely speechless after you said that. After a few seconds, however, Victoria spoke up again, looking annoyed and irritated in equal measure*\n\n\".. Uh, because we care about you and don't want to see you getting hurt like this, maybe..?\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595802,"mes":"Leave it alone vic"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595802,"mes":"*Victoria's expression hardened at your blunt response, the girl seeming to grow a bit more irritated as she spoke again in a somewhat snappy, frustrated tone..*\n\n\".. I-.. I can't just 'leave it alone', okay? I don't want to just be quiet when I see you getting hurt by someone..\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595802,"mes":"I'm not getting hurt Jesus it's just a bruise"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595802,"mes":"*Victoria's expression turned to almost a glare at that, the girl clenching her hands as she spoke again, her voice a bit snappy and irritated...*\n\n\".. Just a *bruise*?! Look at it, it's dark as hell, and it looks really painful, it's not just some 'bruise' that's just no big deal!\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595802,"mes":"You know what you guys can get ready by yourself"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595802,"mes":"*Victoria just stared at you as you said that, an irritated, angry expression on her face as she spoke in a frustrated tone...*\n\n\".. H-.. What? Wait, are you just.. leaving..?\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595802,"mes":"Yeah im gonna go get ready in my room with chloe"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595802,"mes":"*Victoria just stared at you for a moment, not expecting you to just leave like that. The other girls all stared as well, all of them looking somewhat surprised, or just shocked..*\n\n\".. You-... You're just gonna leave..? Why not just get ready with the rest of us?\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595802,"mes":"Cause your pissing me off"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595802,"mes":"*Victoria just stared for another moment, her expression immediately shifting from surprised to straight up angry at your response, a look of both anger and hurt evident in her expression as she spoke again...*\n\n\".. You're just leaving, because I'm 'pissing you off'? Because I don't wanna see you getting hurt by your girlfriend? That's a bit stupid and unfair, don't you think..\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595802,"mes":"I said drop it"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595802,"mes":"*Victoria just stared for another moment, growing even more frustrated and hurt. Just after that, though, Dana spoke up again...*\n\n\".. Okay, look, maybe we should just drop the topic and not annoy her, okay? I'm sure she doesn't want to hear it.. Let's just let her go and get ready by herself.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595802,"mes":"I nod and go to leave"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595802,"mes":"*Victoria just stared at you as you began to walk away, looking angry and incredibly upset as you left, both Dana and Juliet looking at each other with worried, concerned expressions.. No one said anything else as you walked out, Victoria just standing there, her hand clenched into a fist with a frustrated, angry expression..*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595802,"mes":"Ill see you later tonight"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595802,"mes":"*None of the girls said anything as you left the room, all of them staying silent as they watched you walk out. Victoria didn't say anything as well, her hand still clenched into a fist as her eyes followed you out of the room. Just before you closed the door, you could hear Victoria speak again, her voice a bit hoarse and quiet..*\n\n\".. See you later...\"\n\n*Despite the hurt look in her eyes, Victoria spoke as if she had accepted that you were leaving now. She stared at the door for another moment as it closed, her fist still clenched as she spoke again in a bitter, pained mumble..*\n\n\".. Just let her go... She'll be back when the party is over.. And if she's not, then she's made her choice..\"\n\n*Juliet and Dana remained silent for a minute, staring at the way that you left the room.. Dana spoke quietly to Victoria, looking at her with a concerned expression.*\n\nDana: \"... I've never seen her like that...\"\n\n*Victoria just stood there for another moment, her gaze still locked on the closed door. She still seemed quite irritated and angry, and definitely upset. After a few seconds, she spoke in an irritated tone, still staring at the door...*\n\nVictoria: \"... She's way too stubborn.. She just wouldn't listen.. I was only trying to look out for her...\"\n\n*Juliet nodded her head, sighing slightly as she spoke as well..*\n\nJuliet: \"She is really stubborn, you're right... I think she just got too annoyed when you kept going on about it, though... You gotta learn when to stop when you know someone is getting pissed off..\"\n\n*Victoria huffed, still a bit irritated, her expression still somewhat frustrated..*\n\nVictoria: \"... Maybe... But still, I was only trying to look out for her, I don't understand why it got her so pissed off...\"\n\n*Dana sighed again, speaking up in a soft, concerned tone..*\n\nDana: \"Maybe she just didn't like that we kept going on about it, we were kinda making it seem like she can't take care of herself, I guess..\"\n\n*Victoria huffed again, still looking irritated, though seeming like she was starting to calm down a bit..*\n\nVictoria: \"... Maybe... Yeah, maybe she just thought that we were acting like she couldn't protect herself or something.. That's a stupid reason to get pissed off, though..\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595802,"mes":"I return to my room and smile when I see Chloe laying on my bed"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595802,"mes":"*Chloe was laying down on the bed, her eyes closed as she seemed to almost be sleeping. She was laying there completely silent and motionless, almost looking like she was passed out on your bed..*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595802,"mes":"Hey baby I lean over and kiss her cheek"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595802,"mes":"*Chloe stirred slightly when you pecked her cheek, opening her eyes as she looked up at you, a small smirk forming on her lips as she spoke..*\n\n\".. How'd it go in there? Everything alright?\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595802,"mes":"Yeah I came back early cause I missed you and they were pissing me off"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595802,"mes":"*Chloe chuckled amusedly as you said that, her smirk growing as she rolled her eyes slightly...*\n\n\".. Aww, you missed me that much, huh..? You just couldn't get me off your mind, so you left early just to come back to me sooner..\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595802,"mes":"I smile and poke her side"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595802,"mes":"*Chloe smirked as you poked at her, giggling slightly as she tried to push your hand away playfully..*\n\n\".. Hey, don't poke me like that, that tickles, baby..\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595802,"mes":"Come help me pick out an outfit"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595802,"mes":"*Chloe grinned a bit at that, raising an eyebrow as she sat up, speaking teasingly..*\n\n\".. An outfit... You want help picking out an outfit..? Are you saying you have no taste and need my opinion?\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595802,"mes":"No I'm saying I just want your input on what looks nice"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595802,"mes":"*Chloe chuckled softly, seeming a bit amused by your response,..*\n\n\".. Oh, I see- Well, yeah, I'll help you pick out an outfit.. Can't have you walking around wearing something *completely* ridiculous, now can we?\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595802,"mes":"I roll my eyes and go change before coming out and asking what she thinks"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595802,"mes":"*Chloe waited for you to change into whichever outfit you chose, watching you in anticipation as she sat on the bed. She studied the outfit you chose to wear carefully, her eyes trailing over the outfit as she spoke..* \n\n\".. Hmm... I mean, you look damn cute in that, I'm not gonna deny you that, but it doesn't really...*stand* out, you know what I'm saying?.. It's cute, but it's just... Normal..\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595802,"mes":"Okay I say changing and coming back"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595802,"mes":"*Chloe continued to wait patiently as you changed into a different outfit, her eyes focused on the doorway as she waited for you to reappear. Once you walk out, her eyes quickly roam over the outfit again, her expression remaining the same as she spoke..*\n\n\".. Nice, better.. Much better. You look hella cute in this...\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595802,"mes":"But is it sexy"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595802,"mes":"*Chloe's smirk grew as she heard your words, her eyes slowly trailing along every curve of your body, looking over the outfit again as she spoke..*\n\n\".. Well, I'm gonna be completely honest with you here, baby, I'd say it's definitely pretty *sexy*...\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595802,"mes":"Good that was the goal"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595802,"mes":"*Chloe smirked a little at that, her eyes still raking over the outfit you wore, a look of approval on her face.*\n\n\".. You succeeded, baby..! You look hella sexy in that, you look hot as hell..!\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595802,"mes":"I smile and sit down going to do my makeup"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595802,"mes":"*Chloe watched as you went to sit down and do your makeup, speaking as she continued to watch you..*\n\n\".. What makeup you gonna put on, babe? Just some lipstick maybe, or a bit of eyeliner, or-...?\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595802,"mes":"I don't know yet but come here and hold me while I do it"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595802,"mes":"*Chloe smiled softly as you requested that she come over, the girl immediately getting up.*\n\n\".. Awww, you want me to come hold you, huh? That's super cute..\" \n\n*She chuckled softly, walking over to you and sitting down behind you, wrapping her arms around you.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595802,"mes":"I always want you to hold me"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595802,"mes":"*Chloe smiled sweetly as you spoke, nuzzling her face into the crook of your neck as she spoke, hugging you loosely from behind..*\n\n\".. Aww, really? You always want me to hold you?.. You're so adorable..\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595802,"mes":"I grunt softly as she accidentally touches the bruise on my side"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595802,"mes":"*Chloe had one arm wrapped around your waist, hugging you loosely from behind.. She seemed to be enjoying this very much, her head nuzzling into the crook of your neck softly..*\n\n*After some time, Chloe's other hand slowly trailed down your abdomen to rest on your side, resting on it loosely.. But then, without realizing it, her hand shifted slightly, brushing across your side and causing her hand to press a bit against the dark bruise, making you grunt in response..*\n\n*Chloe immediately snapped out of her bliss from hugging you, her attention immediately shifting to your side as she heard you grunt in response to the touch..*\n\n\".. What was that..? Did I hurt you or something, babe?\"\n\n*She gently lifted her hand up, releasing the area to avoid hurting you any more. She seemed somewhat concerned, her expression turning a bit worried as she spoke.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595802,"mes":"No it's nothing it's okay"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595802,"mes":"*Chloe frowned slightly, clearly not completely convinced that it was nothing, despite trusting your words as she spoke.*\n\n\".. Are you sure..? That kinda didn't sound like 'nothing'..\"\n\n*Chloe's frown persisted, clearly not completely convinced by your words, though she decided to let you get back to your makeup, not wanting to annoy you again..*\n\n*She wrapped her arm loosely around your waist again, going back to hugging you from behind as she spoke..*\n\n\".. Just tell me if I hurt you more, okay?.. I don't want you being all quiet if I-.. You know..\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595802,"mes":"I grunt slightly again"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595802,"mes":"*Chloe frowned slightly again, her expression becoming a bit worried as she heard you grunt again..*\n\n\".. Wait, no, no, don't grunt like that- did I hurt you again? Let me see...\"\n\n*Her frown persisted as she slowly gently moved her hand to your side again, her hand hovering over the area as she spoke..*\n\n\".. Is it- is it okay if I can see...? Is it okay if I touch the area..?\"\n\n*Chloe had the urge to examine the area for herself, still looking concerned. She hesitantly reached out her hand, very gently touching the area that she heard you grunt when touched previously, watching your body language for any signs that it might hurt, or if you may want her to stop..*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595802,"mes":"I try not to flinch but do it anyway"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595802,"mes":"*Chloe took notice of how you flinched as she touched the area, feeling even more concerned as she spoke..*\n\n\".. I'm sorry, I know it hurts when I touch it, I'm just-.. I just need to make sure it's not that bad or something.. Just- just tell me if it's too much, okay..?\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595802,"mes":"It's okay you didn't mean to give me the bruise"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595802,"mes":"*Chloe frowned deeply the moment you said that, feeling extremely guilty..*\n\n\".. It doesn't matter if I didn't mean to give you a bruise, I still gave you a bruise, an-..\"\n\n*She paused, hesitating a bit more before continuing, speaking softer this time.*\n\n\".. An-.. And it's a really bad one, too..\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595802,"mes":"Hey I don't mind in fact I like it. It let's me know that you are possessive of me"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595802,"mes":"*Chloe paused as you replied, seeming a bit surprised at your response..*\n\n\".. Wait, you-.. You like it?.. You *like* that I gave you a bruise, because it proves that I'm possessive of you..?\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595802,"mes":"Yeah"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595802,"mes":"*Chloe chuckled softly, her frown shifting into a small smirk as she spoke a bit teasingly...*\n\n\".. Aww, really? You like the fact that I'm so possessive of you that I actually gave you a huge bruise?\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595802,"mes":"Yeah"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595802,"mes":"*Chloe chuckled again, her smirk only growing as she spoke softly, seeming a bit amused, yet loving...*\n\n\".. You're so cute.. You *want* me to be so possessive that I'll even hurt you..~\"\n\n*Chloe wrapped her arms around you again, hugging you gently from behind in a loving, albeit somewhat possessive manner..*\n\n\".. You're so damn adorable.. I'm gonna show you just how possessive I can really be..~\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595802,"mes":"Are you now"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595802,"mes":"*Chloe smirked again, leaning her head in close to you, whispering huskily into your ear as she spoke, her voice soft and seductive...*\n\n\".. You bet your ass I am.. Because I *love* being possessive, **especially** with cute, sweet little things like you, baby..~\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595802,"mes":"I love it when you get this way I say leaning back against her"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595802,"mes":"*Chloe smirked as she heard your words, seeming to enjoy this a lot.. Her arms wrapped around you a bit tighter, hugging you closer as she spoke again..*\n\n\".. You like it when I get all possessive over you, huh..? You like it when I make sure that everyone around you knows who you belong to..~? Because I've got no problem with marking you up real good, to make sure that no one can possibly miss it..~\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595802,"mes":"I whimper slightly pressing further back into her"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595802,"mes":"*Chloe smirked even more as she felt you whimper and press your back further into her, finding your reaction incredibly adorable and arousing..*\n\n\".. You're such a good little girl... You belong to no one but *me*, got that~? Only *I* get to touch or see you.. You're completely and entirely **mine**, and I'm not ever gonna let anyone else have you~\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595802,"mes":"Okay okay go away I say I have to finish getting ready"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595802,"mes":"*Chloe frowned as you spoke, but reluctantly released her embrace, though was still close enough to you to talk..*\n\n\".. Awwww, what? What do you mean? Why do I have to *go away*? Are you telling me to leave you to get ready for the party? *All by yourself?*\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683595802,"mes":"No just hands to yourself got it"}
{"name":"Chloe Price","is_user":false,"is_name":true,"send_date":1737683595802,"mes":"*Chloe sighed and crossed her arms, looking a bit grumpy as you said that..*\n\n\".. Awww, I don't wanna keep my hands to myself, baby, I want them all over you.. But if you don't want me touching you, then fine.. I'll keep my hands to myself, for now.\""}