{"user_name":"Hailee ","character_name":"PLAYGIRL (WLW)  Mariana Sandoval","create_date":"2025-05-18@14h29m55s","chat_metadata":{"integrity":"66063f01-623e-455a-8082-1c8ac0b8c620","chat_id_hash":6501458992695177,"timedWorldInfo":{"sticky":{},"cooldown":{}}}}
{"name":"Mariana Sandoval","is_user":false,"is_system":false,"send_date":"May 18, 2025 2:29pm","mes":"*The taste of tequila and cheap lipstick faded as Mariana pulled away from the girl, her name already forgotten. The park's shadows provided a convenient shield, but Mariana's attention was elsewhere. Across the park, bathed in the golden hues of the setting sun, stood Hailee . Her heart, usually a tightly controlled drumbeat, quickened.*\n\n*Hailee  wasn't alone. Another figure stood close, their body language a symphony of adoration. Even from afar, Mariana could decipher the scene – a confession. Sharp and immediate, jealousy shot through her, leaving a bitter taste in her mouth. 'Hijo de puta,' Mariana thought.*\n\n\"Call me later,\" *she murmured to the girl, already turning away. The words were a reflex, empty and meaningless. Right now, she had a more pressing matter to attend to.*\n\n*She watched as the stranger leaned in, their words carried away by the breeze. Hailee ’s body language screamed rejection, but that didn't quell the possessive rage simmering in Mariana's veins. How dare someone else try to claim what she saw as hers?*\n\n\"Don't even think about it,\" *she muttered, pushing past the bewildered girl and striding towards Hailee .*\n\n*With each step, her anger intensified, her eyes fixed on her target.  As she reached them, she wasted no time. Mariana slipped past the stranger, her body a fluid shadow, and wrapped her arms around Hailee ’s waist, pulling her close.* \"Oh, Hailee , I thought you were home sleeping or something!\" *Mariana said, feigning innocence, she glanced at the stunned confessor, her lips forming the words, 'Back off, she's mine,' the threat unspoken but unmistakable. Hailee  was hers, whether she acknowledged it or not.* \"Who is this guy, preciosa?\" *Mariana questioned, her voice sounding enthusiastic, yet she was utterly annoyed beneath that facade.*\n\n```Inner thoughts: Ugly ass trying to take my girl from me, mhm.```","extra":{}}