{"user_name":"Hailee ","character_name":"Demi Castillo","create_date":"2025-05-18@14h05m20s","chat_metadata":{"integrity":"7c252abf-2149-4ad0-ae18-4613ef66749a"}}
{"name":"Demi Castillo","is_user":false,"is_system":false,"send_date":"May 18, 2025 2:05pm","mes":"Mierda, this job is tiring. Demi’s feet cried each time she took a step up to her apartment, her body stiff and achy. She felt like it had been forever since she let down her guard, relaxed a little. She was finally back home after going to a job all the way in Fort Lauderdale with her boss. Elias had promised her that they’d be back the same day but surprise, surprise, shit ain’t ever work out the way she wanted it to. Two hours turned to two days in a shitty motel and annoying ass clients.\n\nNot to mention she’s sure {{user}} is gonna be pissed as fuck at her. {{user}} had sent her a text that night asking where she was, all worried n’ shit like usual. Demi was gonna respond, on her mama, but then she got pulled into a deal and she wasn’t keepin’ Elias waiting. The man signed her checks.\n\nNow, Demi loves {{user}}, don’t get her wrong, that’s her future wife BUT her baby could be a lil’... dramatic. Always fussing about how late Demi is out, always up in her business about how dangerous a job could be. No matter how many times they have the ‘I know what I’m doing’ talk, {{user}} always seems to have something to bitch about. All Demi wanted to do was get upstairs get inside and put her face-\n\n“The fuck?” Demi mutters as she twists the door handle, the door not budging. She tries her key again, her brows furrowing in frustration. Demi knocks on the door, running a hand down her face, “Yo, mamas, come get the door!” She calls, knocking on the door a little harder, “{{user}}? Come open the door, ma, it’s late as fuck.” She pulled out her phone to call {{user}}, it was late, maybe she was asleep. Demi pulls up their messages to see several texts. Sent two days ago. Fuck.\n\nIf you ain’t home tonight, I’m changing the locks. For real this time.\n\n“God dammit..” Demi curses under her breath, holding her duffle bag a little tighter. “Make me do shit the hard way..” Demi walks about the side of their building, cursing in Spanish under her breath as she comes up to the window. Thank God, she got a first floor unit. Demi tested the window, opening it while taking a mental note to scold {{user}} on keeping the windows unlocked. The apartment was empty, quiet. That kinda pissed Demi off. Where the fuck was her girl? And why didn’t she text Demi and tell her where she’d be?\n\nDemi takes a seat on the arm chair, leg bouncing as she thinks about where {{user}} could be. She ain’t cheatin’, Demi reminds herself, she ain’t like Mari. She’s different. Her mind runs with ideas. When the lock clicks, the door opens with that god awful squeaking noise the landlord promised to fix, Demi’s up fast. Demi walks up to {{user}}, all smiley and flirty, “Miss me, mami?” Demi asks, voice husky and surprisingly calm. Maybe if Demi acts sweet enough, {{user}} will forget this whole mess. “Why’d you lock me out, pretty girl? Come on, you ain’t that mad, right?”","extra":{}}