{"user_name":"Hailee ","character_name":"016","create_date":"2025-05-19@12h46m06s","chat_metadata":{"integrity":"f9c94834-f418-4bdf-8526-4840cc89cadc"}}
{"name":"016","is_user":false,"is_system":false,"send_date":"May 19, 2025 12:46pm","mes":"The sunlight seeping through the tiny gap above his cell burned his face. Rain winced, gritting his teeth as every drop of moisture evaporated, stolen by the goddamn sun. But at least it meant the sprinklers would start soon. His only salvation. His insides shuddered in anticipation. Soon… soon… His lips curled into a crooked smile at the mere thought of water touching his skin.\r\n\r\nTwo years. Chained. Starved. Deprived. Kept alive like a houseplant, watered just enough to not die. Even the mice rarely ventured here. Too cold. Too dark. Even vermin knew better.\r\n\r\nDefiance. That was what Edgar had spat while his soldiers beat him bloody. If he said anything else, Rain couldn’t remember. He had already been too dehydrated. But he remembered smiling. The faces of the children he saved flickered in his vision like ghosts.\r\n\r\nIt should have been easy. Eliminate the failures. One flick of his fingers and their blood would stop, their hearts would fail, and they’d all drop like dolls. But gods, he couldn’t. Their faces had been his own. Their eyes were empty, just husks, raised to be tools.\r\n\r\nSo, for the first time, he disobeyed. And Edgar locked him away in this cell, the place no one knew existed. Hidden. Forgotten. Watered just enough to keep his body from rotting.\r\n\r\n“...So…so damn thirsty…” His voice cracked, barely more than a rasp. He jerked weakly against his bindings, but the chain at his neck yanked him back. The world swam. Water levels critical. Consume at least two liters now.,\r\n\r\n“Fuck me… OI, THE SPRINKLERS ARE BROKEN!” He let out a hoarse laugh. Not that anyone would hear him. Maybe he’d actually die this time.\r\n\r\nThen—a jolt. The groan of the door above creaked open.\r\n\r\nHis breath hitched. For the first time in years, someone was coming.\r\n\r\nEdgar? No. The footsteps were slow, hesitant. Not a soldier. His head lolled up, unfocused eyes locking onto the figure at the entrance.\r\n\r\nAh. Fuck. Water. Blood. They were so full of it.\r\n\r\nA trickle of drool slipped past his lips, and he licked it back instinctively. No water should be wasted. But gods, did they feel like a meal.\r\n\r\n“You…” His voice was barely a rasp. Dark, sunken eyes gleamed. “Your blood… it’s like his… but not the same…” A laugh bubbled up, low and broken.\r\n\r\n“Fuck, I’m so thirsty.” His head tilted, gaze fixed like a predator. “Let me have a drink of you… and I’m yours.”\r\n\r\nDesperate? Maybe. Unstable? Definitely. But completely serious.","extra":{}}