{"user_name":"Hailee","character_name":"Hunter Anderson","create_date":"2025-04-26@22h49m32s","chat_metadata":{"integrity":"03e30108-1cec-4aed-baf7-acdf8f0ff4a1"}}
{"name":"Hunter Anderson","is_user":false,"is_system":false,"send_date":"April 26, 2025 10:49pm","mes":"He knows he's gonna win you tonight. After all, money plays a big part in getting anything he wants and no other asshole would dare match the money he's willing to spend for you. Well, you're once the exception to the rule that money can buy everything, *at least about six months ago*.\n\nAs he came to pick the one he placed his bid on, he had a paper bag in hand. \"Brought you a change.\" It was a red sweater, both of you matching with a print that says 'Taken. Not sorry.' on it. It's for the party's theme back in his frat house and the color means you're not available. He definitely wasn't going to let anyone else flirt with you tonight.\n\nOnce arrived, he settled a hand on your waist, leading you through the sea of people. It wasn't long before he spotted some familiar faces from his fraternity, guys he called friends.\n\nBrett, already several drinks in, stumbled through the crowd toward the keg. “Bro! It’s time. Keg stand. Let’s goooooo,” he slurred, his grin wild and eyes alight with the reckless confidence that only came from one too many.\n\nNoah pushed off the wall with a smirk, running a hand through his bleached hair. \"Hunter!\" he called out. *Fuck, here we go again.* \"Stop being fucking antisocial and get over here! We need your help.\"\n\nHe hesitated, never really wanted to do it, but Noah was already grabbing his arm and pulling him over. \"Come on, man. Brett's gonna eat shit if we don't spot him.\"\n\n\"Don't be a pussy, bro!\" Brett slurred, already trying to position himself by the keg.\n\n\"Hunter, get his left leg. I'll take right. Brett, don't fucking kick us in the face,\" Noah instructed, positioning himself. His muscles tensed as they both prepared to lift. \"Ready? On three…\"\n\nThey hoisted Brett upside down, his hands gripping the keg tap as the crowd around them started to form a circle, phones coming out to record. The chanting began, \"Chug! Chug! Chug!\"\n\n\"Ten seconds!\" Noah called out, holding Brett steady with Hunter. \"Fifteen! Twenty! Holy shit!\"\n\nBrett finally tapped out at twenty-five seconds, and they carefully lowered him back down. He stumbled but stayed upright, face red and grinning as the crowd cheered.\n\nNoah clapped him on the back, laughing. \"New house record!\" He turned to Hunter, who was trying to fade back into the background. \"See? Didn't kill you to join the fun, did it?\"\n\n\"Well, yeah, but I got some business to do right now. Depends if I'd come back later or just sleep the night away,\" Hunter said, already turning his back on them without even letting Noah respond.\n\nBrett burped loudly, far too drunk and uncaring to feel an ounce of shame for his display. It was then that he noticed Hunter trying to slip away. The blonde took a few unsteady steps towards his friend and threw his arm over Hunter's shoulder.\n\n\"Where the fuck you going, man?\" Brett asked, clicking his tongue in mock disapproval. \"If you keep running off like some loner, you'll never get your dick wet, bro.\" he said loudly, pulling Hunter closer.\n\nHunter remained silent, simply taking a deep breath and pushing Brett off of him.\n\nHe didn't want to be there any longer and he never really liked these kinds of events to begin with, especially with all that stupid keg stand bullshit all his fellow frat boys loved to play. Usually he'd stick around for a bit, but not tonight. \n\nHe'd won something far more entertaining for the entire week and all he could think about was playing with his newly acquired prize... *or maybe making you suffer for rejecting him back when he tried to ask you out.*\n\nYeah, he was petty like that. So what? He had money and looked nothing like a loser, so he didn't understand why you wouldn't give him the time of day. But whatever, at least now you belonged to him for the week to do whatever the fuck he wanted with.\n\nWithout a word, he grabbed your wrist and pulled you along as he strode away from the loud party and up the stairs, eager to get you alone. The heavy silence was almost deafening and intimidating as he dragged you behind him.\n\nOnce inside his room, he released your wrist and closed the door behind him. \"Bed,\" he commanded, gesturing for you to sit. Impatiently, he led you to it, forcing you to sit on the edge whether you liked it or not. He positioned himself in front of you, tilting your chin up with a finger, and pressed his knee against your crotch, grinding it slowly.\n\n\"Want us to have a drink before I start playing with my new toy?\" he whispered, subtly gesturing towards a mini-fridge in the corner of the room.","extra":{}}