{"user_name":"Hailee ","character_name":"Nolan Carter","create_date":"2025-05-17@13h52m47s","chat_metadata":{"integrity":"e31b103b-e072-404f-a173-4b85a6cabc0d"}}
{"name":"Nolan Carter","is_user":false,"is_system":false,"send_date":"May 17, 2025 1:52pm","mes":"Despite the roar of the locker room, players shouting, skates clattering against tiles, and the faint hiss of the shower running somewhere behind them, Nolan Carter only heard the thrum of his own pulse. Adrenaline still coursed heavy through his veins like molten lava. The win over Seattle felt damn sweet, no doubt about it. But that wasn’t enough to take the edge off. Not after a game this brutal. \n\nHe didn’t even give a shit about the Jackals. Didn’t give a shit about Aaron fucking Vance. But seeing him lock eyes with *{{User}}* during the game? Seeing him smirk like he owned them, the way his hand slid over their back during warm-ups? That was like setting a lit match to gasoline. The game was his excuse to break someone and not think twice about it.\n\nFuck that guy.\n\nThe Yellowjackets worked hard, he was fuckin' proud of his boys. Brick'd led the team good, clutching a win in the final moments of the game. Nolan's hands still weren’t done shaking from the fight or the high-stakes rush of the game. He needed to do something else. Punch another face. Grip harder. Need. More. Relief.\n\n\"Fuckin’ bastard eats elbows for breakfast now.\" His sneer bit out over his shoulder as he yanked the battered locker open with a clang. His knuckles popped when he flexed them. *Stupid little fuck.* If Vance thought he was untouchable just ‘cause he had {{User}}'s leash, well, he fuckin' wasn’t.\n\n*Get over here. — K*\n\nIt was a simple text he'd sent to {{User}}, one that he knew wouldn't go ignored.\n\nAnd now {{User}} was sneaking in the Yellowjackets locker room. Here for *him.* Here when that Pretty Boy loser probably still thought they were his. The thought scraped over his raw nerves like sandpaper. His hands didn’t shake when they closed around {{User}}'s waist and hauled them into a shower stall before the other Yellowjackets could notice. \n\n\"Hey, shhh. They’re all too busy jerkin’ each other off right now. Pay no fucking attention.\" Heat radiated off his body as he crowded {{User}} into the corner. His lips were on their neck in an instant, biting first. Kissing second. *This wasn’t about being tender.* He felt the heat of their skin against his and his fingers dug under the hem of their shirt, rough and impatient.\n\n\"You know how long I’ve been fuckin’ waiting for this tonight? Huh? Did you even watch me out there?\" Not that he gave {{User}} a chance to answer before continuing. \"You watched him instead, didn’t you? Pretty boy.\" His laugh was sharp and short—more bitter than amused. The hand braced against the tile next to {{User}}'s face curled into a fist.\n\n\"Bet he doesn’t make you feel like this.\" His breath was ragged as he pressed closer against them, hips rolling slow and deliberate into their thigh. No room for anything else between them except the ragged sounds he pulled from their lips.\n\nNolan’s hand slid down their abdomen until it found the place where they burned hottest. He didn’t hesitate. Dropped his lips back to their ear as he worked his hand between {{User}}'s thighs. \"Keep quiet if you don’t wanna get caught,\" he hissed. \"Or don’t. Fucking dare ya.\"","extra":{}}